{"original_price":0,"date_last_updated":"2012-09-25 03:40:09","description":"<h2>PlayStation Network</h2><p>The PlayStation Network is the online platform that Sony uses for their <a href=\"http://www.giantbomb.com/playstation-3/60-35/\">PlayStation 3</a>, <a href=\"http://www.giantbomb.com/psp/60-18/\">PlayStation Portable</a> (PSP) and <a href=\"http://www.giantbomb.com/playstation-vita/60-129/\">PlayStation Vita</a> (PSVITA) systems. There is no fee to become a user and use all of its features.</p><h2>PlayStation Store</h2><div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"407088\"><div class=\"wiki-img-right\"><div class=\"wiki-img-thumb\"><a href=\"http://media.giantbomb.com/uploads/0/3165/407088-playstation_store_super.jpg\" title=\"The PlayStation Store\"><img id=\"407088\" src=\"http://media.giantbomb.com/uploads/0/3165/407088-playstation_store_thumb.jpg\" alt=\"The PlayStation Store\" /></a><div class=\"item-caption\">The PlayStation Store</div></div></div></div><p>The main source of distribution of content on the PlayStation Network is through the PlayStation Store. The PlayStation Store provides different kinds of content, such as games, demos, trailers, themes, wallpapers, add-ons, music, television shows, and movies, either for free or for a fixed price. The PlayStation Store is updated every Tuesday with new content, and on special occasions like E3 it is updated off-schedule.</p><h3>PlayStation Store for PC</h3><div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"1800774\"><div class=\"wiki-img-right\"><div class=\"wiki-img-thumb\"><a href=\"http://media.giantbomb.com/uploads/3/38238/1800774-psn_store___media_go_super.jpg\" title=\"Media Go's Game Store\"><img id=\"1800774\" src=\"http://media.giantbomb.com/uploads/3/38238/1800774-psn_store___media_go_thumb.jpg\" alt=\"Media Go's Game Store\" /></a><div class=\"item-caption\">Media Go's Game Store</div></div></div></div><p>The Media Go management program has a storefront within it,\nbut as the software is meant for PSPs and Sony-Ericsson phones, it cannot\naccess PS3-only content. All PSP products can be accessed, purchased,\ndownloaded, and transferred. Anything from the video store can either be pushed\nto PSP or viewed/kept on the PC. Digital Comics from a multitude of publishers\nare also available, but unlike videos, they cannot be viewed on a computer and\nmust be transferred to the PSP.</p><h3>Payment Methods</h3><div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"1095704\"><div class=\"wiki-img-right\"><div class=\"wiki-img-thumb\"><a href=\"http://media.giantbomb.com/uploads/2/22115/1095704-psnportableid_super.png\" title=\"Your PSN account.\"><img id=\"1095704\" src=\"http://media.giantbomb.com/uploads/2/22115/1095704-psnportableid_thumb.png\" alt=\"Your PSN account.\" /></a><div class=\"item-caption\">Your PSN account.</div></div></div></div><p>Unlike some other online platforms that use points as a means of currency, the PlayStation Store uses the same currency of the country in which the user resides. There are different kinds of payment methods accepted on the PlayStation Store. When you add funds onto your account, those funds are stored in your \"Wallet\". Different methods of adding funds include:</p><ol><li>Credit Card</li><li>Pre-Paid Card</li><li>PLAYSTATION Network Card</li></ol><p>It should be noted that as of Winter 2008 major retailers such as Walmart, Target, and GameStop carry the PlayStation Network Cards. The cards come in denominations of twenty and fifty dollars.</p><h3><b>PSP PlayStation Store</b></h3><p>The PlayStation Store was integrated with the PSP in October of 2008. As a part of the PSP update 5.00, PSP users are able to access the store right from their handhelds to download games and media right to their memory stick. This store is the same as the one available for PC. It is important for Sony's strategy to continue to push digital distribution with the PSN so that PSP games will be available day and date to download off the store. The PSP Go is dependent on this due to its lack of a UMD drive.</p><h2>Life with PlayStation</h2><div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"1800776\"><div class=\"wiki-img-right\"><div class=\"wiki-img-thumb\"><a href=\"http://media.giantbomb.com/uploads/3/38238/1800776-lwp_super.jpg\" title=\"\"><img id=\"1800776\" src=\"http://media.giantbomb.com/uploads/3/38238/1800776-lwp_thumb.jpg\" alt=\"\" /></a><div class=\"item-caption\"></div></div></div></div><p>On June 26, 2008, Sony announced Life with PlayStation. It is a free service that features a 3D globe where users can zoom in on certain sections to find the weather and news headlines of that area. At E3 2008, Sony also announced that Life with PlayStation will also allow users to upload videos from their games straight to YouTube. Life with PlayStation was released on September 18, 2008.</p><h2>PlayStation Home</h2><div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"1801175\"><div class=\"wiki-img-right\"><div class=\"wiki-img-thumb\"><a href=\"http://media.giantbomb.com/uploads/3/38238/1801175-playstation_home_logo_super.jpg\" title=\"\"><img id=\"1801175\" src=\"http://media.giantbomb.com/uploads/3/38238/1801175-playstation_home_logo_thumb.jpg\" alt=\"\" /></a><div class=\"item-caption\"></div></div></div></div><p>On December 11, 2008, <a href=\"/playstation-home/61-22581/\">PlayStation Home</a> moved into the public beta stage. Home (for short) is a 3D social network available for free on the PS3, through the PlayStation Network. It features a virtual world in which users can design an avatar, purchase virtual items, play dozens of games, use the Game Launching feature, watch movies, chat with one another, and do plenty of other things. For game developers, Home is primarily used as a way to let fans interact with certain franchises via Home Spaces, areas dedicated to specific themes.</p><h2>PlayStation Plus</h2><p>On June 29th, 2010, Sony launched a premium subscription service called PlayStation Plus through Firmware Update 3.40.</p><p>Features include:</p><ul><li>Hour long downloadable demos of full versions of select retail games (which can be purchased afterwords while retaining player progression and trophies)</li><li>Select free PSN games, PSOne Classics, and <a href=\"/psp-minis/92-3868/\">PSP Minis</a> updated monthly</li><li>Exclusive discounts</li><li>Exclusive Themes, Avatars, and Add-On Content</li><li>Early demos and beta tests</li><li>Subscription to Qore, a PlayStation focused video series</li><li>The option to have the PS3 turn on at a specified time, daily, to search for and automatically update</li><li>Cloud backup of saves (added in Firmware 3.60)</li></ul><p>All free content is determined by Sony, and only available for the month chosen. Users can only access their free games while subscribed under PlayStation Plus, though the ability to play will renew itself as soon as a new subscription is bought. More features may be implemented in the future. Subscription plans are available for $17.99 for three months or $49.99 for fifteen months.</p><p>Non-Plus users still have access to all previous features on PSN.</p><h2>The 2011 PlayStation Network Security Breach</h2><p>On April 20, 2011 Sony took down the PlayStation Network worldwide without any prior or post notice to consumers. This was later revealed to be in response to a report Sony had recived of a possible security breach that occured between April 17 and April 19, 2011. It was not until 6 days later on April 26, 2011 that <a href=\"/patrick-seybold/72-90506/\">Patrick Seybold</a>, Senior Director of Corporate Communications and Social Media for <a href=\"/sony-computer-entertainment-america/65-313/\">SCEA</a>, announced via the <a href=\"http://blog.us.playstation.com/\" rel=\"nofollow\">PlayStation Blog</a> that personal information for the entire user base, totalling near 77 million users at the time, had been obtained by an unknown third party. It was confirmed by Sony on May 2, 2011 that credit card details for 10 million users were exposed.</p><h3>The confirmed compromised information was as follows:</h3><ul><li>name</li><li>address (city, state, zip)</li><li>country</li><li>credit card details (which was later revealed to have been further encrypted and therefore inaccessible even after being stolen)</li><li>email address</li><li>birth date</li><li>PlayStation Network/Qriocity password and login</li><li>PSN online ID</li></ul><h3>The Welcome Back Program:</h3><p>Sony detailed their \"Welcome Back\" plan for the users of PSN, a compensation pack for the inconvenience. The pack will give everyone signed up for PSN 30 days free of their premium subscription service Playstation Plus, with all members already signed up to the service receiving an extra 30 days to their subscription. Qriocity members will also receive an extra 30 days to their memberships.</p><p>On May 16, 2011 Sony added more details to the welcome back program. This program will be available to all members with an active PSN account previous to the shut down. The program will be available for 30 days shortly after the PSN store is restored.</p><p><b>US:</b></p><p>All PlayStation Network customers can select two PS3 games from the following list. The games will be available for 30 days shortly after PlayStation Store is restored and can be kept forever.</p><ul><li>Dead Nation</li><li>inFAMOUS</li><li>LittleBigPlanet</li><li>Super Stardust HD</li><li>Wipeout HD + Fury</li></ul><p>For PSP owners, you will be eligible to download two PSP games from the following list. The games will be available for 30 days shortly after PlayStation Store is restored and can be kept forever.</p><ul><li>LittleBigPlanet (PSP)</li><li>ModNation Racers</li><li>Pursuit Force</li><li>Killzone Liberation</li></ul><ul><li>A selection of “On Us” rental movie titles will be available to PlayStation Network customers over one weekend, where Video Service is available. Those titles will be announced soon.</li><li>30 days free PlayStation Plus membership for non PlayStation Plus subscribers.</li><li>Existing PlayStation Plus subscribers will receive an additional 60 days of free subscription.</li><li>Existing Music Unlimited Premium Trial subscription members will receive an additional 30 days of free premium subscription.</li><li>Additional 30 days + time lost for existing members of Music Unlimited Premium/Basic subscription free of charge for existing Premium/Basic members.</li><li>To welcome users Home, PlayStation Home will be offering 100 free virtual items. Additional free content will be released soon, including the next addition to the Home Mansion personal space, and Ooblag’s Alien Casino, an exclusive game.</li></ul><p><b>EU/AU:</b></p><p>All existing PlayStation Network members will be able to access the following from PlayStation Store*:</p><p>Two PS3 games from the following list:</p><ul><li>LittleBigPlanet</li><li>Infamous*</li><li>Wipeout HD/Fury</li><li>Ratchet and Clank: Quest for Booty</li><li>Dead Nation*</li></ul><p>For those with PSP accounts, you will also be eligible to download two PSP games from the following list:</p><ul><li>LittleBigPlanet PSP</li><li>ModNation PSP</li><li>Pursuit Force</li><li>Killzone Liberation*</li></ul><p>- 30 days free PlayStation Plus membership for non PS Plus subscribers*</p><p>- Existing PlayStation Plus subscribers will be given 60 days free subscription.</p><p>- For existing Music Unlimited subscribers, you will be given 30 days free subscription.</p><p>- We are working on a Welcome Back offer in PlayStation Home and will share that when it is confirmed.</p><p><b>Asia:</b></p><p>Members who placed Asian addresses on their PSN get the following</p><table class=\"t-editor with-border full-width\"><tbody><tr><td><strong>PS3™:</strong></td><td></td></tr><tr><td><ul><li>The Last Guy (Chinese/English Version)</li><li>Come on, LocoRoco!! BuuBuu Cocoreccho (Chinese/English Version)</li><li>Trashbox (Chinese/English Version)</li><li>Hustle King (English Version)</li><li>WipEout ®HD Bundle (English Version)</li></ul></td></tr></tbody></table><p>- Dokodemo Issyo Spring Theme</p><p>- 30 Days Playstation Plus Free Services</p><p>- 60 Days free subscriptions for those who were already members</p><p>- A Special Playstation Home offer, regardless of time registered</p><h3>The return of PSN:</h3><p>On May 14, 2011 Sony started restoring select PSN services such as mutliplayer, Playstation home and trophy syncing. Nearly a month after it was shut down. On June 1, 2011 Sony had fully restored all of PSN's services.</p>","deck":"The PlayStation Network is the online service by Sony Computer Entertainment, providing downloads of games, trailers, themes and much more. The service is free, but also offers a paid version for various benefits.","company":{"api_detail_url":"http://api.giantbomb.com/company/995/","id":995,"name":"Sony Computer Entertainment Incorporated"},"install_base":77000000,"site_detail_url":"http://www.giantbomb.com/playstation-network-ps3/60-88/","id":88,"api_detail_url":"http://api.giantbomb.com/platform/88/","abbreviation":"PS3N","online_support":true,"date_added":"2008-04-22 10:53:10","image":{"icon_url":"http://media.giantbomb.com/uploads/0/1992/2122559-psnps3_icon.png","medium_url":"http://media.giantbomb.com/uploads/0/1992/2122559-psnps3_small.png","tiny_url":"http://media.giantbomb.com/uploads/0/1992/2122559-psnps3_tiny.png","small_url":"http://media.giantbomb.com/uploads/0/1992/2122559-psnps3_small.png","thumb_url":"http://media.giantbomb.com/uploads/0/1992/2122559-psnps3_thumb.png","screen_url":"http://media.giantbomb.com/uploads/0/1992/2122559-psnps3_screen.png","super_url":"http://media.giantbomb.com/uploads/0/1992/2122559-psnps3_super.png"},"release_date":"2006-11-08 00:00:00","name":"PlayStation Network (PS3)"}