{"original_price":0,"date_last_updated":"2012-09-24 02:36:55","description":"<h2>Overview</h2><p>In terms of games, the PC is the oldest gaming platform still in use today, having an established library of tens of thousands of games. Chances are, you're probably reading this wiki on a PC right now.</p><h2>History</h2><div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"1650285\"><div class=\"wiki-img-right\"><div class=\"wiki-img-thumb\"><a href=\"http://media.giantbomb.com/uploads/0/3661/1650285-ibm_pc_5150_super.jpg\" title=\"An old IBM PC.\"><img id=\"1650285\" src=\"http://media.giantbomb.com/uploads/0/3661/1650285-ibm_pc_5150_thumb.jpg\" alt=\"An old IBM PC.\" /></a><div class=\"item-caption\">An old IBM PC.</div></div></div></div><p>The first electronic computers were created between the 1930s and the 1940s. The first binary computer was the Z1 Computer, created by the German inventor Konrad Zuse. Other electronic computers would be created throughout the time period, including the ENIAC and the Harvard Mark I. Many of the first computers were used during <a href=\"/world-war-ii/92-471/\">World War II</a> by both factions and would be later used for scientific research. Early computers were large enough to fill a room, making them unusable for practical, personal use. Later it would be used by banks and large businesses for economic calculations. Companies like <a href=\"http://www.giantbomb.com/ibm/65-190/\">IBM</a> have supplied many businesses with computers years before the personal computer .</p><p>It wasn't until the 1970s where computers usable for the average person were being made. Invented in 1970 by John V. Blakenbaker of the Kenbak Corporation, the Kenbak-1 is considered by the <a href=\"http://www.computerhistory.org/timeline/?year=1971\" rel=\"nofollow\">Computer History Museum</a> to be the world's \"first personal computer\". Starting in 1971, it was sold for $750 and only 40 machines were ever built and sold. In 1973, Kenbak folded and stopped production.</p><p>Other revolutionary inventions would later pave the way to the modern computer. In 1971, engineers Bob Noyce and Gordon Moore created the first microprocessor, the Intel 4004. The microprocessor helped in creating a more powerful central processing unit than the ones used in computers at the time and shrunk it so computers could be smaller. The microprocessor was the major invention that started the personal computer.</p><p>In 1975, the Altair 8800, was released. Since the computer's main language was binary code and only had an output of flashing lights, the computer was unusable by the common person. It wasn't until 1977 when two California college students, Steve Wozniak and Steve Jobs, created the first personal computer with a monitor, the Apple I. Thanks to the monitor, programming became much easier and programmers could see exactly what they were doing. Also, it helped the average user see the programs people created. This sparked a new revolution in the computer industry, bringing the creation of <a href=\"http://www.giantbomb.com/apple-inc/65-5815/\">Apple Computers</a> and starting the personal computer market.</p><div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"1650295\"><div class=\"wiki-img-right\"><div class=\"wiki-img-thumb\"><a href=\"http://media.giantbomb.com/uploads/0/3661/1650295-alienware_malx_back_super.jpg\" title=\"Powerful laptops have made PC gaming mobile.\"><img id=\"1650295\" src=\"http://media.giantbomb.com/uploads/0/3661/1650295-alienware_malx_back_thumb.jpg\" alt=\"Powerful laptops have made PC gaming mobile.\" /></a><div class=\"item-caption\">Powerful laptops have made PC gaming mobile.</div></div></div></div><p>After the release of the <a href=\"http://www.giantbomb.com/apple-ii/60-12/\">Apple II</a>, many competitors formed, including the new IBM Personal Computer, which quickly dominated the market. Other competitors included <a href=\"http://www.giantbomb.com/commodore/65-2000/\">Commodore</a>, <a href=\"http://www.giantbomb.com/atari/65-182/\">Atari</a>, <a href=\"http://www.giantbomb.com/nec-technologies-inc/65-1741/\">NEC</a>, and <a href=\"http://www.giantbomb.com/amiga-corporation/65-6153/\">Amiga</a>. Thanks to the gaming crash of 1983, many computer manufacturers focused on the business aspects of these machines, leaving gaming as an afterthought. However, there were many computers that were well-known for their gaming libraries, including <a href=\"http://www.giantbomb.com/commodore-64/60-14/\">Commodore 64</a>, Atari 400/800, <a href=\"http://www.giantbomb.com/zx-spectrum/60-16/\">ZX Spectrum</a> (UK), and MS-DOS Compatible computers. Companies like <a href=\"http://www.giantbomb.com/ea-games/65-6256/\">EA</a> and <a href=\"http://www.giantbomb.com/origin-systems/65-344/\">Origin Systems</a> became the top PC gaming developers.</p><p>In the mid 1980s, the graphical user interface was implemented on new PCs. Now it was easier for people to see what they were doing with computers thanks to computers like the <a href=\"http://www.giantbomb.com/mac/60-17/\">Macintosh</a> and the DOS extension Windows. The GUI was first created by Xerox in the 1960s, but the company was not interested in entering the computer market. Apple was given the rights to use GUI for the Macintosh, however, Microsoft was able to trick Apple into lending them prototype Macintosh computers to create programs for the new machines. They used the coding of the operating system to create Windows, an extension to DOS. Thanks to the cheap $100 price point and its compatibility with all DOS computers, Windows became a success, becoming the new standard of computers.</p><p>In the 1990s, the Internet was released to the public after originally being used to connect college computers and military computers to different networks. Since the Internet was introduced to the public, it became a major part of modern society. Now the average computer user is able to access files from many different servers, and have the ability to communicate with people from around the world. This new technology was a revolution in gaming, with online gaming becoming a standard on the PC by the mid 1990s.</p><p>Today, billions of people around the world use computers, with most of them being connected to the internet.</p><h2>Operating Systems</h2><p>Before operating systems, one had to learn complex coding in order to get something to work. With the creation of operating systems, computers became more accessible to the public.</p><p><b>Microsoft Windows</b></p><div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"1650296\"><div class=\"wiki-img-right\"><div class=\"wiki-img-screen\"><a href=\"http://media.giantbomb.com/uploads/0/3661/1650296-1231525922_2_super.jpg\" title=\"Almost all PC games are designed for MS Windows.\"><img id=\"1650296\" src=\"http://media.giantbomb.com/uploads/0/3661/1650296-1231525922_2_screen.jpg\" alt=\"Almost all PC games are designed for MS Windows.\" /></a><div class=\"item-caption\">Almost all PC games are designed for MS Windows.</div></div></div></div><p>Windows was originally an extension to <a href=\"http://www.giantbomb.com/microsoft-game-studios/65-340/\">Microsoft</a>'s own coding system MS-DOS back in 1985. With Windows, people could easily browse through their files and do other simple functions much more quickly. Windows has grown in popularity and became the most popular OS in the world, having the support of PC makers like <a href=\"http://www.giantbomb.com/dell-inc/65-4850/\">Dell</a>, Gateway, and HP. Windows has gone through many iterations, starting with the MS-DOS days having Windows versions 1.0, 2.0, 3.0, 3.1, and 3.11. Then came Windows NT 3.0-4.0 and Windows 2000 (oriented toward business) and the Windows 9x operating systems including Windows 95, 98, and ME (oriented toward home users). The 9x line was dropped and later versions of Windows have been based on NT, continuing the line from 2000 through XP, Vista, and now Windows 7 (released on October 22, 2009).</p><p>The preferred platform for modern PC games is a Windows PC running either Windows XP, Vista, or 7. Windows XP does not support <a href=\"/directx/92-5193/\">DirectX</a> 10 but does not suffer from incompatibilities with older games like Vista and 7 may. Vista and 7 have the advantage of DirectX 10 or 11, and some exclusive games tied to the OS such as <a href=\"http://www.giantbomb.com/halo-2/61-7110/\">Halo 2</a>. Because of the negative feedback that came from Vista, game developers were reluctant to make DirectX 10 only games. Thanks to the success of Windows 7, more DirectX 10/11 only games are being made, most notably <a href=\"http://www.giantbomb.com/shattered-horizon/61-23436/\">Shattered Horizon</a>, <a href=\"http://www.giantbomb.com/just-cause-2/61-20742/\">Just Cause 2</a>, and <a href=\"/battlefield-3/61-27006/\">Battlefield 3</a>.</p><p>The newest edition, Windows 7, provides gamers with a games browser that notifies the user of patches and updates for some games as they become available. Windows 7 is generally faster than Vista and fixes many of the issues people had with that OS such as intrusive Security settings and sluggish performance, Windows 7 also comes with DirectX 11. <a href=\"http://www.giantbomb.com/dirt-2/61-24513/\">Dirt2</a> was among the first games to support this.</p><p>By the end of 2012, Microsoft will release Windows 8. It will be a more tablet-friendly operating system than previous Windows installments, including its own app store. Rumors also speculate that Windows 8 will be a more gamer-friendly platform and will support 128-bit processors.</p><p><b>Mac OS</b></p><div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"1650297\"><div class=\"wiki-img-right\"><div class=\"wiki-img-screen\"><a href=\"http://media.giantbomb.com/uploads/0/3661/1650297-macosx102_super.png\" title=\"Apple's Mac OS has a limited but growing game library.\"><img id=\"1650297\" src=\"http://media.giantbomb.com/uploads/0/3661/1650297-macosx102_screen.png\" alt=\"Apple's Mac OS has a limited but growing game library.\" /></a><div class=\"item-caption\">Apple's Mac OS has a limited but growing game library.</div></div></div></div><p>In 1977, <a href=\"http://www.giantbomb.com/steve-wozniak/72-93519/\">Steve Wozniak</a> and <a href=\"http://www.giantbomb.com/steve-jobs/72-9951/\">Steve Jobs</a> made the Apple 1, Apple's first computer. They later gained popularity with the <a href=\"http://www.giantbomb.com/apple-ii/60-12/\">Apple II</a>. In 1984, Apple released the <a href=\"/mac/60-17/\">Macintosh</a>, which was the first Apple computer to have an operating system. The Mac OS lineup was born. Later, Apple switched to Unix-like coding, creating the Mac OS X lineup, which is still used in the new Apple computer lineup today.</p><p>The main issue with gaming on a Mac OS is that almost all earlier Mac PCs were not compatible with Windows based video games. More recently however with the creation of applications such as Boot Camp and Parallels more games are able to be run. The development of Intel based Macs also helps reduce this barrier by lifting some of the hardware restrictions.</p><p>In May 2010, Valve released Steam for Mac OS X, and ported all of their Source games to the Mac platform by the end of 2010. Valve is hoping for the expansion of Mac gaming in the near future.</p><p><b>Linux</b></p><p><a href=\"http://www.giantbomb.com/linux-game-publishing-ltd/65-1422/\">Linux</a> is a Unix-like OS. Unlike Windows and Mac OS, which require specific hardware for the OS to work properly, Linux is a software-based OS, which can be installed on a variety of devices. Linux comes in various distributions, or \"distros,\" such as Ubuntu or Gentoo. Being an open source OS, the Linux community actively develops open source software, including games, for the Linux platform. You can get many Windows applications to work on Linux using specific Windows coding software for Linux (such as WINE) but it is generally not a preferable way of playing Windows games. Furthermore, WINE is not compatible with PowerPCs including PS3s with Linux installed. A popular option for overcoming Windows compatibility issues is to multi-boot the Linux distro with a version of Windows so that both operating systems are installed on the same PC at once and the user can switch between them.</p><p>The most popular Linux-based OS on the market right now is <a href=\"/android/60-123/\">Android</a>. It is a growing, open source mobile operating system with a growing gaming library.</p><h2>Components of a PC</h2><p>There are many replaceable parts in a PC, which is a main aspect separating them from consoles. PCs may be upgraded and maintained as time passes to keep up with the latest games, and a user's configuration will affect which games they can play. The main parts of a computer are as follows:</p><ul><li><b>CPU</b> <i>(Central Processing Unit)</i> - The processing unit that executes operations in a computer. It consists of an integrated circuit built of many transistors that runs on binary code. The CPU communicates with the rest of the computer through the Northbridge via a front side bus. Most medium and high end processors are 64-bit and have several cores which is known as parallel processing. The CPU creates a lot of heat and as a result requires its own dedicated heatsink or waterblock even on a low end computer.</li><li><b>GPU</b> <i>(Graphics Processing Unit)</i> - The dedicated graphics rendering device, very important for games. The GPU generally has its own circuit board which is slotted into the motherboard, the processing unit its self is also made up of many transistors and is heavily based on parallel processing. The GPU also uses its own dedicated RAM for storing texture data to be processed. Current generation GPUs are capable of rendering shader model 4.1 processes as part of the DirectX 11 package. Many graphics cards are also compatible with <a href=\"/opengl/92-5192/\">OpenGL</a>.</li><li><b>Motherboard</b> - The main circuit board in a PC that all the components connect to. Its through this board that all other components may communicate between each other and is run by a set of North and South bridge chipsets, though newer CPUs actually include an integrated nothrbridge.</li><li><b>RAM</b> (<i>Random Access Memory</i>) - Volatile dynamic memory of a system. Data can be temporarily loaded here to be accessed much faster than from the hard drive or even a solid state drive so not to slow the calculations made by the CPU. The current standard is DDR3.</li><li><b>PSU</b> <i>(Power Supply Unit)</i> - Supplies power to the PC. Needs to have high enough power (measured in Watts) to run all the components in the system under high load.</li><li><b>HDD</b> <i>(Hard Disk Drive)</i> - The main storage device of a PC.</li><li><strong>SSD</strong> <em>(Solid State Drive)</em> - A type of storage similar to a hard drive, but contain no moving parts. Because of this, data stored in solid state drives can be accessed and written quicker than hard drives.</li><li><b>Sound Card</b> - An expansion card that processes audio on a separate chip. Most motherboards provide integrated sound chips making sound cards an optional upgrade.</li><li><b>ODD</b> <i>(Optical Disc Drive)</i> - The peripheral device that reads optical discs such as DVDs, BDs, and CDs.</li><li><b>Case</b> - Houses the components.</li><li><b>Monitor</b> - The visual display unit of a computer.</li><li><strong>Input Devices</strong> - Mouse, keyboard, microphone, etc. Because of the uptake of the Xbox 360 most games from 2005 onward will work with the Xbox 360 controller. This is also helped by the fact that the Xbox 360 has a USB connection that allows game developers to easily port the control system from current console games to the PC</li><li><b>Cooling</b> - Commonly either water or air based. With standard cooling devices the lowest possible temperature is the ambient temperature, that of the room the system resides in. To further lower the temperature elaborate devices such as Peltier coolers, liquid gases or phase cooling may be installed, though this is best left to the extreme enthusiast due to the risk of most of these options.</li></ul><h2>Graphic Settings</h2><p>Unlike their console equivalents most PC games have the ability to vary the graphical settings. This feature is inherent to PCs as few systems bear the same hardware and so the user must tailor the game's settings for optimal performance and visual quality. With modern hardware PCs can often surpass their console counterparts in terms of technical graphics. Recent titles offer the option to set the ideal configuration of a game automatically. Such settings include:</p><ul><li><b>Resolution</b> - The number of pixels along the x and y axes to which the game will render.</li><li><b>Anti-Aliasing</b> - Raises the quality of the edges of polygon based models using smoothing algorithms.</li><li><b>Anisotropic Filtering</b> - Raises the quality of textures viewed from obtuse angles.</li><li><b>Texture Quality</b> - General resolution of the paint scheme of each model.</li><li><b>Model Quality</b> - General number of polygons used for each model.</li><li><a href=\"http://www.giantbomb.com/hdr-high-dynamic-range/92-618/\"><b>High Dynamic Range lighting</b></a> - Allows for dynamic tone mapping in games.</li><li><b>Shader Model</b> - Technology a game can use to render advanced visual effects.</li><li><b>Vsync</b> - Reduces an artifact known as <i>tearing</i> by synchronizing the frame rate and refresh rate of the monitor.</li></ul><h2>Game Lineup</h2><p><b>Early History</b></p><div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"614050\"><div class=\"wiki-img-right\"><div class=\"wiki-img-thumb\"><a href=\"http://media.giantbomb.com/uploads/0/6384/614050-worldofwarcraftboxart_super.jpg\" title=\"Blizzard is one of the most prominent PC developers.\"><img id=\"614050\" src=\"http://media.giantbomb.com/uploads/0/6384/614050-worldofwarcraftboxart_thumb.jpg\" alt=\"Blizzard is one of the most prominent PC developers.\" /></a><div class=\"item-caption\">Blizzard is one of the most prominent PC developers.</div></div></div></div><p>Computers first featured simple titles similar to <a href=\"http://www.giantbomb.com/spacewar/61-21514/\">SpaceWar!</a> or simple text-input games such as <a href=\"http://www.giantbomb.com/pool-of-radiance/61-16452/\">Adventure</a> but have since evolved to become the leading platform for cutting-edge game development due to their seemingly limitless potential. Old computers such as the <a href=\"http://www.giantbomb.com/commodore-64/60-14/\">Commodore 64</a> featured a built-in controller port for C64 controllers as well as <a href=\"http://www.giantbomb.com/atari-2600/60-40/\">Atari 2600</a> and other controllers. Many games supported both keyboard and joystick input. Since mice have become standard, they have become the preferable method of input for many games, with various manufacturers branding mice specifically for gaming. Joysticks are still widely used via USB. Early games were simply saved onto discs by a publisher or even the programmer themselves. These discs were sold in Ziploc bags and Vinyl slips; they generally had a bland manual and had nowhere near the shelf-presentation of a modern game. Modern games are distributed mainly on optical discs in hard plastic cases or cardboard boxes There has been a large surge in digital distribution as well.</p><p><b>Evolution in the 1990s</b></p><p>In the early days of computer gaming, most games were developed by a single programmer and were simple clones of arcade games or text adventures. PC gaming has since evolved to encompass a wide variety of genres, some faring better than others.</p><p>The most popular genres that have evolved on the platform are the CRPG <i>(Computer Role Playing Game)</i>, RTS <i>(Real Time Strategy)</i>, and FPS <i>(</i> <i>First Person</i> Shooter). CRPGs were largely inspired by pen and paper role playing games such as <a href=\"http://www.giantbomb.com/dungeons-dragons/62-167/\">Dungeons &amp; Dragons</a>. The genre spans early, ASCII adventures such as Rouge, action RPGs such as <a href=\"http://www.giantbomb.com/diablo/61-5985/\">Diablo</a>, and Massively Multiplayer RPGs such as <a href=\"http://www.giantbomb.com/world-of-warcraft/61-19783/\">World of Warcraft</a>. Freedom is a main element that has evolved with CRPGs. The earlier games were more linear in their approach, sometimes even approaching level design from a distinct \"stages\" standpoint. CRPGs evolved to have 3D dungeons, <a href=\"http://www.giantbomb.com/real-time-combat/92-2332/\">real time combat</a>, and huge multiplayer, non-linear worlds.</p><p>Real Time Strategy games, such as <a href=\"http://www.giantbomb.com/starcraft/61-13062/\">Starcraft</a> and <a href=\"http://www.giantbomb.com/command-conquer/61-4384/\">Command &amp; Conquer</a>, is a genre firmly rooted at the heart of PC gaming. The genre requires fast-paced clicking using a mouse, making implementation on consoles very difficult. The genre has certainly seen evolution, but the premise of collecting resources, spawning an army, and sending it into battle has remained relatively constant throughout RTS history.</p><div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"1228664\"><div class=\"wiki-img-right\"><div class=\"wiki-img-screen\"><a href=\"http://media.giantbomb.com/uploads/1/14976/1228664-steam2_super.jpg\" title=\"Steam comprises over 70% of the digital distribution market.\"><img id=\"1228664\" src=\"http://media.giantbomb.com/uploads/1/14976/1228664-steam2_screen.jpg\" alt=\"Steam comprises over 70% of the digital distribution market.\" /></a><div class=\"item-caption\">Steam comprises over 70% of the digital distribution market.</div></div></div></div><p>The third, and arguably most popular PC genre is the FPS. Starting with <a href=\"/id-software/65-347/\">iD Software</a>'s <a href=\"http://www.giantbomb.com/wolfenstein-3d/61-7694/\">Wolfenstein 3D</a>, the genre exploded into popularity (First using the mouse to look in <a href=\"http://www.giantbomb.com/duke-nukem-3d/61-3407/\">Duke Nukem 3D</a>). It's a genre that has been ported to consoles, but still controls better on PC due to quick, precise aiming with mice. Landmark FPS games include <a href=\"http://www.giantbomb.com/doom/61-7326/\">Doom</a>, <a href=\"http://www.giantbomb.com/quake/61-8015/\">Quake</a>, <a href=\"http://www.giantbomb.com/counter-strike/62-114/\">Counter-Strike</a>, and <a href=\"http://www.giantbomb.com/half-life/61-2980/\">Half-Life</a>.</p><p>The PC game industry has seen a steady push towards consoles for many years now, due to low sales numbers. These sales are often attributed to illegal downloading as well as the cost of upgrading one's system. The PC industry is largely kept alive by the convenience of having many games at ones fingertips on a PC as well as the superiority of certain genres on the platform.</p><p><b>Digital Distribution</b></p><p>However, even with retail PC game sales slowing, digital distribution has been expanding within the last few years. Popular digital distribution services like <a href=\"http://www.giantbomb.com/valve-corporation/65-1374/\">Valve</a>'s <a href=\"http://www.giantbomb.com/steam/92-718/\">Steam</a>, <a href=\"http://www.giantbomb.com/stardock-corporation/65-1064/\">Stardock</a>'s <a href=\"http://www.giantbomb.com/impulse/92-2377/\">Impulse</a>, and IGN's <a href=\"http://www.giantbomb.com/direct2drive/92-2378/\">DIrect2Drive</a> helped in boosting the sales of PC games and have helped in making many indie games popular. Other digital distributors, like <a href=\"http://www.giantbomb.com/good-old-games/92-2379/\">GOG</a>, sell older PC games that either don't sell in retail anymore or are too old to be compatible with newer operating systems. These services allow you to play older games and usually sell them for less than $10. These type of services help in having an easy way to play PC games and having developers keep in touch with their communities.</p><h2>Issues</h2><div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"1650290\"><div class=\"wiki-img-right\"><div class=\"wiki-img-screen\"><a href=\"http://media.giantbomb.com/uploads/0/3661/1650290-nvidia_fermi_class_quadro_professional_gpus_announced_2_super.jpg\" title=\"NVidia's popular GeForce series of GPUs.\"><img id=\"1650290\" src=\"http://media.giantbomb.com/uploads/0/3661/1650290-nvidia_fermi_class_quadro_professional_gpus_announced_2_screen.jpg\" alt=\"NVidia's popular GeForce series of GPUs.\" /></a><div class=\"item-caption\">NVidia's popular GeForce series of GPUs.</div></div></div></div><p><b>Upgrading</b></p><p>A primary issue with PC gaming is the barrier to entry due to cost. A modern computer can cost upwards of a $1,000 which is many times what a game console may cost, and if one is having a PC built by a company it can cost much more. Computer components in general need to be upgraded roughly every 2-3 years to keep up with the modern demands of the latest games. The cost of maintaining a high-end system is comparable to owning the popular consoles of a generation of gaming. However, there have been ways to get around this. If you are able to build your own computer and know where to get computer parts for cheap prices (such as Newegg or TigerDirect), you can build a gaming computer that will play many new releases for around $500.</p><p>The ability to selectively upgrade hardware also gives PC gamers a flexibility absent in console gaming. Users can upgrade RAM, GPU or hard drives to make their computers more powerful as the games become more demanding. In turn, this flexibility and constant increase in performance allows developers to create games that can fully utilize the latest hardware, often leading to more complex or better looking games.</p><p><b>Piracy and Digital Rights Management</b></p><p>One huge problem reported by publishers with PC gaming is the excessive piracy of games. Bootleg copies of games have been a problem since the introduction of the personal computer. Many computer experts were able to copy floppy disks and distribute them to either share with friends or profit off them. Since the introduction of the internet, it has been easier to distribute pirated software than ever before (including games). Bittorrent sites make it easier for people to put up game files where everyone can download and play.</p><p>Although piracy ranges across the world, the areas with the most piracy are third-world countries. These are areas that either have poor game distribution or have gamers that are too poor to afford many games. Piracy has also gone up since the economic crash of 2008.</p><p>There are many measures that game publishers use in attempts to prevent piracy. CD keys, unique codes to identify legitimately purchased games, were the first anti-piracy tactic used by PC game distributors. Sometimes CD keys are used to access certain parts of a game (like multiplayer, Games for Windows LIVE games). There have been many issues with CD keys. If you were to lose your CD key and needed to reinstall a game, you had to buy your game all over again. This type of security did not last long because pirates were finding ways to create fake CD keys that they could use to play pirated games. Digital Distribution has made CD keys mostly obsolete.</p><p>This led game publishers and various third parties to develop forms of <a href=\"http://www.giantbomb.com/digital-rights-management/92-1704/\">Digital Rights Management</a> (DRM). DRM is digtal software protection that prevents the user from using copied game discs and downloaded disc images or installing games on multiple machines. Some early forms of DRM may interfere with some applications such as disc drive emulation software used for mounting disc images.</p><div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"1650293\"><div class=\"wiki-img-right\"><div class=\"wiki-img-thumb\"><a href=\"http://media.giantbomb.com/uploads/0/3661/1650293-activationfailed2_super.jpg\" title=\"Activation failure screen for GTA IV.\"><img id=\"1650293\" src=\"http://media.giantbomb.com/uploads/0/3661/1650293-activationfailed2_thumb.jpg\" alt=\"Activation failure screen for GTA IV.\" /></a><div class=\"item-caption\">Activation failure screen for GTA IV.</div></div></div></div><p>There have been controversial uses of DRM within the last few years. In 2008, <a href=\"http://www.giantbomb.com/ea-games/65-6256/\">EA</a> announced that they are going to use a new version of <a href=\"http://www.giantbomb.com/securom/92-2720/\">SecuROM</a> DRM that limits the number of simultaneous activated installs, for all of their new PC games (starting with <a href=\"http://www.giantbomb.com/mass-effect/61-16909/\">Mass Effect</a> and <a href=\"http://www.giantbomb.com/spore/61-14139/\">Spore</a>). Since then. there has been a huge controversy over DRM, even questioning the legality of it.</p><p>In 2009, <a href=\"http://www.giantbomb.com/ubisoft-entertainment/65-82/\">Ubisoft</a> introduced a new DRM that will require you to be online at all times when playing a game. If you are disconnected from the internet for any reason, gameplay will stop. The first games to utilize the new DRM were <a href=\"http://www.giantbomb.com/assassins-creed-ii/61-22928/\">Assassin's Creed II</a> and <a href=\"http://www.giantbomb.com/silent-hunter-v-battle-of-the-atlantic/61-28094/\">Silent Hunter 5</a>. As of 2011, Ubisoft decided to discontinue and retool their online DRM system with the release of <a href=\"http://www.giantbomb.com/assassins-creed-brotherhood/61-31001/\">Assassin's Creed Brotherhood</a>, and was relaunched with the release of <a href=\"http://www.giantbomb.com/driver-san-francisco/61-31634/\">Driver: San Francisco</a>.</p><p>Common complaints about this type of DRM are losing game progress and not being able to play when an internet connection is unavailable. Other companies are using similar DRM including EA with <a href=\"http://www.giantbomb.com/command-conquer-4-tiberian-twilight/61-27130/\">Command and Conquer 4</a> and <a href=\"http://www.giantbomb.com/blizzard-entertainment/65-1088/\">Blizzard</a> with <a href=\"/starcraft-ii-wings-of-liberty/61-20674/\">StarCraft II: Wings of Liberty</a> and <a href=\"/diablo-iii/61-20803/\">Diablo III</a>. Both <a href=\"/command-conquer-4-tiberian-twilight/61-27130/\">C&amp;C4</a> and <a href=\"/diablo-iii/61-20803/\">D3</a> require a constant, active connection to the host servers, but Blizzard's implementation in <a href=\"/starcraft-ii-wings-of-liberty/61-20674/\">SC2</a> allows offline play of the single player campaign and AI versus modes with achievement functionality disabled.</p><p>Many digital distributors feature their own DRM. Steam requires users to connect to their servers at least once and enable offline mode before playing games offline. In Steam's offline mode, achievements are deactivated. Microsoft's Games For Windows Live has similar restrictions.</p>","deck":"The PC (Personal Computer) is a highly configurable and upgradable gaming platform that sports the widest variety of control methods, the largest library of games, and cutting edge graphics and sound capabilities.","company":null,"install_base":1250000000,"site_detail_url":"http://www.giantbomb.com/pc/60-94/","id":94,"api_detail_url":"http://api.giantbomb.com/platform/94/","abbreviation":"PC","online_support":true,"date_added":"2008-05-12 19:09:54","image":{"icon_url":"http://media.giantbomb.com/uploads/0/3/11889-alienware_icon.jpg","medium_url":"http://media.giantbomb.com/uploads/0/3/11889-alienware_small.jpg","tiny_url":"http://media.giantbomb.com/uploads/0/3/11889-alienware_tiny.jpg","small_url":"http://media.giantbomb.com/uploads/0/3/11889-alienware_small.jpg","thumb_url":"http://media.giantbomb.com/uploads/0/3/11889-alienware_thumb.jpg","screen_url":"http://media.giantbomb.com/uploads/0/3/11889-alienware_screen.jpg","super_url":"http://media.giantbomb.com/uploads/0/3/11889-alienware_super.jpg"},"release_date":"1981-08-12 00:00:00","name":"PC"}