{"original_price":0,"date_last_updated":"2012-09-25 09:48:06","description":"<h2>Overview</h2><p>The Xbox Live Marketplace allows <a href=\"/xbox-360/60-20/\">Xbox 360</a> users to download different kinds of media. Some of these mediums include Game Demos, Dashboard Themes, Gamerpics, Movie Rentals and Xbox Live Arcade games. Downloads can be purchased using Microsoft points which eliminates the need of different currency rates.</p><p>The Marketplace also allows players to download add-ons to their games; maps, extra episodes or levels, music tracks etc. The majority of the downloads are stored on the 360’s hard drive.</p><p>On November 19, 2008, Microsoft released the <a href=\"/new-xbox-experience/92-2426/\">New Xbox Experience</a>, which completely overhauled the Xbox 360 Dashboard, and added several new features.</p><p>On Nov 16, 2006, Slate.com published an article, <a href=\"http://The%20Death%20of%20the%20DiscWhy%20HD-DVD%20and%20Blu-ray%20are%20dead%20on%20arrival.\" rel=\"nofollow\">The Death of The Disc: Why Blu-Ray and HD-DVD are dead on arrival</a>, laughably predicting that Blu-Ray, HD-DVD, and other similar media are not the future, but rather online rental and purchased content are. Xbox Live was mentioned as a possible winner in the war between Blu-Ray and HD-DVD because of it's release of the video marketplace. With the high price of high definition discs, and the ease of watching a movie or tv show online rather than driving to the store, the Xbox Live Video Marketplace has great advantages over the old media, according to the article. This hasn't been the case in reality, it seems, as Blu-Ray remains a strong contender in the media field, with digital distribution still seeming more like a novelty, at least apart from the wildly successful <a href=\"/steam/92-718/\">Steam</a> service.</p><h2>Pricing</h2><p>The price of downloadable content is set by <a href=\"/microsoft-game-studios/65-340/\">Microsoft</a>. Some developers have wanted to release content for free, but Microsoft decided to charge for them. An example of this is the <a href=\"/gears-of-war/61-12231/\">Gears of War</a> map pack. However, the content was made free 4 months later, as the <a href=\"/halo-2/61-7110/\">Halo 2</a> and <a href=\"/halo-3/61-9993/\">3</a> map packs have been up to this point.</p><p>Microsoft Points can be purchased using a credit card or a code. Points come in different quantities and cannot be purchased individually. When you select an item for purchase and do not have the correct amount of points for it, the store will offer different amounts of points ranging from 500 points to 6000 points. It should be stated that you are never given the chance to purchase the exact amount of points for your purchase, usually resulting in you overspending and having left over points.</p><h2>Games</h2><p>The game portion of the Xbox Live Marketplace is split into 3 sections: Xbox Live Arcade, Xbox Live Indie Games and Games on Demand. It should also be noted that you can download game demos and trial versions of Arcade games. There is also a <a href=\"/game-room/61-30021/\">Game Room</a> application that lets you download and play old games through the application that must be downloaded through the marketplace.</p><h3>Xbox Live Arcade</h3><p>Xbox Live Arcade is where game publishers release games. This section of the store houses games from major publishing houses such as <a href=\"/activision/65-78/\">Activision</a>, <a href=\"/ea-games/65-6256/\">EA</a> and <a href=\"/thq/65-15/\">THQ</a>. These games are sometimes considered as important as disc based releases and are heavily advertised on the Spotlight section of the dashboard. Arcade is also where you can find game add ons and DLC. You can search through game content or view most downloaded and highest rated.</p><h3>Games on Demand</h3><p><a href=\"/games-on-demand/92-3251/\">Games on Demand</a> allows you to purchase a variety of games for both the Xbox 360 and the original Xbox that were originally sold on retail discs. Certain games have come out simultaneously at retail and on <a href=\"http://www.giantbomb.com/games-on-demand/92-3251/\">Games on Demand</a>, <a href=\"/crackdown-2/61-26790/\">Crackdown 2</a> for example, however in most cases there is a delay. These games are downloaded onto the hard drive.</p><h3>Xbox Live Indie Games</h3><p><a href=\"/xbox-live-indie-games/92-2533/\">Xbox Live Indie Games</a> are games made by the Xbox Live community. They are independent meaning that there is no publisher attached to them, the price of the games are cheaper, there is no rating and Microsoft does not insure the quality of the game.</p><h2>Xbox Live Video Marketplace</h2><p>The Xbox Live Video Marketplace allows users to purchase video content such as TV shows, and rent movies, some of which in high-definition, though the price is higher. With the addition of Netflix in the New Xbox experience, users can now get some movies and TV shows streamed through their queue on their Netflx account. Over 1 million Xbox live users have used Netflix since the NXE launch, which requires a separate Netflix account. Note that Netflix is not available in all countries.</p><p>There is also the Zune Marketplace where you can also rent or download movies that can then be transferred to your Zune music player.</p><h2>Miscellaneous</h2><p>The Xbox Live Marketplace also lets you download a variety of digital goods that aren't directly related to gaming. You can download gamer pictures and themes for your Xbox Live profile. You can also download and listen to music thanks to Last.fm and Zune.</p>","deck":"Xbox Live Marketplace is an online store for the Xbox 360, allowing users to purchase different types of content relating to both games and movies.","company":{"api_detail_url":"http://api.giantbomb.com/company/340/","id":340,"name":"Microsoft Studios"},"install_base":14000000,"site_detail_url":"http://www.giantbomb.com/xbox-live-marketplace/60-86/","id":86,"api_detail_url":"http://api.giantbomb.com/platform/86/","abbreviation":"XBLM","online_support":true,"date_added":"2008-04-22 10:52:23","image":{"icon_url":"http://media.giantbomb.com/uploads/0/8271/1145530-xblmlogo_icon.png","medium_url":"http://media.giantbomb.com/uploads/0/8271/1145530-xblmlogo_small.png","tiny_url":"http://media.giantbomb.com/uploads/0/8271/1145530-xblmlogo_tiny.png","small_url":"http://media.giantbomb.com/uploads/0/8271/1145530-xblmlogo_small.png","thumb_url":"http://media.giantbomb.com/uploads/0/8271/1145530-xblmlogo_thumb.png","screen_url":"http://media.giantbomb.com/uploads/0/8271/1145530-xblmlogo_screen.png","super_url":"http://media.giantbomb.com/uploads/0/8271/1145530-xblmlogo_super.png"},"release_date":"2005-11-02 00:00:00","name":"Xbox Live Marketplace"}