{"original_price":1000,"date_last_updated":"2012-09-18 13:41:14","description":"<h2>Overview<br /></h2><h3><br /></h3><h3><div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"227982\"><div class=\"wiki-img-left\"><div class=\"wiki-img-screen\"><a href=\"http://media.giantbomb.com/uploads/0/9559/227982-atarist2_super.jpg\" title=\"Atari 1040STFM with Atari Mouse and a TAC-2 joystick.\"><img id=\"227982\" src=\"http://media.giantbomb.com/uploads/0/9559/227982-atarist2_screen.jpg\" alt=\"Atari 1040STFM with Atari Mouse and a TAC-2 joystick.\" /></a><div class=\"item-caption\">Atari 1040STFM with Atari Mouse and a TAC-2 joystick.</div></div></div></div></h3>The Atari ST line of computers were launched in 1985 with the Atari 520ST. It included an 8mhz Motorola 68000 CPU and 512kb RAM. Later models, called STFM, had a built-in floppy disk drive, RF-modulator and had the power supply built into the case. \"ST\" means Sixteen-Thirtytwo, because of the CPU's 16bit data bus and 32bit internals.<br /><br />It became popular in businesses because of the excellent office applications, in the homes of people because of the great games and amongst musicians because of its built-in MIDI ports and software like Cubase. The Atari ST was in direct competition with  Commodore's <a href=\"http://www.giantbomb.com/amiga/60-1/\">               Amiga</a> and   Apple's <a href=\"http://www.giantbomb.com/mac/60-17/\">               Macintosh</a> line of computers, and to some extent the <a href=\"http://www.giantbomb.com/amstrad-cpc/60-11/\">               Amstrad CPC</a> line of computers.<br /><br />The developement was lead by  Jack Tremiel, who had recently left   <a href=\"/commodore/65-2000/\">           Commodore</a> (Tremiel actually started the Commodore company and developed, among other computers, the <a href=\"http://www.giantbomb.com/commodore-64/60-14/\">               C64</a>.) to buy the rights to the Atari name. The Atari ST was intended to be an affordable computer with fast performance. But because it was supposed to be affordable, it is not as powerful in the audio and graphics department as the Commodore Amiga. Focus was instead put on including a fast CPU and lots of RAM.<br /><br /><h2>Hardware</h2><h3><br /></h3><h3>Specifications</h3>These are the basic specifications for the Atari 520ST:<br /><ul class=\"plain-list\"><li><b>CPU:</b> Motorola 68000 16/32bit @ 8mhz. 16 bit data bus/32 bit internal/24-bit address bus.</li> <li><b>RAM:</b> 512kb (1mb for the 1040ST models)</li> <li><b>Soundchip:</b> Yamaha YM2149F 3-voice squarewave plus 1-voice white noise mono PSG(plus 2 channels on the STE models).</li> <li><b>Diskdrive:</b> Single-sided 3½\" floppy disk drive. 360kb capacity(1040ST had double-sided drives which had a capacity of 720kb).</li> <li><b>Display:</b> 60&nbsp;Hz NTSC, 50&nbsp;Hz PAL, 71.2&nbsp;Hz monochrome:</li> </ul>  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Low Resolution - 320×200 (16 color), palette of 512 colors<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Medium resolution - 640×200 (4 color), palette of 512 colors<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; High resolution - 640×400 (mono), monochrome<ul class=\"plain-list\"> <li><b>Ports:</b> TV out (on ST-M and ST-FM models, NTSC or PAL standard RF modulated), MIDI in/out (with 'out-thru'), RS-232 serial, Centronics parallel (printer), monitor (RGB or Composite Video colour and mono, 13-pin DIN), extra disk drive port (15-pin DIN), DMA port (ACSI port, Atari Computer System Interface) for hard disks and Atari Laser Printer (sharing RAM with computer system), joystick and mouse ports (9-pin MSX standard).</li> <li><b>Operating System:</b> TOS (<b>T</b>he <b>O</b>perating <b>S</b>ystem) with the GEM user interface.</li> </ul> <br /><h3>Models</h3>There are a couple of different models of the Atari ST. They are:<br /><ul class=\"plain-list\"><li><b>Atari 130ST</b> - Never released. Was supposed to come with only 128kb ram. But the operating system alone took up almost all that amount, so they canceled it.</li> </ul> <ul class=\"plain-list\"><li><b>Atari 260ST</b> - Only released in Europe. It was first only a prototype just like the 130ST but was eventually released in Europe. It is identical to the 520ST and was released to differentiate it from the new 520ST plus.</li> <li><b>Atari 520ST</b> - The original model described in Specifications.</li> <li><b>Atari 520STM</b> - Not very common. Model with only RF modulation built in, without floppy drive.</li> <li><b>Atari 520STFM</b> - Built-in floppy drive, RF modulator and power supply.</li> <li><b>Atari 520ST</b> <b>plus </b>  - 1mb RAM but no floppy drive.</li> <li><b>Atari 1040STF</b> - A 520ST with built in double sided DD disk drive and 1mb ram. But without RF modulator.</li> <li><b>Atari 1040STFM</b> - A 520ST with built in double sided DD disk drive, 1mb ram and RF modulator.</li> <li><b>Mega ST</b> - Redesigned motherboard. Comes with 2 or 4mb of RAM. Includes a real-time clock and an internal connector for expansion. Most models also includes the BLiTTER graphics chip. </li> <li><b>520STE and 1040STE</b> - Same as 520STFM/1040STFM but includes the BLiTTER graphics chip and has enhanced sound and color palettes. The sound chip has 2 extra channels that can be used for sampled sounds. The color palette is extended to 4096 colors. Unfortunately the STE specific features were rarely used in commercial software.</li> <li><b>Mega STE</b> - Same hardware as the 1040STE has, but with a 16mhz CPU.</li> <li><b>STacy</b> - A portable version of the ST.</li> <li><b>ST BOOK </b>- Portable version of the STE. It was more portable than the STacy but sacrifice many features in order to achieve that.</li> </ul>&nbsp; <br />Prototypes/Vaporware (Never Officially Released)  <ul class=\"plain-list\"><li>1040 STE plus&nbsp;  (STE 2080) – Similar to the 1040STE&nbsp; but with a&nbsp; additional, intern AMD 80286 CPU and a 40MB HD (2,5\")<br /></li></ul>&nbsp;<h2>Operating System</h2><br /><h3>Details</h3>The operating system in the Atari ST is called TOS which means simply \"The Operating System\". It combines the GEM GUI and the underlying GEMDOS, a DOS like operating system, both by Digital Research. TOS is stored in onboard ROM chips, though early versions of the Atari ST came with TOS on floppy disks. Because it is stored on ROM chips it boots up instantly. Some people jokingly says that TOS means \"Tremiel Operating System\", since Jack Tremiel was the one leading the developement of the Atari ST.<br /><br />TOS is composed of the following parts:<br /><ul class=\"plain-list\"> <li><b>GEMDOS</b> - GEM Disk Operating System (A DOS-like operating system Digital Research had experimented with a little bit before Atari decided to use GEM.)</li> <li><b>GEM</b> - Graphical Environment Manager (A graphical environment. GEM itself consists of AES, VDI and GEM Desktop.)</li> </ul> <ul class=\"plain-list\"><li> <b>AES</b> - Application Environment Service (Provides the window system, window manager and other GUI elements.)<br /></li> </ul> <ul class=\"plain-list\"> <li><b>VDI</b> - Virtual Device Interface (The core graphics system of the GEM engine.)</li> <li><b>GEM</b> Desktop (An application using AES to provide a file manager and application launcher.)</li> <li><b>BIOS</b> - Basic Input/Output System</li> <li><b>XBIOS</b> - Extended BIOS</li> <li><b>Line-A</b> (Low-level high-speed graphics calls.)</li> </ul> <ul class=\"plain-list\"><li><b>GDOS</b> - Graphics Device Operation System (Sends commands from VDI to the proper device driver for rendering graphics.)</li> <li><b>AHDI</b> - Atari Hard Disk Interface (Driver for Hard Drive. Has to be loaded seperately.)</li> </ul> <br /><h3>Desktop</h3><div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"779987\"><div class=\"wiki-img-right\"><div class=\"wiki-img-screen\"><a href=\"http://media.giantbomb.com/uploads/0/9559/779987-220078_16_atarigem_super.gif\" title=\"The GEM desktop in low resolution (320x200)\"><img id=\"779987\" src=\"http://media.giantbomb.com/uploads/0/9559/779987-220078_16_atarigem_screen.gif\" alt=\"The GEM desktop in low resolution (320x200)\" /></a><div class=\"item-caption\">The GEM desktop in low resolution (320x200)</div></div></div></div>The  desktop looks like most other desktops in that it uses icons to represent devices and files, and has windows and dialog boxes. The standard desktop has a trashcan and two floppy disk icons, even if you only have one floppy drive. On the top part is a context sensitive panel. It changes it's contents depending on the application (much like on a Macintosh), though applications are not required to even use the panel in which case it is removed.<br /><br />TOS can execute a variety of different filetypes. They can be identified by their extensions:<br /><ul class=\"plain-list\"><li><b>*.ACC</b> - Desktop accessory. Loaded automatically when the application loads.</li> <li><b>*.APP</b> - Application. Was not used very often.</li> <li><b>*.PRG</b> - Executable program. Often GEM programs.</li> <li><b>*.TOS</b> - Programs that only uses GEMDOS and not the GEM system to function. (i.e. it doesn't use GEM to draw windows.)</li> <li><b>*.TTP</b> - TOS Takes Parameters. Opens up a dialog box in which you can add arguments for the program.</li> </ul> <br />It is possible to autoboot TOS programs (but not GEM programs) on startup by placing the program inside a folder named \"AUTO\" on a floppy disk. If the floppy is inserted into the drive when the computer boots, it will bypass the GEM desktop and boot the TOS program instead. This is used by many demos and most games.<br /><br /><h3>Similarity to Macintosh UI</h3>The look and feel of GEM for Atari ST is very much like the one in the original Macintosh. Apple sued Digital Research over this and Digital Reasearch had to redesign their GEM window manager for other architectures. But since it was mostly Atari who developed the Motorola 68000 version, they were given the rights to further develop the 68k version without Digital Research's consent. Because of this, Atari was not affected by the Apple-Digital Research lawsuit and were allowed to have a more Mac-like look and feel.<br /><br /><h2>Demo scene</h2><div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"699568\"><div class=\"wiki-img-right\"><div class=\"wiki-img-screen\"><a href=\"http://media.giantbomb.com/uploads/0/9559/699568-virtual_escape_super.gif\" title='\"Virtual Escape\" demo by Equinox'><img id=\"699568\" src=\"http://media.giantbomb.com/uploads/0/9559/699568-virtual_escape_screen.gif\" alt='\"Virtual Escape\" demo by Equinox' /></a><div class=\"item-caption\">\"Virtual Escape\" demo by Equinox</div></div></div></div><br />As with most other early computers, there is a scene of people still active on the Atari ST platform. They use the ST to create productions called \"demos\", which is a program demonstrating the demo group's programming, graphics making and music composing abilities on limited hardware.<br />The groups came up with new programming techniques to push the limits of the computer to do things that people would've only dreamed about doing years ago. Some of these techniques were later used in games for the Atari ST. For example the technique to display graphics in the borders of the screen.<br /><br /><div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"699564\"><div class=\"wiki-img-left\"><div class=\"wiki-img-screen\"><a href=\"http://media.giantbomb.com/uploads/0/9559/699564-left_border_super.jpg\" title='\"Death of the left border\" screen by TNT Crew.'><img id=\"699564\" src=\"http://media.giantbomb.com/uploads/0/9559/699564-left_border_screen.jpg\" alt='\"Death of the left border\" screen by TNT Crew.' /></a><div class=\"item-caption\">\"Death of the left border\" screen by TNT Crew.</div></div></div></div>Since the Atari ST was not powerful enough to display graphics in fullscreen, Atari put borders on the sides of the screen. But after many years of experimenting, the people in the demo scene removed those borders one by one, starting with the upper border. The last border to be removed was the left one that was thought to be impossible to remove. But once again a demo group succeeded with removing the border and were finally able to display graphics in fullscreen. Of course, this had an impact on performance, so you couldn't do everything you could do otherwise.<br /><br />The people in the demo scene on the Atari ST were also very involved in the game side of things. Some demo groups even started their own game companies and made some of the best games for the ST with the techniques they had invented, like the mentioned ability to put graphics where the borders should have been.<br />One example of this is in the game <a href=\"/lethal-xcess-wings-of-death-ii/61-11117/\">               Lethal Xcess</a>. <a href=\"/thalion-software/65-1964/\">               Thalion Software</a> who made the game, put the HUD in the upper border of the screen so that the playing field wouldn't be smaller. Thalion Software was comprised of people from various demo groups and made some of the best games for the Atari ST, like <a href=\"/amberstar/61-10464/\">               Amberstar</a> and <a href=\"/enchanted-land/61-23957/\">         Enchanted Land</a>. Demo groups still release games, though not commercially like Thalion did.","deck":"Atari's 16-bit computer line was one of the most popular computers in the mid-80's to early 90's.","company":{"api_detail_url":"http://api.giantbomb.com/company/548/","id":548,"name":"Atari SA"},"install_base":4000000,"site_detail_url":"http://www.giantbomb.com/atari-st/60-13/","id":13,"api_detail_url":"http://api.giantbomb.com/platform/13/","abbreviation":"AST","online_support":true,"date_added":"2008-04-01 01:32:49","image":{"icon_url":"http://media.giantbomb.com/uploads/0/5258/220119-atari_1040stf_icon.jpg","medium_url":"http://media.giantbomb.com/uploads/0/5258/220119-atari_1040stf_small.jpg","tiny_url":"http://media.giantbomb.com/uploads/0/5258/220119-atari_1040stf_tiny.jpg","small_url":"http://media.giantbomb.com/uploads/0/5258/220119-atari_1040stf_small.jpg","thumb_url":"http://media.giantbomb.com/uploads/0/5258/220119-atari_1040stf_thumb.jpg","screen_url":"http://media.giantbomb.com/uploads/0/5258/220119-atari_1040stf_screen.jpg","super_url":"http://media.giantbomb.com/uploads/0/5258/220119-atari_1040stf_super.jpg"},"release_date":"1985-04-13 00:00:00","name":"Atari ST"}