{"original_price":250,"date_last_updated":"2012-09-12 12:41:25","description":"<p>The Amiga CD32 was released in September 1993, and it was the first 32-bit cd-rom console to be released in <a href=\"http://www.giantbomb.com/europe/95-289/\"> Europe</a> and <a href=\"http://www.giantbomb.com/canada/95-244/\"> Canada</a>. Although the plans for releasing it in the US never happened. The Amiga had similar specs as the Amiga 1200 and had the possibility to add mouse, keyboard, etc. It also had a covered expansion slot intended to accomodate a VideoCD playback module. This was eventually utilized by third parties to create other expansion modules that allowed the CD32 to act as a fully capable Amiga computer, first by adding missing ports and later providing for the ability to add a hard drive, memory and upgrade the CPU. The console lasted only for approximately seven months due to component supply issues and therefore it didn't have the sales impact to keep the console alive.</p><p>However, the console was kept alive in other forms: In the late 1990s to early 2000s, slot machine manufacturer StarGames utilized a stripped down CD32 motherboard in many of their slot machines and in the mid to late 1990s, some vehicle registries in Canada utilized CD32 systems for interactive multimedia testing for drivers license applications.</p><p>The CD32 also had a unique piece of hardware called the Akiko chip that was added specifically to enable the console to more easily support \"Doom clones\". It provided acceleration for converting the PC's chunky pixel format (which was better suited to the routines that generated the graphics in Doom-like games) to the Amiga's planar pixel format.</p><h2>Technical Specifications</h2><p><b>CPU:</b> Motorola 68EC020 @ 14.3 MHz</p> <b>Memory:</b> 2MB Amiga Chip RAM <b>Video:</b> Advanced Graphics Architecture <b>Audio:</b> Paula RCA stereo","deck":"The Amiga CD32 was Commodore's attempt at a gaming console and what turned out to be their swan song. The majority of its library were upgraded Amiga games.","company":{"api_detail_url":"http://api.giantbomb.com/company/2000/","id":2000,"name":"Commodore"},"install_base":100000,"site_detail_url":"http://www.giantbomb.com/amiga-cd32/60-39/","id":39,"api_detail_url":"http://api.giantbomb.com/platform/39/","abbreviation":"CD32","online_support":false,"date_added":"2008-04-01 01:33:07","image":{"icon_url":"http://media.giantbomb.com/uploads/0/26/10070-cd32_icon.jpg","medium_url":"http://media.giantbomb.com/uploads/0/26/10070-cd32_small.jpg","tiny_url":"http://media.giantbomb.com/uploads/0/26/10070-cd32_tiny.jpg","small_url":"http://media.giantbomb.com/uploads/0/26/10070-cd32_small.jpg","thumb_url":"http://media.giantbomb.com/uploads/0/26/10070-cd32_thumb.jpg","screen_url":"http://media.giantbomb.com/uploads/0/26/10070-cd32_screen.jpg","super_url":"http://media.giantbomb.com/uploads/0/26/10070-cd32_super.jpg"},"release_date":"1993-09-23 00:00:00","name":"Amiga CD32"}