{"original_price":199,"date_last_updated":"2012-08-30 05:58:52","description":"<p>The Sega Dreamcast is a 128-bit console. It's the successor of the <a href=\"http://www.giantbomb.com/saturn/60-42/\">Sega Saturn</a>. It has an NEC processor and had a new disc format in the shape of GD-Roms. These discs held up to 1.2 gigabytes of data, considerably more than a Compact Disc. The Dreamcast was Sega's last entry to the hardware market as their support for the console ended as early as 2001, less than two years after the US launch, and is largely attributed to the arrival of the hotly anticipated and wildly successful <a href=\"http://www.giantbomb.com/playstation-2/93-1917/\">PS2</a>. Despite its tragically short life, the Dreamcast is held in high regard by nostalgic fans for the raft of superb exclusive titles released in that time.</p><h2>History</h2><p>The Dreamcast originated in 1995 at the first <a href=\"http://www.giantbomb.com/e3-1995/92-3482/\">E3</a>. Since Sony's arrival in the game hardware market, their rivals began playing a major defensive against the juggernaut that was the Playstation. The growing popularity of the <a href=\"http://www.giantbomb.com/playstation/60-22/\">PlayStation</a> brought a lot of support from Japan, and the <a href=\"http://www.giantbomb.com/saturn/60-42/\">Saturn</a> began to slip behind in sales. Due to this, Sega began to fear that Sony would gain momentous support in the US and would leave them lagging seriously behind. In order to keep up, Sega made a momentous mistake in the battle for supremacy.</p><p>At E3, Sega announced that the Saturn was released the same day as the press conference in the US. Their strategy was to release the console early so they could get a strong base before Sony released their console in September. This plan backfired due to the anger of developers and retailers. Many developers were mad because they wanted their games to be released with the Saturn's launch, and many popular retailers (like Wal-Mart and KB Toys) were so angry for lack of information that most considered not selling any more Sega consoles in their stores. The Saturn sold 80,000 units before the PlayStation launched, but the PlayStation sold over 100,000 units during its first week, making their strategy a failure. Even though the Saturn was managing to keep up in Japan, it completely bombed in the US.</p><p>Things did not get better for Sega over the next 2 years. At <a href=\"http://www.giantbomb.com/e3-1997/92-3419/\">E3 1997</a>, Bernie Stolar announced \"The Saturn is not our future\". This announcement, for all intensive purposes, killed the Saturn, and made people even more angry because of this. Thus, Sega began work on a new console. They wanted to create a truly next-generation console, with features ahead of its time and far superior hardware to that of the popular PlayStation. Unfortunately, the desire to get the Dreamcast moving quickly and have a fast production process eventually lead to its demise, because despite the technology behind it being great for 1998, it seemed at a halfway point between generations; superior to the <a href=\"http://www.giantbomb.com/playstation/60-22/\">Playstation</a> and <a href=\"http://www.giantbomb.com/nintendo-64/60-43/\">N64</a>, but nowhere near the power of <a href=\"http://www.giantbomb.com/playstation-2/60-19/\">PS2,</a> <a href=\"http://www.giantbomb.com/xbox/60-32/\">Xbox</a> or <a href=\"http://www.giantbomb.com/gamecube/60-23/\">Gamecube</a>.</p><p>There were initially two competing models of the Dreamcast. Tatsuo Yamamoto of IBM Austin was to lead a team of eleven developing the \"Black Belt\" version of the console, which was to have a Hitachi SH4 processor and a 3dfx Voodoo 2 graphics chip. At various stages in development, the US model was nicknamed \"Shark\" and \"Dural\". Meanwhile, the Japanese hardware team led by Hideki Sato settled on the same processor, but a PowerVR2 graphics chip created by VideoLogic and manufactured by NEC. This \"White Belt\" version was nicknamed \"Guppy\" and \"Katana\" before the name Dreamcast was decided. The Japanese model was chosen in Summer 1997 because 3dfx had unwittingly leaked its entire contract with Sega in April, who had been keeping the project a secret. 3dfx filed a lawsuit against Sega for breach of contract, but this was settled out of court.</p><h2>Success</h2><p>On November 27, 1998, The <a href=\"http://www.giantbomb.com/sega/65-62/\">Sega</a> Dreamcast launched in Japan. It was sold out everywhere during its first few weeks of launch. It was selling so well that Sega couldn't keep up with the demand. According to reports, NEC was unable to create enough processors for the Dreamcast so Sega was unable to make as many consoles as they would liked.</p><p>Seeing how successful the Dreamcast had done in Japan, Sega began work on an American release. Sega of America was hard at work on getting buzz for the American Dreamcast launch. Sega even created their own holiday called \"Dreamcast Day\", set for September 9, 1999, burning 9-9-99 into everyone's memory as the day they'd get to experience the next generation of gaming for the first time. The subsequent European release date was on September 14, 1999.</p><h2><b>Downfall</b></h2><p>At <a href=\"http://www.giantbomb.com/e3-1999/92-3421/\">E3 1999</a>, Sega was showing off all their Dreamcast games to the market. However, Sega's biggest threat, Sony, had something up their sleeves. At E3 1999, Sony unveiled the Playstation 2. At E3, Sony showed the complete layout and design of the Playstation 2. They showcased all the tech of the Playstation 2, which was vastly superior to the Dreamcast. Due to this, consumers decided to skip the Dreamcast and wait for the PS2 to come out. These turn of events began to shake the foundation of the Dreamcast.</p><p>Even though the PS2 was controlling much of the hype, the Dreamcast had a successful launch, selling 300,000 preorders, which was more than the original Playstation. The Dreamcast had a vast variety of launch games like <a href=\"http://www.giantbomb.com/sonic-adventure/61-7852/\">Sonic Adventure</a>, <a href=\"http://www.giantbomb.com/soul-calibur/61-12411/\">Soul Calibur</a>, and <a href=\"http://www.giantbomb.com/nfl-2k2/61-14001/\">NFL 2K</a>. For a while it seemed that Sega would continue to be a competitor in the gaming market.</p><p>Then in March of 2000, Sony released the PS2 worldwide, selling better than anyone could've possibly imagined. One major plus that the PS2 had was a DVD player. Back then, DVDs weren't popular because they were too expensive for the average consumer. Thanks to the PS2 doubling as a DVD player and was less expensive than a stand alone DVD player, the PS2 sold very well. There were instances reported where people didn't even buy the console for games (the launch didn't have as many good games as the Dreamcast), and solely used the console for the DVD player. To show support of this, the best selling item for the PS2 in Japan was the Matrix DVD. This made the PS2 look more like an entertainment device than an actual console. Since the Dreamcast couldn't play DVDs, people overlooked the system and Dreamcast consoles were beginning to sit on shelves</p><p>One other problem the Dreamcast had was copious amounts of pirating. Because of the Dreamcast's poor copy protection, it was easy for people to copy games onto regular CD-ROM's and have the console recognize them as actual games. Because of this, game sales were decreasing as well as console sales, sealing the fate of Sega.</p><p>Sega later got some relief where Sony was only able to sell half their inventory of PS2s. Since the PS2's inventory was so weak, Sega decided to take action and try to move mass quantities of units. Unfortunately, this plan backfired as well.</p><p>In March 2001, <a href=\"http://www.giantbomb.com/peter-moore/72-14816/\">Peter Moore</a> (the head of SoA at the time) announced that the Dreamcast hadn't been meeting expectations. The sales had been sadly lagging and their warehouses were filled with unsold Dreamcasts and games. Sega decided to sell off the remaining number of consoles at a vastly discounted price and cut their losses. This announcement came with the final nail in the Dreamcast coffin, they announced the Dreamcast was no longer in production and that Sega was switching from a hardware manufacturer to a software manufacturer. The entire gaming community was astonished and saddened by the final announcement about the Dreamcast.</p><p>Even though the Sega Dreamcast failed and only sold 10.6 million units during its lifetime, the Dreamcast will always be remembered by fans as being one of the greatest systems of all time.</p><h2>Hardware</h2><p>Back in 1998, the Dreamcast was an advanced console for its time, surpassing the capabilities of all other consoles available at the time of its release and being the first 128-bit console to be released. The console has 4 controller slots and a 56k modem built into the console for Seganet. A broadband adapter for a faster connection was also available for $50, allowing the Dreamcast to be connected to an ethernet network.</p><div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"1680286\"><div class=\"wiki-img-right\"><div class=\"wiki-img-thumb\"><a href=\"http://media.giantbomb.com/uploads/12/120503/1680286-dc_acc_broadband_super.jpg\" title=\"Broadband Adapter for the Sega Dreamcast\"><img id=\"1680286\" src=\"http://media.giantbomb.com/uploads/12/120503/1680286-dc_acc_broadband_thumb.jpg\" alt=\"Broadband Adapter for the Sega Dreamcast\" /></a><div class=\"item-caption\">Broadband Adapter for the Sega Dreamcast</div></div></div></div><p>The Dreamcast supported multiple television connections. It shipped with standard A/V cables, and S-video, component RGB cables, and an RF connector were available separately. In addition, Sega released a VGA adapter that allowed the Dreamcast to be played on a computer monitor at a resolution of 640x480, four times the standard resolution. Certain games could not be played through the VGA adapter, however.</p><p>This console runs GD-Roms which could hold up to 1.2 GBs of space. It also uses VMU memory cards that could hold up to 128 KB of space. These VMUs connect to your Dreamcast controller and have an LCD screen that shows pictures relating to the game that you're playing. For some games, minigames relating to the games are saved onto the VMU which could be played without the use of the Dreamcast, making it a handheld console as well.</p><h2>Accessories</h2><div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"1680273\"><div class=\"wiki-img-right\"><div class=\"wiki-img-thumb\"><a href=\"http://media.giantbomb.com/uploads/12/120503/1680273-samba_super.jpg\" title=\"Samba de Amigo Maracas\"><img id=\"1680273\" src=\"http://media.giantbomb.com/uploads/12/120503/1680273-samba_thumb.jpg\" alt=\"Samba de Amigo Maracas\" /></a><div class=\"item-caption\">Samba de Amigo Maracas</div></div></div></div><p>The Dreamcast had a lot of accessories. Here's a list of them:</p><ul><li>VMU Memory Cards</li><li>Rumble Packs</li><li>VGA Adapter (to play the Dreamcast on your computer screen in 480p)</li><li>Mouse and keyboard</li><li>Fishing rods (for fishing games)</li><li>Microphones (for games like <a href=\"http://www.giantbomb.com/seaman/61-1442/\">Seaman</a>)</li><li>Lightguns</li><li>Arcade sticks (both single stick controllers for fighting and arcade-style games and a twin stick controller for <a href=\"/virtual-on-oratorio-tangram/61-4819/\">Virtual On: Oratorio Tangram</a>)</li><li>Camera</li><li>Maracas (for <a href=\"/samba-de-amigo/61-16519/\">Samba de Amigo</a>)</li><li>Train controls (for a Japanese train simulator)</li></ul><p>There was supposed to be a MP3 player, DVD player, and Zip drive, but they were canceled due to the Dreamcast dying.</p><h2>Games</h2><p>The Dreamcast was well known for its vast assortment of games. At launch, it had a variety of games that everyone could enjoy. For the <a href=\"/sonic-the-hedgehog/62-383/\">Sonic</a> fans, there was <a href=\"http://www.giantbomb.com/sonic-adventure/61-7852/\">Sonic Adventure</a>, which was Sega's first successful attempt into bring Sonic's gameplay to 3D. For the fighting fanatics, there was <a href=\"http://www.giantbomb.com/soul-calibur/61-12411/\">Soul Calibur</a>, which was a 3D fighter (similar to <a href=\"http://www.giantbomb.com/tekken/61-10081/\">Tekken</a>) that uses swords as their main weapons. This game became a big success, scoring 10's from many game reviewers (IGN and Gamespot). For sports fans, there was <a href=\"http://www.giantbomb.com/nfl-2k/61-4659/\">NFL 2K</a>, the football title. When EA announced that they would not develop for the Dreamcast due to the failure of the Saturn, this caused Sega to make their own sports titles. NFL 2K was the Dreamcast's answer to <a href=\"http://www.giantbomb.com/madden-nfl/62-491/\">Madden</a>. Later installments would include online play.</p><p>Due to a lack of third party support, Sega focused on their first party titles. Sega would continue to release their 2K sports line and would add online play to the 2K1 installments. Sega ported many of their popular arcade games over to the Dreamcast like <a href=\"http://www.giantbomb.com/crazy-taxi/61-9112/\">Crazy Taxi</a> and <a href=\"http://www.giantbomb.com/the-house-of-the-dead/61-508/\">House of the Dead</a>. Along with their arcade games came their original, innovative titles for the platform. One of them was <a href=\"http://www.giantbomb.com/samba-de-amigo/61-16519/\">Samba de Amigo</a>, a rhythm game where you use a controller shaped like Maracas to move your arms around to meet a certain position. <a href=\"http://www.giantbomb.com/space-channel-5/61-7466/\">Space Channel 5</a> was another rhythm game where you go around space killing aliens while dancing to pop music. <a href=\"http://www.giantbomb.com/chuchu-rocket/61-13715/\">Chu Chu Rocket</a> was a puzzle game where you lead a group of mice away from cats.</p><p>Although the Dreamcast didn't have a high amount of third party support, the people who did develop for the system released top-notched games. The biggest company to do this was <a href=\"http://www.giantbomb.com/capcom/65-367/\">Capcom</a>. Capcom was well known for its fighters released for the Dreamcast. They would make definitive home ports of their popular arcade fighters ( <a href=\"http://www.giantbomb.com/marvel-vs-capcom/62-513/\">Marvel vs. Capcom</a> <a href=\"http://www.giantbomb.com/marvel-vs-capcom-clash-of-super-heroes/61-8605/\">1</a> and <a href=\"http://www.giantbomb.com/marvel-vs-capcom-2-new-age-of-heroes/61-2612/\">2</a>) along with releasing brand new fighters exclusive for the console ( <a href=\"http://www.giantbomb.com/power-stone/61-20100/\">Power Stone</a>).</p><p>The biggest game released for the Dreamcast was <a href=\"http://www.giantbomb.com/shenmue/61-7812/\">Shenmue</a>. It was in development since the Sega Saturn and was made by <a href=\"http://www.giantbomb.com/yu-suzuki/72-15149/\">Yu Suzuki</a>. It is considered to be the most expensive game of all time and the most graphically superior game at the time. The game added some new elements like free-roaming gameplay and time-based gameplay. It was hyped to be the killer app for the Dreamcast that would ruin the PS2. When the game was first released in 2001, it came with mixed reviews. Some game reviewers loved the game, giving it 9's and 10's. They consider it a gaming achievement with its deep story and innovative gameplay. Others completely hated the game, giving it low scores. They complained about the slow gameplay and cheesy voice acting. Due to the mixed reviews, the game sold poorly. A <a href=\"http://www.giantbomb.com/shenmue-ii/61-1187/\">sequel</a> was released in Japan for the Dreamcast in 2001, but it never came to the US. In 2002, Sega made a deal with Microsoft to release the sequel for the Xbox in 2002.</p><h2>Online</h2><p>The Dreamcast was the first console to have full online play from their first party. SegaNet, starting in September 2000, was an online gaming community where people can play each other. You can play a game of football with each other with <a href=\"/nfl-2k1/61-805/\">NFL 2K1</a>. You could play a round of Deathmatch in <a href=\"http://www.giantbomb.com/unreal-tournament/61-17448/\">Unreal Tournament.</a> Although the launch of SegaNet was successful, the sales of Dreamcasts dropped. By July 2001, the service ended, and everyone was forced to switch to Earthlink. This was bad because there was a deal going on that if you sign up for two years, you'll get a $180 rebate. Since it didn't last two years (only 10 months) the deal was null and void.</p><p>Even with the service ended, many games lived on, using a different type of internet connection (Earthlink was the most popular). However these services didn't last for long. The Dreamcast version of <a href=\"http://www.giantbomb.com/phantasy-star-online/61-20252/\">Phantasy Star Online</a> discontinued in 2003, ending SegaNet fully.</p><h2>Legacy</h2><div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"1680287\"><div class=\"wiki-img-right\"><div class=\"wiki-img-thumb\"><a href=\"http://media.giantbomb.com/uploads/12/120503/1680287-dreamcast_logo_super.jpg\" title=\"The Dreamcast\"><img id=\"1680287\" src=\"http://media.giantbomb.com/uploads/12/120503/1680287-dreamcast_logo_thumb.jpg\" alt=\"The Dreamcast\" /></a><div class=\"item-caption\">The Dreamcast</div></div></div></div><p>Even though the Dreamcast is dead, the legacy of the console lives on. Due to the Dreamcast failing, Sega had to drop from the console race and stick to making games for other consoles. Most of those games, early on, were ports of Dreamcast games. The two Sonic Adventure games were ported over to the Nintendo Gamecube, which was shocking at the time because everyone knew that Nintendo and Sega were sworn enemies, and now they were partners. The Gamecube even got Phantasy Star Online, being one of the only Gamecube games to support online play.</p><p>Sony, the people who made Sega go bankrupt, got <a href=\"http://www.giantbomb.com/virtua-fighter-4/61-4313/\">Virtua Fighter 4</a> for the PS2. Peter Moore, SoA's president at the time, left Sega to join Microsoft and help with their new console, the Xbox. Due to him being a part of Sega, he got Sega to make games on the Xbox. They got some exclusive games like <a href=\"http://www.giantbomb.com/jsrf-jet-set-radio-future/61-12117/\">Jet Set Radio Future</a>, <a href=\"http://www.giantbomb.com/panzer-dragoon-orta/61-4535/\">Panzer Dragoon Orta</a>, and <a href=\"http://www.giantbomb.com/shenmue-ii/61-1187/\">Shenmue II</a>. Sega's still making games for the new consoles, the WII, 360, and PS3.</p><h2>Launch Titles</h2><p>The following are Dreamcast's U.S. launch titles released on September 9, 1999.</p><div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"824176\"><div class=\"wiki-img-right\"><div class=\"wiki-img-thumb\"><a href=\"http://media.giantbomb.com/uploads/1/14030/824176-soulcalibur_cover_super.jpg\" title=\"Soul Calibur, Dreamcast Launch Title\"><img id=\"824176\" src=\"http://media.giantbomb.com/uploads/1/14030/824176-soulcalibur_cover_thumb.jpg\" alt=\"Soul Calibur, Dreamcast Launch Title\" /></a><div class=\"item-caption\">Soul Calibur, Dreamcast Launch Title</div></div></div></div><ul><li><a href=\"http://www.giantbomb.com/blue-stinger/61-21183/\">Blue Stinger</a></li><li><a href=\"http://www.giantbomb.com/millennium-soldier-expendable/61-16472/\">Millennium Soldier: Expendable</a></li><li><a href=\"http://www.giantbomb.com/cart-flag-to-flag/61-6225/\">CART: Flag to Flag</a></li><li><a href=\"http://www.giantbomb.com/the-house-of-the-dead-2/61-422/\">The House of the Dead 2</a></li><li><a href=\"http://www.giantbomb.com/hydro-thunder/61-13241/\">Hydro Thunder</a></li><li><a href=\"http://www.giantbomb.com/monaco-grand-prix/61-27620/\">Monaco Grand Prix</a></li><li><a href=\"http://www.giantbomb.com/mortal-kombat-gold/61-4652/\">Mortal Kombat Gold</a></li><li><a href=\"http://www.giantbomb.com/nfl-2k/61-4659/\">NFL 2K</a></li><li><a href=\"http://www.giantbomb.com/nfl-blitz-2000/61-2849/\">NFL Blitz 2000</a></li><li><a href=\"http://www.giantbomb.com/pen-pen-tri-icelon/61-16846/\">Pen Pen Tri-Icelon</a></li><li><a href=\"http://www.giantbomb.com/power-stone/61-20100/\">Power Stone</a></li><li><a href=\"http://www.giantbomb.com/ready-2-rumble-boxing/61-19836/\">Ready 2 Rumble Boxing</a></li><li><a href=\"http://www.giantbomb.com/sonic-adventure/61-7852/\">Sonic Adventure</a></li><li><a href=\"http://www.giantbomb.com/soul-calibur/61-12411/\">Soul Calibur</a></li><li><a href=\"http://www.giantbomb.com/tnn-motorsports-hardcore-heat/61-10015/\">TNN Motorsports Hardcore Heat</a></li><li><a href=\"http://www.giantbomb.com/tokyo-xtreme-racer/61-7007/\">Tokyo Xtreme Racer</a></li><li><a href=\"http://www.giantbomb.com/trickstyle/61-5290/\">Trickstyle</a></li></ul>","deck":"The Dreamcast is the fifth and final console developed by Sega and the first of the sixth generation consoles to release. It is famous for being the first console to include online capability, its great game library, and its unexpectedly short life span.","company":{"api_detail_url":"http://api.giantbomb.com/company/62/","id":62,"name":"Sega"},"install_base":10600000,"site_detail_url":"http://www.giantbomb.com/dreamcast/60-37/","id":37,"api_detail_url":"http://api.giantbomb.com/platform/37/","abbreviation":"DC","online_support":true,"date_added":"2008-04-01 01:33:04","image":{"icon_url":"http://media.giantbomb.com/uploads/0/1992/1426199-logo_icon.jpg","medium_url":"http://media.giantbomb.com/uploads/0/1992/1426199-logo_small.jpg","tiny_url":"http://media.giantbomb.com/uploads/0/1992/1426199-logo_tiny.jpg","small_url":"http://media.giantbomb.com/uploads/0/1992/1426199-logo_small.jpg","thumb_url":"http://media.giantbomb.com/uploads/0/1992/1426199-logo_thumb.jpg","screen_url":"http://media.giantbomb.com/uploads/0/1992/1426199-logo_screen.jpg","super_url":"http://media.giantbomb.com/uploads/0/1992/1426199-logo_super.jpg"},"release_date":"1999-09-09 00:00:00","name":"Dreamcast"}