{"original_price":0,"date_last_updated":"2012-09-25 07:49:12","description":"<h2><b>History of the Arcade</b></h2><p><b>WHAT IS AN ARCADE?</b></p><p>Arcade is simply defined as a place where people can hang out and have fun. However, over time, the word is mostly recognized today as a place to play video games and have fun. This was mainly because designer cabinets with screens inside them would provide games that people can enjoy. They would become known as Video Game Arcade machines.</p><p><b>THE RISE AND GOLDEN AGE OF ARCADE GAMES</b></p><div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"924817\"><div class=\"wiki-img-right\"><div class=\"wiki-img-thumb\"><a href=\"http://media.giantbomb.com/uploads/0/8152/924817-cpac_man_super.jpg\" title=\"Pac-Man would become a huge hit for Arcade Games.\"><img id=\"924817\" src=\"http://media.giantbomb.com/uploads/0/8152/924817-cpac_man_thumb.jpg\" alt=\"Pac-Man would become a huge hit for Arcade Games.\" /></a><div class=\"item-caption\">Pac-Man would become a huge hit for Arcade Games.</div></div></div></div><p>Video Game Arcade machines would start to become a force in the late 1970s and peak during the early-to-mid 1980s. This period is known as the Golden Age of Arcade Games and began in 1978 with the release of <a href=\"/space-invaders/61-5099/\">Space Invaders</a>, which became the first blockbuster video game. It put an end to the 1977 video game market crash, caused a national coin shortage in Japan, became a huge success worldwide, and laid the foundations for most shooters and action games released since then.</p><p>The next blockbuster video game was <a href=\"/pac-man/61-7624/\">Pac-Man</a> in 1980. It would become a big success, causing the developers to create a sequel <a href=\"/ms-pac-man/61-6332/\">Ms. Pac-Man</a>. Both Pac-Man and Ms. Pac-Man would become so huge that people of all ages and genders filled the arcades playing the game, from children who played after school or the weekends, to adults who played during their lunch breaks, and after work. These games, with some others like <a href=\"/galaxian/61-2445/\">Galaxian</a>, <a href=\"/galaga/61-15784/\">Galaga</a>, <a href=\"/defender/61-5536/\">Defender</a>, <a href=\"/frogger/61-11903/\">Frogger</a>, <a href=\"/missile-command/61-4062/\">Missile Command</a>, <a href=\"/centipede/61-1157/\">Centipede</a>, and <a href=\"/donkey-kong/61-311/\">Donkey Kong</a>, kept the arcade scene booming in the early 1980s.</p><p><b>DECLINE AND RESURGENCE</b></p><p>Despite the 1983 console gaming market crash, the arcade market was largely unaffected by this. By the mid 1980s, however, the popularity of arcade games began to decline when in 1985, <a href=\"/nintendo/65-90/\">Nintendo</a> released their sequel to one of their mildly popular arcade games <a href=\"/mario-bros/61-19726/\">Mario Bros</a>. The game was called <a href=\"/super-mario-bros/61-15544/\">Super Mario Bros</a>, which became a phenomenon and would put home video games on the map. The <a href=\"/nes/60-21/\">NES</a>'s rising popularity resulted in a brief decline for the arcade gaming industry.</p><p>After Super Mario Bros made a killing on Nintendo's own console, a special arcade version named <a href=\"/vs-super-mario-bros/61-25222/\">VS: Super Mario Bros</a> appeared in the arcades. This version had levels that were different and more challenging than the console version. From Super Mario Bros, onward video game developers released innovative and fun video games in arcades that would create a lasting effect for over a decade in the United States.</p><p>In 1987, arcades experienced a brief resurgence with <a href=\"/double-dragon/61-20752/\">Double Dragon</a>, which started the golden age of <a href=\"/side-scrolling/92-299/\">side-scrolling</a> beat 'em up games, a genre that would peak in popularity with <a href=\"/final-fight/61-6722/\">Final Fight</a> two years later. However, the arcades experienced yet another relative decline by the end of the decade.</p><p><b>THE</b> <b>RENAISSANCE OF</b> <b>ARCADE GAMES</b></p><div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"924818\"><div class=\"wiki-img-left\"><div class=\"wiki-img-thumb\"><a href=\"http://media.giantbomb.com/uploads/0/8152/924818-1181242139123_super.jpg\" title=\"NBA JAM. Just one of many big Arcade hits in the 1990's.\"><img id=\"924818\" src=\"http://media.giantbomb.com/uploads/0/8152/924818-1181242139123_thumb.jpg\" alt=\"NBA JAM. Just one of many big Arcade hits in the 1990's.\" /></a><div class=\"item-caption\">NBA JAM. Just one of many big Arcade hits in the 1990's.</div></div></div></div><p>In 1991, the arcade gaming industry experienced a Renaissance with the release of <a href=\"/street-fighter-ii/62-1795/\">Street Fighter II</a>. It popularized competitive <a href=\"/hand-to-hand-combat/92-288/\">hand-to-hand</a> fighting games and revived the arcade industry to a level of popularity not seen since the days of Pac-Man, with even many of the best-selling home video games in the early 1990s often being arcade ports. During this era, developers like <a href=\"http://www.giantbomb.com/sega/65-62/\">Sega</a>, <a href=\"http://www.giantbomb.com/namco-bandai-games-inc/65-382/\">Namco</a>, <a href=\"http://www.giantbomb.com/midway-games/65-185/\">Midway</a>, <a href=\"http://www.giantbomb.com/capcom/65-367/\">Capcom</a>, and <a href=\"http://www.giantbomb.com/konami-corporation/65-87/\">Konami</a> became household names because of their great games.</p><p>In the 1990s, arcade video games became so big that you had developers making hit games based off of movies, cartoons, comics, and television shows. Sports games using authentic sports licenses were also made and became quite popular. This, however, would result in prices for play going up. In the late 1980s and early 1990s, most arcade games cost a quarter per play. However, this soon changed to fifty cents, seventy-five cents, and some games were even a full dollar for first play. At the time people didn't mind because the arcade was also known as the place to see and enjoy the latest graphics and sound in video gaming. Even though the console market made a solid foundation in the homes of millions of Americans, most of them knew that the graphics in their chosen console, didn't match the superior ones found in the arcade cabinets. Despite ports of popular arcade games hitting consoles, gamers knew they were getting a watered down version of the original.</p><p><b>THE DOWNFALL OF ARCADES IN AMERICA</b></p><div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"924824\"><div class=\"wiki-img-right\"><div class=\"wiki-img-thumb\"><a href=\"http://media.giantbomb.com/uploads/0/8152/924824-street_fighter_alpha_anthology_20060612044731274_000_super.jpg\" title=\"Street Fighter Alpha. Example of an arcade game perfectly ported to 32-bit consoles.\"><img id=\"924824\" src=\"http://media.giantbomb.com/uploads/0/8152/924824-street_fighter_alpha_anthology_20060612044731274_000_thumb.jpg\" alt=\"Street Fighter Alpha. Example of an arcade game perfectly ported to 32-bit consoles.\" /></a><div class=\"item-caption\">Street Fighter Alpha. Example of an arcade game perfectly ported to 32-bit consoles.</div></div></div></div><p>The success of arcade games began to change for the worse in the mid to late 1990's when <a href=\"/polygonal-3d/92-1430/\">3D</a> and <a href=\"/compact-disc/93-2133/\">CD</a> based console gaming start becoming popular. This was definitely the case with the arrival of the 32-bit consoles, the <a href=\"/saturn/60-42/\">Saturn</a> and <a href=\"/playstation/60-22/\">PlayStation</a>. Because of their ability to produce 3D graphics, improved capability in <a href=\"/2d/92-1427/\">2D</a> graphics, and the compact disc ability to carry a lot of data, developers were finally able to make good ports of their games to sell on consoles. Business is business, and the developers saw where they could make a lot more money porting flawless or near flawless copies on their games to popular gaming consoles. Because of this, gamers no longer felt they needed to spend money in the arcades to play the latest eye candy. They could simply go to the store or mall and buy the full game for their console. By the 21st century, console gaming surpassed arcade gaming in every way that mattered. As a result, arcades in <a href=\"/north-america/95-1664/\">North America</a> have been on life support in some areas and dead in others.</p><p><b>ARCADES MAY BE DOWN BUT NOT OUT</b></p><div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"924819\"><div class=\"wiki-img-left\"><div class=\"wiki-img-thumb\"><a href=\"http://media.giantbomb.com/uploads/0/8152/924819-jarcade_795282_super.jpg\" title=\"Your average Japanese Arcade place.\"><img id=\"924819\" src=\"http://media.giantbomb.com/uploads/0/8152/924819-jarcade_795282_thumb.jpg\" alt=\"Your average Japanese Arcade place.\" /></a><div class=\"item-caption\">Your average Japanese Arcade place.</div></div></div></div><p>Arcades are still very popular in <a href=\"/japan/95-37/\">Japan</a>, however, as the Japanese see arcades as part of their national tradition. Many Japanese children as well as adults all go to huge and loud arcade places, that usually have sit down machines. As a result, many major and minor developers are still able to make games and turn a profit releasing those games in Japan. Many of these arcade games usually get ported over to the United States and release on the consoles. As of today, many video game developers are now making arcade games using modern <a href=\"/pc/60-94/\">PC</a> hardware making sure the legacy lives on forever.</p><h2>Arcade Machine Styles</h2><p><b>Arcade cabinets come in many shapes and sizes to best fit the game that they are housing.</b></p><div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"1676971\"><div class=\"wiki-img-right\"><div class=\"wiki-img-thumb\"><a href=\"http://media.giantbomb.com/uploads/12/120503/1676971-ms_pac_man_arcade_machine_super.jpg\" title=\"Ms. Pacman a Upright Arcade Cabinet Controlled with a joystick\"><img id=\"1676971\" src=\"http://media.giantbomb.com/uploads/12/120503/1676971-ms_pac_man_arcade_machine_thumb.jpg\" alt=\"Ms. Pacman a Upright Arcade Cabinet Controlled with a joystick\" /></a><div class=\"item-caption\">Ms. Pacman a Upright Arcade Cabinet Controlled with a joystick</div></div></div></div><p>The most common a style of arcade cabinet in North America is the standard upright cabinet. These cabinets tend to be large and heavy due to there inefficient use of space inside the machine and use of heavy materials such a MDF and metal. Upright cabinets are often six feet tall and take up no more than three feet in width. Normally someone would have to stand to operate the cabinet, or sit on a tall bar stool.The control options for upright arcade cabinets vary from game to game, but commonly contain joysticks, buttons, trackballs, and spinners.</p><div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"1679138\"><div class=\"wiki-img-left\"><div class=\"wiki-img-thumb\"><a href=\"http://media.giantbomb.com/uploads/12/120503/1679138-ag_pacman_desktop_super.jpg\" title=\"25th Anniversary Pacman Re-Release Counter Top Cabinet\"><img id=\"1679138\" src=\"http://media.giantbomb.com/uploads/12/120503/1679138-ag_pacman_desktop_thumb.jpg\" alt=\"25th Anniversary Pacman Re-Release Counter Top Cabinet\" /></a><div class=\"item-caption\">25th Anniversary Pacman Re-Release Counter Top Cabinet</div></div></div></div><p>Also common in North America is the counter-top cabinets. This are cabinets that sit on top of something, like a bar or table to raise them up to playing hight. Counter-top cabinets are popular becuse they save needed floor space and are less intrusive than a full sized cabinet. Although any game or control scheme could be made to work on a counter-top cabinet, they are most popular with touch screen trivia games in bars or pubs.</p><div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"1679149\"><div class=\"wiki-img-right\"><div class=\"wiki-img-screen\"><a href=\"http://media.giantbomb.com/uploads/12/120503/1679149-37182835_7085aa95c7_super.jpg\" title=\"Popular Cocktail Cabinet War Lords\"><img id=\"1679149\" src=\"http://media.giantbomb.com/uploads/12/120503/1679149-37182835_7085aa95c7_screen.jpg\" alt=\"Popular Cocktail Cabinet War Lords\" /></a><div class=\"item-caption\">Popular Cocktail Cabinet War Lords</div></div></div></div><p>Cocktail Cabinets are low to the ground, table like cabinets. Normally a table will have controls on opposite ends of the table, and in some rare cases on all four sides.The monitor will switch orientation to match the appropriate player, with the expiation of four player games where all four people get there own quarter of screen or share a screen. Table style cabinets have the advantage of being a multi-purpose piece of furniture. The monitor is normally cover with plexi glass to prevent damage to the screen from spilt drinks or food.</p><p>Candy Cabs are Japanese sitdown cabinets. They are called candy cabs because the exterior finish resembles hard candy. See MVS section in the <a href=\"/neo-geo/60-25/\">Neo Geo</a> page for more information.</p><p>PlayChoice-10 was an arcade machine released by Nintendo to capitalize on the popularity of arcades in the 1990's, See <a href=\"/playchoice-10/92-3263/\">PlayChoice-10</a> for more information.</p>","deck":"Stand-alone machines that generally only play one video game each. Arcades hit their peak of popularity before home consoles took over the gaming public. Arcade games usually cost 25 cents.","company":null,"install_base":0,"site_detail_url":"http://www.giantbomb.com/arcade/60-84/","id":84,"api_detail_url":"http://api.giantbomb.com/platform/84/","abbreviation":"ARC","online_support":false,"date_added":"2008-04-21 17:01:46","image":{"icon_url":"http://media.giantbomb.com/uploads/0/9565/401036-mame_arcade_essential_cabinet_icon.jpg","medium_url":"http://media.giantbomb.com/uploads/0/9565/401036-mame_arcade_essential_cabinet_small.jpg","tiny_url":"http://media.giantbomb.com/uploads/0/9565/401036-mame_arcade_essential_cabinet_tiny.jpg","small_url":"http://media.giantbomb.com/uploads/0/9565/401036-mame_arcade_essential_cabinet_small.jpg","thumb_url":"http://media.giantbomb.com/uploads/0/9565/401036-mame_arcade_essential_cabinet_thumb.jpg","screen_url":"http://media.giantbomb.com/uploads/0/9565/401036-mame_arcade_essential_cabinet_screen.jpg","super_url":"http://media.giantbomb.com/uploads/0/9565/401036-mame_arcade_essential_cabinet_super.jpg"},"release_date":"1972-07-12 00:00:00","name":"Arcade"}