{"original_price":499,"date_last_updated":"2012-09-23 09:11:03","description":"<p>The iPad is <a href=\"/apple-inc/65-5815/\">Apple</a>'s foray into a new consumer electronics territory called tablet computing. The device uses a 9.7\" multi-touch screen and runs Apple's iOS mobile operating system, based on OS X. Similar to the <a href=\"/iphone/60-96/\">iPhone</a> and <a href=\"/iphone/60-96/\">iPod Touch</a>, the iPad features minimal use of physical buttons, providing only for Power, the Home screen, volume control, and an orientation lock which prevents the tablet's display from rotating with the user's movement. It gained many good reviews from critics when it launched on April 3rd 2010, and sold 3 million units in 80 days.</p><h2>Configurations</h2><p>The iPad has two models on that runs on wifi and the other has a 3G network. The 3G version has a $130 premium. The launch prices are as follows.</p><table class=\"t-editor with-border full-width\"><tbody><tr><th>Model</th><th>16 GB</th><th>32 GB</th><th>64 GB</th></tr><tr><td><b>WiFi</b></td><td>$499</td><td>$599</td><td>$699</td></tr><tr><td><b>WiFi 3G</b></td><td>$629</td><td>$729</td><td>$829</td></tr></tbody></table><p>All six configurations and even their prices have remained the same for iPad 2 and iPad 3 launches. However, alongside the launch of both newer-model iPads, the price of the previous iteration may receive a price cut until stock is cleared.</p><p><a href=\"/steve-jobs/72-9951/\">Steve Jobs</a> has said that there is room to lower pricing in the future if necessary. To date this has not happened. Instead, the iPad has received yearly model revisions to improve the value proposition, with things like upgraded specs, and added features such as cameras, tilt sensor, and retina display.</p><h2>iPhone/iPod Touch apps</h2><p>iPhone/iPod Touch apps and games are compatible with the iPad, and can be run at original resolution or a full-screen \"double\" resolution. The iPad also features exclusive games, which can be run by the more powerful 1 GHz processor with the 256 MB of memory.</p><h2>iBooks</h2><p>One of the key features of the iPad is its iBooks support. iBooks are essentially .pub formatted documents which is presented similarly to how a normal book would look. iBooks can be purchased from the iBooks Store and will be available to iPhone users as well later in the year with iPhone OS 4.0.</p><h2>iPad's 3G Plan</h2><p>Although the iPad 3G adds a $130 premium, the deal Apple struck with AT&amp;T for the iPad's 3G plan is a pay as you go plan with no contract and no added fees. You purchase time through itunes, using the credit card that you have on file with Apple, or a unique one for AT&amp;T. Prices start at $14.99 a month for limited access and $29.99 a month for unlimited access (both include free use at AT&amp;T hotspots). Some of the features in the plan include no billing, no checks, no pay by phone surcharges, no added set up fees, and cancel at any time.</p><p>Verizon has a tiered data plan. The cheapest is $20 a month for 1 GB, and the most expensive plan is $80 a month for 10 GB.</p><h2>Game Center</h2><p>Game Center is an unified log-in for iPad games which allows match-making, friends lists, achievements, leader-boards, and online play. Game Center has been compared to Microsoft's <a href=\"/xbox-live/92-1404/\">Xbox LIVE</a> service.</p><h2>iPad 2</h2><p>The second generation iPad was released in March 2011. It features a thinner case, forward and back facing camera, and the Apple A5 core processor.</p><h2>iPad 3</h2><p>The third generation iPad, released in 2012, is the first iPad with a ''retina display''. It has a higher resolution than HDTV's, with pixels so fine that they cannot be seen with the naked eye.</p><h2>Foxconn controversy</h2><p>Apple products are manufactured by a Taiwanese manufacturing company named Foxconn which has a track record of employee suicides. At least 14 suicides are confirmed in 2010. Long working hours and racial discrimination are cited as potential contributing factors.</p><p>There has also been evidence reported of illegal overtime and failure by Foxconn management to report accidents. Workers complained they were forced to stand for more then eight hours at a time.</p><p>In 2011, Apple admitted that they were finding <a href=\"http://www.telegraph.co.uk/technology/apple/8324867/Apples-child-labour-issues-worsen.html\" rel=\"nofollow\">more and more child laborers in their factories</a>.</p>","deck":"The iPad is a \"multimedia tablet computer\" with a 9.7\" touchscreen. The iPad can browse the web, playback local and streamed content, and run a large variety of third party apps, including games.","company":{"api_detail_url":"http://api.giantbomb.com/company/5815/","id":5815,"name":"Apple Inc."},"install_base":15000000,"site_detail_url":"http://www.giantbomb.com/ipad/60-121/","id":121,"api_detail_url":"http://api.giantbomb.com/platform/121/","abbreviation":"IPAD","online_support":true,"date_added":"2010-04-10 10:07:02","image":{"icon_url":"http://media.giantbomb.com/uploads/8/88161/1325874-ipad_hero_20100127_icon.jpg","medium_url":"http://media.giantbomb.com/uploads/8/88161/1325874-ipad_hero_20100127_small.jpg","tiny_url":"http://media.giantbomb.com/uploads/8/88161/1325874-ipad_hero_20100127_tiny.jpg","small_url":"http://media.giantbomb.com/uploads/8/88161/1325874-ipad_hero_20100127_small.jpg","thumb_url":"http://media.giantbomb.com/uploads/8/88161/1325874-ipad_hero_20100127_thumb.jpg","screen_url":"http://media.giantbomb.com/uploads/8/88161/1325874-ipad_hero_20100127_screen.jpg","super_url":"http://media.giantbomb.com/uploads/8/88161/1325874-ipad_hero_20100127_super.jpg"},"release_date":"2010-04-03 00:00:00","name":"iPad"}