{"original_price":599,"date_last_updated":"2012-09-23 15:37:44","description":"<h2>The iPhone</h2><p>The iPhone is an internet-enabled multimedia device designed by <a href=\"/apple-inc/65-5815/\">Apple Inc</a>. The phone is sold in many countries; in the US AT&amp;T, Verizon and now Sprint sell the phone on contract. The latest iPhone features a capacitive <a href=\"/multitouch/92-4952/\">multi-touch</a> screen, camera, built-in widescreen iPod, voice recorder, compass, mail, calendar, YouTube app, and iTunes Store. With the release of OS 2.0 in 2008, it was possible to make the iPhone a gaming platform. Thanks to the App Store, all games are available for download from within the phone or from iTunes on a computer. Major players such as <a href=\"/gameloft-sa/65-743/\">Gameloft</a>, <a href=\"/thq/65-15/\">THQ</a>, <a href=\"/electronic-arts/65-1/\">EA</a>, <a href=\"/namco-bandai-games-inc/65-382/\">Namco Bandai</a> and others have committed to the iPhone. Many games, like Super Monkey Ball, have been released for the iPhone. iPhone OS 3.0 allows paid applications to facilitate the purchase of add-ons within the application. The iPhone has five released hardware versions. The first was the iPhone, then the iPhone 3G, iPhone 3GS, iPhone 4 and now the iPhone 4s. These improvements allow for better frame rates and more technically impressive games.</p><p>The iPhone is an attractive platform for independent developers due to the App Store. Members of the Apple Developer Program (membership costs) can distribute applications on the App Store and charge whatever they want. It is free to distribute free applications, but developers only receive 70% of revenue produced by commercial applications.</p><h2>Specifications</h2><p>The iPhone is a very capable platform in terms of processing power. It has a 620 MHz ARM 1176 underclocked to 400 MHz processor, 128 MB eDRAM as well as a PowerVR MBX graphics processing unit. This allows it to run 3D and sprite-based games which put most phones' graphical capabilities to shame. Graphics are run through OpenGL, however it is the less-powerful Embedded System version. The iPhone 3GS has a 833 MHz ARM Cortex-A8 underclocked to 600 MHz, 256 MB eDRAM, and a PowerVR SGX GPU.</p><p>The iPhone 4 has the ARM Cortex-A8CPU integrated with a PowerVR SGX 535 GPU and 515 MB eDRAM.</p><p>There are some issues for running games on the iPhone, the main one being a lack of a tactile input. The iPhone is controlled via a combination of a touch screen, which can recognize multiple points of contact, as well as an accelerometer, which can sense movement of the device. These methods of input can work well for many genres, including racing, puzzle, and adventure games. However the lack of physical button-based input can inhibit more traditional action-based games, platformers, etc. due to the finger needing to obscure the screen. <a href=\"/virtual-joystick/92-4951/\">Virtual buttons</a> may be used instead, but that takes up space on the rather small screen and lacks tactile feedback and the ability to be pressure sensitive. Unlike the <a href=\"/nintendo-ds/60-52/\">Nintendo DS</a>, the iPhone's screen is not sensitive to physical pressure, but only disturbances through bioelectric contact such as skin -- the former being known as resistive and the latter capacitive. This is why using a plastic stylus or most inorganic objects will not register input.</p><h2>Different Models</h2><p>Since the original iPhone release, Apple have upgraded the model with two new releases, the iPhone 3G boasted a new streamlined design, replacing the aluminum backing for a more suited black plastic. It also introduced 3G to the iPhone, which was a feature that many critics complained about the original not having, considering it was a smartphone and a GPS. The iPhone 3GS released in 2009 claimed to be \"twice as fast\" as the 3G, it also has a 3.0 megapixel camera that takes stills and video, compared to the iPhone and the 3G's fixed focus 2.0 megapixel camera, which could not record video. Additionally, the 3GS added a digital compass.</p><p>In June 2010, the iPhone 4 was released. The iPhone was vastly improved now, with a faster CPU, a higher resolution display, noise suppressing dual microphones, a 5.0 megapixel camera and a newly added front-facing camera, longer battery life, and a design change which made it distinct from older models.</p><p>On October 4 2011, Apple announced the Iphone 4S. Changes include a new 8MP camera,1080p video recording, an improved antenna, Apple's A5 dual core processor and Siri, a voice controlled assistant. It released on October 14, 2011.</p><h2>Jailbreaking</h2><p>Jailbreaking is a process that allows the iPhone and iPod Touch to run unsigned code on, bypassing Apple's official distribution platform, the App Store. Once jailbroken, iPhone users are able to download many applications previously unavailable through the App Store due to Apple's rules.</p><p>Jailbreaking is condemned by Apple and will cause any standing warranty on an iPhone or iPod Touch product to become null and void.</p><h2>The iPod Touch</h2><p>The iPod Touch looks a lot like the iPhone, but there are a few key differences between the two. The most notable of these differences is the fact that the iPod touch does not have a GSM radio built into it, and therefore cannot use a cellular network with which to make phone calls or access the internet, though it does include Wi-Fi. The first generations did not have a built-in camera or microphone, but the second generation (2G, 2008) of the hardware does include an internal speaker and adds support for an external microphone. The fourth generation (4G, 2010) now includes a built-in microphone and also a camera which can record both images and video. Like the iPhone, the iPod touch runs iPhone OS. The iPhone OS 3.0 on the iPod touch unlocks Bluetooth (for 2G touch), landscape keyboard in more apps, peer-to-peer gameplay, and several other new features. The iPod Touch functions much like the iPhone, but is slightly smaller, lighter, and can be purchased without a phone contract.</p><h2>Game Center</h2><p>Game Center is Apple's gaming platform for the iPod Touch, iPhone and <a href=\"/ipad/60-121/\">iPad</a>, which was announced as part of the iPhone OS 4.0 on April 8, 2010. The new platform will work as a social gaming network, with the ability to track friends and invite them to games, matchmaking, <a href=\"/leaderboard/92-30/\">leaderboards</a> and <a href=\"/achievements/92-29/\">achievements</a>. Game Center will replace other gaming networks on the iPhone such as <a href=\"/openfeint/92-4240/\">OpenFeint</a>, and allow for a more wholesome experience. The network was supposed to launch as part of iPhone OS 4.0 in June 2010, but was delayed to September 2010.</p>","deck":"The iPhone is a multimedia multi-touch smartphone created by Apple Inc. ","company":{"api_detail_url":"http://api.giantbomb.com/company/5815/","id":5815,"name":"Apple Inc."},"install_base":100000000,"site_detail_url":"http://www.giantbomb.com/iphone/60-96/","id":96,"api_detail_url":"http://api.giantbomb.com/platform/96/","abbreviation":"IPHN","online_support":true,"date_added":"2008-06-09 10:55:31","image":{"icon_url":"http://media.giantbomb.com/uploads/3/38377/1750597-apple_iphone_4_101_icon.jpg","medium_url":"http://media.giantbomb.com/uploads/3/38377/1750597-apple_iphone_4_101_small.jpg","tiny_url":"http://media.giantbomb.com/uploads/3/38377/1750597-apple_iphone_4_101_tiny.jpg","small_url":"http://media.giantbomb.com/uploads/3/38377/1750597-apple_iphone_4_101_small.jpg","thumb_url":"http://media.giantbomb.com/uploads/3/38377/1750597-apple_iphone_4_101_thumb.jpg","screen_url":"http://media.giantbomb.com/uploads/3/38377/1750597-apple_iphone_4_101_screen.jpg","super_url":"http://media.giantbomb.com/uploads/3/38377/1750597-apple_iphone_4_101_super.jpg"},"release_date":"2007-06-29 00:00:00","name":"iPhone"}