{"original_price":250,"date_last_updated":"2012-08-10 08:04:48","description":"<h2><b>History</b></h2><p>After an absence from the videogame console market since the demise of the 7800 system in 1991, <a href=\"/atari/65-182/\">Atari</a> made its return with the Jaguar. The system was released in 1993 in <a href=\"http://www.giantbomb.com/san-francisco/95-191/\">San Francisco</a> and in 1994 for the rest of <a href=\"http://www.giantbomb.com/the-united-states-of-america/95-396/\">America</a> and <a href=\"http://www.giantbomb.com/europe/95-289/\">Europe</a>. Unfortunately, the Jaguar was a commercial failure that left the company financially crippled. It was the last console Atari produced.</p><p>In the early 1990s, Atari was negotiating with a British company called Flare Technology, who had designed the unreleased Konix Multisystem console. Atari was impressed by the work Flare had done on the Konix, and provided to the funding to found a new company, Flare 2. Flare 2 started development on two consoles, the 32-bit Panther and the 64-bit Jaguar. Eventually, after seeing the Jaguar's graphical abilities, Atari ceased work on Panther and focused their attention on the more powerful Jaguar. They aimed to surpass the abilities of the Sega Genesis and the Super Nintendo, and compete against the new generation of consoles in development by <a href=\"http://www.giantbomb.com/the-3do-company/65-224/\">3DO</a>, <a href=\"http://www.giantbomb.com/nintendo/65-90/\">Nintendo</a> and <a href=\"http://www.giantbomb.com/sega/65-62/\">Sega</a>, while still remaining cost effective. Despite the Panther's cancellation, some games developed for it saw release. For example, the game <a href=\"http://www.giantbomb.com/cybermorph/61-9922/\">Cybermorph</a> that came bundled with the Atari Jaguar was a game designed for Panther.</p><h2>64-bit?</h2><p>Atari advertised the Jaguar aggressively in the press with its \"Do the Math\" campaign; boasting about its technical superiority over the 16-bit platforms, and claiming to be the first 64-bit home console on the market. While the Jaguar was certainly more powerful than the <a href=\"http://www.giantbomb.com/snes/60-9/\">Super Nintendo</a> and <a href=\"http://www.giantbomb.com/genesis/60-6/\">Genesis</a> in most respects, these claims caused some controversy.</p><p>Many technically knowledgeable industry insiders and gamers claimed that the Jaguar was not a true 64-bit platform, because the Jaguar’s Motorola 68000 CPU chip was only 32-bit, and the primary GPU delivered a 32-bit instruction set. The complaint is similar to the earlier argument that the <a href=\"/turbografx-16/60-55/\">TurboGrafx-16</a> was actually an 8-bit system, since it was based around an 8-bit CPU (but with 16-bit video chips), and equally gray.</p><p>A major contributor to this issue was the industry's desire to use \"bits\" as a concrete measure of subjective \"impressiveness.\" With Sega and Nintendo promoting 16-bit systems as vastly superior to previous 8-bit systems, gamers naturally expected a similar, obvious jump in quality with the Jaguar. In theory, 64-bit games should have been 4x as impressive as 16-bit systems (as frequently cited when the Jaguar is compared to the <a>Nintendo 64</a>). In reality, this is misunderstanding the meaning of \"bits,\" and applying some wishful thinking toward rating a console's performance by a simple number.</p><p>Ultimately, due to Jaguar's chip set architecture and processing methods, there was just enough to backup Atari’s 64-bit claim. The design, if always followed as intended, would indeed utilise 64-bit graphical processing and buck claims of the Jaguar being simply \"two 32-bit chips glued together.\" Unfortunately, the games frequently failed to match up with any technological potential.</p><p>Jaguar programming enthusiasts looking over dumped code from retail titles have also suggested many companies treated the Motorola CPU as the main processing unit, instead of as a controller for the 64-bit Tom and Jerry \"workhorse\" chips, as Atari intended. This would artificially limit the machine's capabilities, and has been cited as the primary reason for choppy performance in some games ( <a href=\"/checkered-flag/61-12786/\">Checkered Flag</a> is a specific example). It is unclear as to how frequently this occurred, and if it was due to poor documentation from Atari, or simply that developers were more familiar with the common 68000 chip.</p><h2>Legacy</h2><p>The Jaguar platform did have a few excellent titles for it, including <a href=\"http://www.giantbomb.com/alien-vs-predator/61-8142/\">Alien VS Predator</a>, <a href=\"http://www.giantbomb.com/doom/61-7326/\">Doom</a> and <a href=\"http://www.giantbomb.com/tempest-2000/61-8496/\">Tempest 2000</a>, but most the games released did not look much better than 16 bit games. Indeed, a large number of them were ports of games released on the Sega Genesis and Super Nintendo systems.</p><p>The Atari Jaguar was a powerful system for its time, with many of the units being sold to the loyal and dedicated Atari fan base that had built up since the early 1980‘s. Many clever and innovative ideas for the system were in the pipeline, most of which never made it past the prototype phase because of poor sales and short life span of the console.</p><p>The Jaguar’s success was hindered by a number of contributing factors, such as a limited game library, third party software development issues, and fierce competitors in the form of <a href=\"http://www.giantbomb.com/sony-corporation/65-3223/\">Sony</a>’s <a href=\"http://www.giantbomb.com/playstation/60-22/\">PlayStation</a> and <a href=\"http://www.giantbomb.com/sega/65-62/\">Sega</a>’s <a href=\"http://www.giantbomb.com/saturn/60-42/\">Saturn</a> which finally finished off the Jaguar by mid-1996.</p><p>In the late 1990’s <a href=\"http://www.giantbomb.com/hasbro-interactive-inc/65-531/\">Hasbro interactive</a> bought out all Atari properties and declared the Jaguar an open platform for homebrew development. Today the Atari Jaguar has a loyal cult following, who use the console for all sorts of development, including utilizing the COM <a href=\"http://www.giantbomb.com/lynx/60-7/\">Lynx</a> and \"CatBox\" device for the networking of up to 32 Jaguar consoles.</p><h2>Specifications</h2><h3><b>First Chip - Tom Chip (26.59 MHz)</b></h3><ul><ul><li>Graphics processing unit (GPU) – 32-bit RISC architecture, 4 KB internal cache.</li><li>Object Processor – 64-bit RISC architecture.</li></ul><li>Blitter – 64-bit RISC architecture; high speed logic operations, z-buffering and Gouraud shading, with 64-bit internal registers.</li><li>DRAM controller, 32-bit memory management.</li></ul><h3>Second Chip - Jerry Chip (26.59 MHz)</h3><ul><li>Digital Signal Processor – 32-bit RISC architecture, 8 KB internal cache. Same RISC core as the GPU, but not limited to graphic production.</li><li>CD-quality sound (16-bit stereo). Number of sound channels limited by software. 2 DACs (stereo) convert digital data to analog sound signals. Full stereo capabilities.</li></ul><ul><li>Wavetable synthesis, FM synthesis, FM Sample synthesis, and AM synthesis.</li><li>A clock control block, incorporating timers, and a UART.</li><li>Joystick control.</li></ul><h3>Features</h3><ul><li>Motorola 68000 (used as a manager).</li><li>General purpose 16/32-bit control processor, (13.295 MHz).</li><li>2 MB RAM on a 64-bit bus using 4x 16-bit fast page mode DRAMS.</li><li>Storage - Cartridge – up to 6 MB.</li><li>Support for COM Lynx I/O.</li></ul><p>An interesting note is that Jaguar cartridges are generally not <a href=\"/region-locked/92-5682/\">region locked</a>, or even linked to PAL or NTSC video rates. While other consoles do this at the software level, Jaguar consoles are PAL or NTSC specific, and the cartridges themselves are commonly agnostic. This is why most Jaguar packaging is in English, French, and German. Production costs were saved by printing one cart type and selling it worldwide.</p><div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"2090429\"><div class=\"wiki-img-right\"><div class=\"wiki-img-screen\"><a href=\"http://media.giantbomb.com/uploads/11/116773/2090429-jag_3_.png\" title=\"Red Screen of Death\"><img id=\"2090429\" src=\"http://media.giantbomb.com/uploads/11/116773/2090429-jag_3__screen.png\" alt=\"Red Screen of Death\" /></a><div class=\"item-caption\">Red Screen of Death</div></div></div></div><p>The Jaguar's cartridge port contains no hinged dust cover or similar protection. The port is simply left exposed on the top of the console. Because of this design flaw, contacts on both the console and the cartridges are extremely sensitive to dust, oil, corrosion, or other elements that prevent a solid contact. Poor contact between the cartridge and the console leads to the common \"Red Screen of Death\" on booting the console. Contrary to popular belief, this does not indicate a hardware failure. In nearly every case, the red screen can be cleared by aggressively cleaning the cartridge with mild solvents (alcohol or peroxide) - just blowing on the cart won't usually do.</p><h2>U.S. Launch Titles</h2><p>The following are launch titles for the Jaguar when it was released in November 1993.</p><ul><li><a href=\"http://www.giantbomb.com/cybermorph/61-9922/\">Cybermorph</a></li><li><a href=\"http://www.giantbomb.com/raiden/61-16693/\">Raiden</a></li><li><a href=\"http://www.giantbomb.com/trevor-mcfur-in-the-crescent-galaxy/61-19437/\">Trevor McFur in the Crescent Galaxy</a></li></ul><h2>JagWare</h2><p>A company called <a href=\"http://www.jagware.org/\" rel=\"nofollow\">JagWare</a> is making new Jaguar Games to play. The games include:</p><ul><li>Kobayashi Maru</li><li>More titles to be revealed</li></ul>","deck":"The Atari Jaguar was claimed to be the first 64-bit console to hit the market, as well as the last major gaming system Atari would produce.","company":{"api_detail_url":"http://api.giantbomb.com/company/548/","id":548,"name":"Atari SA"},"install_base":500000,"site_detail_url":"http://www.giantbomb.com/jaguar/60-28/","id":28,"api_detail_url":"http://api.giantbomb.com/platform/28/","abbreviation":"JAG","online_support":false,"date_added":"2008-04-01 01:32:54","image":{"icon_url":"http://media.giantbomb.com/uploads/0/26/10845-atarijaguar_icon.jpg","medium_url":"http://media.giantbomb.com/uploads/0/26/10845-atarijaguar_small.jpg","tiny_url":"http://media.giantbomb.com/uploads/0/26/10845-atarijaguar_tiny.jpg","small_url":"http://media.giantbomb.com/uploads/0/26/10845-atarijaguar_small.jpg","thumb_url":"http://media.giantbomb.com/uploads/0/26/10845-atarijaguar_thumb.jpg","screen_url":"http://media.giantbomb.com/uploads/0/26/10845-atarijaguar_screen.jpg","super_url":"http://media.giantbomb.com/uploads/0/26/10845-atarijaguar_super.jpg"},"release_date":"1993-11-18 00:00:00","name":"Jaguar"}