{"original_price":700,"date_last_updated":"2012-09-07 10:34:54","description":"<h2>Summary</h2><p>The 3DO started out as an idea by <a href=\"http://www.giantbomb.com/trip-hawkins/72-18128/\">Trip Hawkins</a>, one of the founders of <a href=\"/electronic-arts/65-1/\">Electronic Arts</a> and was designed by <a href=\"http://www.giantbomb.com/robert-j-mical/72-23649/\">RJ Mical</a> and <a href=\"http://www.giantbomb.com/dave-needle/72-23650/\">Dave Needle</a>. It was envisioned as a true multimedia device. Unfortunately, things did not pan out that way.</p><h2>Development and History</h2><div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"2299347\"><div class=\"wiki-img-right\"><div class=\"wiki-img-screen\"><a href=\"http://media.giantbomb.com/uploads/5/56413/2299347-pan_3do.jpg\" title=\"Panasonic 3DO Model FZ-1\"><img id=\"2299347\" src=\"http://media.giantbomb.com/uploads/5/56413/2299347-pan_3do_screen.jpg\" alt=\"Panasonic 3DO Model FZ-1\" /></a><div class=\"item-caption\">Panasonic 3DO Model FZ-1</div></div></div></div><p>The 3DO console was intended to be made by any manufacturer who signed a licensing agreement with the 3DO company. These companies included some of the world’s largest electronics companies at the time: Goldstar, Sanyo, Samsung, AT&amp;T, Creative Labs and even Panasonic, which at the time of the 3DO's release was the largest electronic manufacturer. A second part of 3DO’s business strategy was to be extremely liberal when it came to manufacturing the system; the idea was that there would be no designated system specs. This gave manufacturers the freedom to create anything they wanted for any person or audience. In concept it would give consumers more choices as the 3DO would be extremely upgradeable. The idea was to make the 3DO as simple to manufacture as a CD player, while still functioning as a home entertainment system, a PC, a music player, and, most importantly, a video game system. The 3DO would also allow third party developers to push new technology, like wireless and DVD remote-style controllers, as well as numerous multimedia features.</p><div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"1083968\"><div class=\"wiki-img-left\"><div class=\"wiki-img-super wiki-img-thumb\"><a href=\"http://media.giantbomb.com/uploads/0/8272/1083968-sanyo3do_super.jpg\" title=\"A 3DO of Sanyo manufacturing\"><img id=\"1083968\" src=\"http://media.giantbomb.com/uploads/0/8272/1083968-sanyo3do_super.jpg\" alt=\"A 3DO of Sanyo manufacturing\" /></a><div class=\"item-caption\">A 3DO of Sanyo manufacturing</div></div></div></div><p>Trip Hawkins wanted people to see the 3DO as a multimedia unit; however, with an MSRP of $700, audiences everywhere rejected it as an overpriced piece of tech. Consumers also rejected the 3DO due to its lack of quality launch titles. Some of the manufacturers caught on to how the 3DO was being perceived by audiences and attempted to remedy it by manufacturing cheaper versions of the unit, but their attempts failed and the impression that the 3DO was an overpriced video game console had been firmly established.</p><p>The 3DO console debuted in 1993, but with no in-house development and third-party support dwindling, the 3DO was effectively dead by 1997 and in the half-off bins of almost every video game store in America. By the end of the console's life and the bankruptcy of the 3DO company, the console had only sold a measly 2 million units.</p><p>The 3DO Company did try to follow up the console with a second video game console design dubbed M2, but this console never made it past the intial design and test system phase, effectively cancelling many titles in development for the system, including the prototype for <a href=\"/d2/61-18898/\">D2</a>. The M2 design was eventually sold off to Panasonic/Matsushita.</p><h2>Design</h2><p>Despite ultimately being a failure the 3DO featured several notable innovations. While some console manufacturers were still utilizing cartridges, the 3DO embraced the CD format. With special additions, up to 8 players could play cooperatively on a single console. The system also featured an internal memory allowing players to save their game data in the console.</p><div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"1083971\"><div class=\"wiki-img-right\"><div class=\"wiki-img-thumb\"><a href=\"http://media.giantbomb.com/uploads/0/8272/1083971-mb_fz1_super.jpg\" title=\"Inside a Goldstar 3DO. Pretty sexy, no?\"><img id=\"1083971\" src=\"http://media.giantbomb.com/uploads/0/8272/1083971-mb_fz1_thumb.jpg\" alt=\"Inside a Goldstar 3DO. Pretty sexy, no?\" /></a><div class=\"item-caption\">Inside a Goldstar 3DO. Pretty sexy, no?</div></div></div></div><p>The console had expansion modules which gave owners the ability to turn their console into a media player. However, expansions that allowed owners to play VHS tapes as well as VCDs were either rare and hard to come by or outrageously expensive. Also, the ability to play VHS tapes was a questionable feature mostly due to VCDs becoming more affordable and visually superior.</p><p>This again highlights yet another flaw that plagued owners of 3DOs and the console: features that were promised at launch were not a reality. Expansion modules which would have allowed for more RAM or memory never quite came to fruition. In fact, the much requested memory expansion for the unit was only released in Japan and in limited supply in the United States.</p><h2>Games and Development Support</h2><div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"1083973\"><div class=\"wiki-img-right\"><div class=\"wiki-img-thumb\"><a href=\"http://media.giantbomb.com/uploads/0/8272/1083973-burning_soldier_super.jpg\" title=\"3DO version of Burning Soldier\"><img id=\"1083973\" src=\"http://media.giantbomb.com/uploads/0/8272/1083973-burning_soldier_thumb.jpg\" alt=\"3DO version of Burning Soldier\" /></a><div class=\"item-caption\">3DO version of Burning Soldier</div></div></div></div><p>Despite being a commercial failure, the 3DO featured an impressive amount of third-party support for its first year. Just like their manufacturing policy, the 3DO Company was extremely liberal when it came to ensuring quality games on their console. A few of the systems highlights include <a href=\"http://www.giantbomb.com/doom/61-7326/\">Doom</a>, <a href=\"http://www.giantbomb.com/samurai-shodown/61-5692/\">Samurai Shodown</a>, <a href=\"http://www.giantbomb.com/lemmings/61-1446/\">Lemmings</a>, <a href=\"http://www.giantbomb.com/the-need-for-speed/61-4703/\">Need for Speed</a> and <a href=\"http://www.giantbomb.com/road-rash/61-8251/\">Road Rash</a>. On top of that, the 3DO benefited from having ports of arcade games such as the immensely popular <a href=\"/super-street-fighter-ii-turbo/61-1251/\">Super Street Fighter II Turbo</a> in its catalog. Also, a certain street racing series called <a href=\"/need-for-speed/62-483/\">Need for Speed</a> got its start on the 3DO. However, quality games for the 3DO came in inconsistent bursts, and for every quality game there was a myriad number of shovelware games. Also, due to the console's adoption of the CD format, it saw a large number of questionable <a href=\"/full-motion-video/92-604/\">FMV</a> games that were becoming popular at the time.</p><h2>System specifications</h2><p>(Remember that a lot of the 3DO was highly upgradeable and can differ between manufacturer):</p><p>-32-bit 12.5Mhz RISC CPU (ARM60) made by Advanced RISC Machines</p><p>(Roughly equivalent to a 25Mhz 68030)</p><p>-640x480 pixel resolution at 16.7 million colors</p><p>-Two Accelerated Video Co-Processors with the following features:</p><ul><li>25Mhz clock rate.</li><li>Capable of producing 9-16 million REAL pixels per second (36-64 Mpix/sec</li><li>interpolated), distorted, scaled, rotated and texture mapped.</li><li>Able to map a rectangular bitmap onto any arbitrary 4-point polygon.</li><li>Texturemap source bitmaps can be 1,2,4,6,8, or 16 bits per pixel and are</li><li>RLE compressed for a maximum combination of both high resolution and small storage space.</li><li>Supports transparency, translucency, and color-shading effects.</li></ul><p>-Custom 16-bit Digital Signal Processor (DSP) with the following features:</p><ul><li>Specifically designed for mixing, manipulating, and synthesizing CD quality sound.</li><li>Can decompress sound 2:1 or 4:1 on the fly, saving memory and bandwidth.</li><li>25Mhz clock rate.</li><li>Pipelined CISC architecture.</li><li>16-bit register size.</li><li>17 separate 16-bit DMA channels to and from system memory.</li><li>On chip instruction SRAM and register memory.</li><li>20-bit internal processing.</li><li>Special filtering capable of creating effects such as 3D sound.</li></ul><p>-Separate BUS for video refresh updates (VRAM is dual ported)</p><p>-Super Fast BUS Speed (50 Megabytes per second)</p><p>-Math Co-Processor custom designed by NTG for accelerating fixed-point matrix</p><p>operations. (Note: This is *not* the ARM FPA)</p><p>-CD-ROM Drive with the following features:</p><ul><li>320ms access time</li><li>Doublespeed 300kbps Data Transfer</li><li>32kbyte ram buffer</li></ul><p>-2 megabytes of DRAM</p><p>-1 megabyte of VRAM (also capable of holding/executing code and data)</p><p>-1 megabyte of ROM</p><p>-36 Separate DMA Channels for fast data processing and efficient bus usage</p><p>-2 expansion ports:</p><ul><li>1 High-speed 68 pin x 1 AV I/O port (for FMV cartridge)</li><li>1 High-speed 30 pin x 1 I/O expansion port</li></ul><p>-1 Control port, capable of chaining together up to 8 peripherals</p><p>-Multitasking 32-bit Operating System</p><p>-16-bit Stereo Sound</p><p>-44.1KHz Sound Sampling Rate</p><p>-Fully Supports Dolby(tm) Surround Sound</p><p>-32kb battery backed up SRAM</p>","deck":"3DO was a video game console manufactured by Panasonic, Goldstar, and Sanyo. Despite the initial hype surrounding the system, the console's $700 price tag proved to be the ultimate kiss of death for the system.","company":{"api_detail_url":"http://api.giantbomb.com/company/1277/","id":1277,"name":"Matsushita Electric Corporation of America (Panasonic)"},"install_base":2000000,"site_detail_url":"http://www.giantbomb.com/3do/60-26/","id":26,"api_detail_url":"http://api.giantbomb.com/platform/26/","abbreviation":"3DO","online_support":false,"date_added":"2008-04-01 01:32:53","image":{"icon_url":"http://media.giantbomb.com/uploads/0/26/10067-goldstar 3do_icon.jpg","medium_url":"http://media.giantbomb.com/uploads/0/26/10067-goldstar 3do_small.jpg","tiny_url":"http://media.giantbomb.com/uploads/0/26/10067-goldstar 3do_tiny.jpg","small_url":"http://media.giantbomb.com/uploads/0/26/10067-goldstar 3do_small.jpg","thumb_url":"http://media.giantbomb.com/uploads/0/26/10067-goldstar 3do_thumb.jpg","screen_url":"http://media.giantbomb.com/uploads/0/26/10067-goldstar 3do_screen.jpg","super_url":"http://media.giantbomb.com/uploads/0/26/10067-goldstar 3do_super.jpg"},"release_date":"1993-08-27 00:00:00","name":"3DO"}