{"original_price":300,"date_last_updated":"2012-08-07 18:13:59","description":"<h2> Summary</h2> <div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"176108\"><div class=\"wiki-img-left\"><div class=\"wiki-img-thumb\"><a href=\"http://media.giantbomb.com/uploads/0/3/176108-vic_super.jpg\" title=\"The VIC-20\"><img id=\"176108\" src=\"http://media.giantbomb.com/uploads/0/3/176108-vic_thumb.jpg\" alt=\"The VIC-20\" /></a><div class=\"item-caption\">The VIC-20</div></div></div></div>Debuting in June 1980 at the Computer Electronics Show, the VIC-20 was <a href=\"/commodore/65-2000/\">     Commodore</a> International’s attempt to make a computer which would appeal to more than just computer hobbyists. &nbsp;Commodore wanted to, as their CEO <a href=\"/jack-tramiel/72-98032/\">    Jack Tramiel </a>put it, \"make a computer for the masses\". &nbsp;The VIC-20 had an unusual beginning as nothing more than a graphics chip. &nbsp;After Commodore could not sell this chip, they decided to construct an entire home computer around it and advertise it as an inexpensive computer that was accessible to every member of the household. &nbsp;The plan worked, and the VIC 20 sold tremendously well when it was first released to the public. &nbsp;It was so successful that the VIC-20 would go down in the history books as the very first computer to have sold more than 1 million units. <br /><br /><h2>Development</h2> <div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"10320\"><div class=\"wiki-img-left\"><div class=\"wiki-img-thumb\"><a href=\"http://media.giantbomb.com/uploads/0/26/10320-Commodore_PET4032_super.jpg\" title=\"Commodore PET 4032\"><img id=\"10320\" src=\"http://media.giantbomb.com/uploads/0/26/10320-Commodore_PET4032_thumb.jpg\" alt=\"Commodore PET 4032\" /></a><div class=\"item-caption\">Commodore PET 4032</div></div></div></div> The VIC was the successor to Commodore's PET line of computers, but Commodore decided to treat the VIC differently as they were going for a completely different audience with this computer. &nbsp;In order to buy a computer from the PET product line, a consumer had to find a licensed seller. &nbsp;As a result, the PET computers were only available at hobby shops or dedicated computer stores. &nbsp;When the VIC arrived Commodore did away with their licensing business model and sold the computer to any store willing to stock them. The computers were appearing everywhere, even auto shops and hardware stores were selling the computers next to their products, and this solidified the VIC as a computer even for people who did not know anything about computers.<br /> <div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"1104712\"><div class=\"wiki-img-right\"><div class=\"wiki-img-thumb\"><a href=\"http://media.giantbomb.com/uploads/0/8272/1104712-3407577565_dd83045b5e_super.jpg\" title=\" TV Screen Not Included\"><img id=\"1104712\" src=\"http://media.giantbomb.com/uploads/0/8272/1104712-3407577565_dd83045b5e_thumb.jpg\" alt=\" TV Screen Not Included\" /></a><div class=\"item-caption\"> TV Screen Not Included</div></div></div></div> <br />The VIC-20 had a lot of appeal to the mass market due to its simple design and low price, but that started to show some problems of its own. &nbsp;CEO Jack Tramiel, being the frugal and hard liner that he was, told his engineers they could only use 1K chips in the new machine because Commodore had a huge inventory they were unable to use in other products.&nbsp; In the end the VIC had 5.5K of RAM, 2K of which was used by the Basic Operating System. To do any real development in such a small area required a machine language.&nbsp;&nbsp; <br />&nbsp;<br />However, even in the early '80s that simply was not enough RAM for various tasks. &nbsp;This was such an issue that developers of software for the VIC-20 were often forced to write code for the machine by hand. Fortunately, Commodore soon released several ROM expansion packs, similar to what would later be released for the N64.&nbsp; Commodore powered their machine using the 1Mhz, 8 Bit CSG/MOS 6502 CPU. &nbsp;With good (for the time) sound and color graphics, Commodore had produced a technical marvel and the machine became a smash hit.&nbsp; Like the PET, the Commodore VIC-20 was released worldwide relatively quickly after its U.S. and Canadian introduction. <br /><br /><h2>Revolutionary Design</h2> <div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"1104709\"><div class=\"wiki-img-left\"><div class=\"wiki-img-thumb\"><a href=\"http://media.giantbomb.com/uploads/0/8272/1104709-3359079156_890988ab94_super.jpg\" title=\"The Full Package\"><img id=\"1104709\" src=\"http://media.giantbomb.com/uploads/0/8272/1104709-3359079156_890988ab94_thumb.jpg\" alt=\"The Full Package\" /></a><div class=\"item-caption\">The Full Package</div></div></div></div> Like many of their previous computers the VIC-20 had many innovations that shaped the computer industry greatly. The Commodore VIC-20 was the first color computer that retailed as a \"computer for the masses\" at less than US$300.<br /><br />But a low selling price wasn't the only thing that Commodore used to entice non computer hobbyists to buy their computer. The VIC-20 utilised a user-friendly version of BASIC 2.0 allowing for easy programming. The VIC-20 could be attached to any mainstream television to allow for visuals, so it did not require a dedicated monitor. As such, the VIC-20 was an important breakthrough for computers overall as the VIC-20 provided many consumers with their first experience with basic&nbsp;programming. &nbsp;The VIC-20 also had a floppy disk expansion and could be connected to a printer like all computers at the time.<br /> <br /><h2> Reception and Sales</h2>Some critics said the machine was seriously underpowered, and for the most part they were correct. &nbsp;Despite this lack of power the computer sold extremely well, helped in part by advertising campaigns featuring <a href=\"/william-shatner/72-15212/\"> William Shatner</a>.<br /> Other than the extremely affordable price, consumers were attracted to the VIC because of its user-friendly deisgn that didn't require unnecessary input to use. &nbsp;For its ease of use and affordable price the VIC-20 sold over 2.5 million units worldwide.<br /><h2>&nbsp; <br />The End of the System</h2> <div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"397506\"><div class=\"wiki-img-right\"><div class=\"wiki-img-thumb\"><a href=\"http://media.giantbomb.com/uploads/0/9565/397506-commodore64_350px_super.jpg\" title=\"The End of an Era\"><img id=\"397506\" src=\"http://media.giantbomb.com/uploads/0/9565/397506-commodore64_350px_thumb.jpg\" alt=\"The End of an Era\" /></a><div class=\"item-caption\">The End of an Era</div></div></div></div> The VIC-20's lifespan was cut short by the early 1980s. &nbsp;Late 1982 saw the beginning of the end with the announcement of the <a href=\"/commodore-64/60-14/\">        Commodore 64</a>. &nbsp;At first the idea of a new Commodre computer went largely ignored, and it was believed that if the rumors were true it was merely a new version of the VIC. In fact at one point people thought the C64 was actually a codename for a VIC-64. <br /><br />When the rumors were finally confirmed, VIC 20 users and sellers panicked. For the average computer hobbyist hardware upgrading was already a common concept. &nbsp;For the mass market however, the idea that they would have to buy a new computer to replace a recently purchased piece of technology was new and unusual. &nbsp;This panic led many VIC-20 retailers to dramatically drop the price of the computer, which in turn devalued the computer and affirmed Commodore's belief that it was time to drop support for the computer. &nbsp;By 1984 it was obvious that there would not be a place in the Commodore lineup for the venerable VIC-20 and all production for the computer ceased in favor of the C64. <br />&nbsp;<br /><h2>System Specifications&nbsp;&nbsp; <br /></h2><ul class=\"plain-list\"><li><b>CPU</b>: MOS 6502, 1MHz</li><li><b>RAM</b>: 5K (3.5K for the user)</li><li><b>Display</b>: (Screen not included)&nbsp;22 X 23 text,&nbsp;176 X 184, 16 colors max</li><li><b>Ports</b>: composite video,&nbsp;joystick, cartridge, user port,&nbsp;serial peripheral port</li><li><b>Peripherals</b>: cassette recorder,&nbsp;printer, modem,&nbsp;external floppy drive</li><li><b>OS</b>: ROM BASIC</li></ul><br /><h2>Fun Facts</h2>&nbsp;The VIC had different names in different parts of the world: <br /><ul class=\"plain-list\"><li>The German produced VICs were labeled VC-20, which was supposed to be a play on the hugely popular and inexpensive <a href=\"/volkswagen/65-5213/\">   Volkswagen</a> car brand. &nbsp;The VolksComputer was a big hit in Europe.&nbsp; The impetus for changing the name was likely that \"VIC\" spoken the German way is very close to fuck.</li><li>In Japan the VIC-20 was sold as a VIC-1001.</li><li>The Commodore Executive responsible for the VIC's development, Michael Tomczyk, has stated repeatedly that he choose the name simply because he thought it \"sounded good\".</li></ul>","deck":"An 8-bit computer produced by Commodore Electronics Ltd. It was the first microcomputer to sell one million units.","company":{"api_detail_url":"http://api.giantbomb.com/company/1483/","id":1483,"name":"Commodore Electronics Ltd."},"install_base":2500000,"site_detail_url":"http://www.giantbomb.com/vic-20/60-30/","id":30,"api_detail_url":"http://api.giantbomb.com/platform/30/","abbreviation":"VC20","online_support":false,"date_added":"2008-04-01 01:32:54","image":{"icon_url":"http://media.giantbomb.com/uploads/0/3/176108-vic_icon.jpg","medium_url":"http://media.giantbomb.com/uploads/0/3/176108-vic_small.jpg","tiny_url":"http://media.giantbomb.com/uploads/0/3/176108-vic_tiny.jpg","small_url":"http://media.giantbomb.com/uploads/0/3/176108-vic_small.jpg","thumb_url":"http://media.giantbomb.com/uploads/0/3/176108-vic_thumb.jpg","screen_url":"http://media.giantbomb.com/uploads/0/3/176108-vic_screen.jpg","super_url":"http://media.giantbomb.com/uploads/0/3/176108-vic_super.jpg"},"release_date":"1980-05-01 00:00:00","name":"VIC-20"}