{"original_price":0,"date_last_updated":"2012-09-24 09:01:54","description":"<h2>Overview</h2><p>Android is an operating system designed by Google and that can be found on multiple devices. The OS is found on a variety of devices that have different processing power. Most Android phones have the words \"With Google\" written on the back.</p><h2>Android Specific Features</h2><h3>Technical Features</h3><p>Android is an open source OS based on Linux and ARM architecture. The Android was designed with Google specific applications in mind. It usually runs any application or service that associated with Google (Gmail, Google Maps, Google Search, Google Talk, Google Translate, YouTube, etc.). It also possesses functionality for GPSs and accelerometers. Android's current version, 2.3 (Gingerbread) brought improved CPU usage and more user-friendly development tools. Future versions will retain the confectionery/dessert naming motif (Ice Cream Sandwich being the next big release).</p><h3>Homescreen</h3><p>The home screen is extremely customizable. The OS comes originally with 3 screens, although though the numbers of screens can be increased. Much like Apple's iOS, users can put different applications and shortcuts on this screen, however the Android gives more options for customisation. Above and beyond this, the open OS allows for third party developers to release their own home screen replacements to suit the needs of the individual (i.e. SlideScreen or LauncherPro).</p><p>Applications and shortcuts can be placed anywhere on the home screen. The Android introduces Widgets. These windows allow users to browse an app without actually opening it. For example, users can browse status upgrades on Facebook or go directly into Google Search from the home screen. The android also supports moving backgrounds like a moving galaxy or leaves falling that change according to the time of day.</p><h3>Android Market/Google Play</h3><p>Launched in October of 2008, the Android Market is Google's answer to the <a href=\"/apple-inc/65-5815/\">Apple</a>'s App Store. The store features a variety of apps and games (100,000 as of October 2010). There is an app and games category where you can browse for more specific apps or games. Then you are brought to a screen where you may view the top free, top paid and \"just in\". There is also a search feature. 35.6 % of the apps and games cost money.</p><p>To develop an App for the market, you must use App Inventor. Developers make 70% of a profit from the app, while the last 30% go to Google. It should be noted that Google is not as strict as Apple about the quality and content of the apps. Which is why you can find <a href=\"http://www.giantbomb.com/game-boy-advance/60-4/\">Gameboy Advance</a>, <a href=\"http://www.giantbomb.com/snes/60-9/\">SNES</a> and <a href=\"http://www.giantbomb.com/nes/60-21/\">NES</a> emulators on the Market while the C64 app on the App Store has been brought down.</p><p>On March 6, 2012, Google rebranded the Android Market to \"Play Store\" as per their shift of focus to include all of their download services into one concept, Google Play.</p>","deck":"Google's mobile OS is spread across multiple devices.","company":null,"install_base":0,"site_detail_url":"http://www.giantbomb.com/android/60-123/","id":123,"api_detail_url":"http://api.giantbomb.com/platform/123/","abbreviation":"ANDR","online_support":true,"date_added":"2010-08-12 23:20:41","image":{"icon_url":"http://media.giantbomb.com/uploads/0/26/1465136-android_robot_logo_icon.jpg","medium_url":"http://media.giantbomb.com/uploads/0/26/1465136-android_robot_logo_small.jpg","tiny_url":"http://media.giantbomb.com/uploads/0/26/1465136-android_robot_logo_tiny.jpg","small_url":"http://media.giantbomb.com/uploads/0/26/1465136-android_robot_logo_small.jpg","thumb_url":"http://media.giantbomb.com/uploads/0/26/1465136-android_robot_logo_thumb.jpg","screen_url":"http://media.giantbomb.com/uploads/0/26/1465136-android_robot_logo_screen.jpg","super_url":"http://media.giantbomb.com/uploads/0/26/1465136-android_robot_logo_super.jpg"},"release_date":"2008-09-21 00:00:00","name":"Android"}