{"original_price":599,"date_last_updated":"2012-09-25 11:08:01","description":"<h2>Overview</h2><p>The PlayStation 3 (PS3) was officially unveiled at <a href=\"../../sony-computer-entertainment-america/65-313/\" rel=\"nofollow\">Sony Computer Entertainment America's</a> Electronic Entertainment Expo press conference on May 16, 2005. When it was initially announced, Sony stated that it would be part of a longer cycle for consoles, stating that it would be part of a ten year cycle.</p><p>Sony initially announced two hardware configurations for the PlayStation 3: The 60GB and the 20GB, though the 40GB, 80GB, 120GB, 160GB, 250GB and 320GB configurations have been released since then. The PS3 was announced for a simultaneous worldwide release with a launch date of November 11, 2006 for Japan and November 17, 2006 for the United States and Europe. But due to a shortage of the blue laser diodes used for the Blu-ray Disc drive, the European launch was subsequently delayed to March 23, 2007.</p><p>The PS3 uses the Cell Broadband Engine co-developed by Sony, IBM, and Toshiba. Graphics processing is handled by the NVIDIA RSX 'Reality Synthesizer', which can output resolutions up to 1080p HD. The PS3 has 256 MB of XDR main memory and 256 MB of GDDR3 video memory for the RSX, for a total of 512 MB system memory.</p><p>Since its launch, the PS3 has a worldwide install base that has passed over 62 million (as of April 03, 2012;).</p><h2>Launch</h2><p>The system was released in North America on November 17th, 2006 (November 11th in Japan, March 23rd in Europe). The launch of the PlayStation 3 proved to be a rather difficult one for many reasons. One was the high price point for the console; $599 for the 60GB model in the US. Another was the launch line-up and the infamous E3 2006 press conference which failed to impress gamers, and instead started many internet memes, like <a href=\"../../giant-enemy-crab/92-747/\" rel=\"nofollow\">Giant enemy crab</a> and <a href=\"../../massive-damage/92-3351/\" rel=\"nofollow\">Massive damage</a>. Finally, the marketing campaign \"Play B3yond\" was negatively received for its approach and weirdness, mostly concerning a TV spot featuring a plastic baby, laughing and finally crying watching a PS3. The North American launch line-up was the following:</p><ul><li><a href=\"../../call-of-duty-3/61-7524/\" rel=\"nofollow\">Call of Duty 3</a></li><li><a href=\"../../genji-days-of-the-blade/61-15569/\" rel=\"nofollow\">Genji: Days of the Blade</a></li><li><a href=\"../../madden-nfl-07/61-16585/\" rel=\"nofollow\">Madden NFL 07</a></li><li><a href=\"../../marvel-ultimate-alliance/61-7527/\" rel=\"nofollow\">Marvel: Ultimate Alliance</a></li><li><a href=\"../../mobile-suit-gundam-crossfire/61-22513/\" rel=\"nofollow\">Mobile Suit Gundam: Crossfire</a></li><li><a href=\"../../nba-2k7/61-9829/\" rel=\"nofollow\">NBA 2K7</a></li><li><a href=\"../../nba-07/61-3557/\" rel=\"nofollow\">NBA 07</a></li><li><a href=\"../../need-for-speed-carbon/61-8844/\" rel=\"nofollow\">Need for Speed: Carbon</a></li><li><a href=\"../../nhl-2k7/61-21700/\" rel=\"nofollow\">NHL 2K7</a></li><li><a href=\"../../resistance-fall-of-man/61-9741/\" rel=\"nofollow\">Resistance: Fall of Man</a></li><li><a href=\"../../ridge-racer-7/61-1101/\" rel=\"nofollow\">Ridge Racer 7</a></li><li><a href=\"../../tiger-woods-pga-tour-07/61-67/\" rel=\"nofollow\">Tiger Woods PGA Tour 07</a></li><li><a href=\"../../tony-hawks-project-8/61-12077/\" rel=\"nofollow\">Tony Hawk's Project 8</a></li><li><a href=\"../../untold-legends-dark-kingdom/61-13294/\" rel=\"nofollow\">Untold Legends: Dark Kingdom</a></li></ul><h2>Hardware Configurations</h2><h3>20 GB Model (discontinued)</h3><div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"820249\"><div class=\"wiki-img-right\"><div class=\"wiki-img-thumb\"><a href=\"http://media.giantbomb.com/uploads/1/15547/820249-playstation_3_super.png\" title=\"The Original PlayStation 3 ( non 20gb model)\"><img id=\"820249\" src=\"http://media.giantbomb.com/uploads/1/15547/820249-playstation_3_thumb.png\" alt=\"The Original PlayStation 3 ( non 20gb model)\" /></a><div class=\"item-caption\">The Original PlayStation 3 ( non 20gb model)</div></div></div></div><p>The 20 GB was available at launch in Japan on November 11th 2006, in North America on November 17th 2006.The 20 GB PS3 has a slot loading 2x speed Blu-ray Disc drive that plays Blu-ray movies, DVDs, CDs, and SACDs. It has built-in Bluetooth 2.0, a Gigabit Ethernet port, 4 USB 2.0 ports, and HDMI 1.3a. The 20GB PS3 also has backwards compatibility with PlayStation 1 &amp; 2 titles through hardware emulation. The 20GB PS3 had an MSRP of $499.99 USD. It was discontinued on April 11th, 2007 due to poor sales compared to the 60 GB.</p><h3>60 GB Model (discontinued)</h3><p>The 60GB PS3 was launched in Japan on November 11th 2006, then in North America on November 17th 2006. It has all of the features of the 20GB model plus 802.11b/g Wi-Fi, a multiple flash card reader, and a chrome finish. The original MSRP was $599.99. It was discontinued on July 13th, 2007.</p><h3><b>60 GB Model PAL (discontinued)</b></h3><p>The PS3 launched with a 60 GB model in Europe on March 23rd 2007. An important difference between the European and American 60 GB model was the backwards compatibility. Unlike the American version, PlayStation 2 backwards compatibility was carried out via hardware and software emulation, foreshadowing the eventual 80GB model. The RRP of this model was €599.</p><h3><b>80 GB Model (PS2 backwards compatible, discontinued)</b></h3><p><b>In</b> August 2007, Sony released an 80 GB model of the PS3 in the US, which included backwards compatibility. This was enabled by using software emulation to emulate PS2 games. Because, it was software based, it only allowed for ~60% of PS2 titles to be played with no issues.</p><h3>40 GB Model (discontinued)</h3><p>The 40 GB PS3 was launched in Europe/Australia in October 2007 and North America/Japan in November 2007. The 40 GB model had the multiple flash card reader and SACD supported removed, and is not backwards compatible with PlayStation 2 titles but is still compatible with original PlayStation titles. The 40 GB PS3 had a MSRP of $399.99. For a limited time only, Spider-Man 3 was packaged along with the 40 GB model.</p><h3>80 GB Model (discontinued)</h3><p>Another 80 GB PS3 was launched in August 2008 in North American and Japan in October 2008. It sports all of the features of the 40 GB model and has an MSRP of $399.99 . At Sony's Gamescom 2009 keynote, Kaz Harai announced that the standard PS3 pricepoint is to be reduced by $100 to $299.99 as of August 19, which at the time applied to both this and the 160 GB model.</p><h3>160 GB Model (discontinued)</h3><p>The 160 GB PS3 was announced at the Leipzig Games Convention in August 2008. The model will be coming to North America in November as part of a bundle which includes <a href=\"../../uncharted-drakes-fortune/61-13992/\" rel=\"nofollow\">Uncharted: Drake's Fortune</a>, a voucher for a free download of <a href=\"../../pain/61-18059/\" rel=\"nofollow\">PAIN</a> and a DualShock 3 for $499.99. This model will be released in Europe on October 31 for the cost of €499 RRP ($628) but will be packed with €70 ($88) worth of additional DLC.</p><h3>E3 Model (never released)</h3><p>Interestingly enough, the original model shown off at the Electronic Expo in 2005 boasted a couple of different features. The original planned configuration was to have at least 2 HDMI ports and up to 6 USB ports (2 ports on the back). This was later cut down to four for the launch and the HDMI ports cut down to one, with the reasoning being that there was actually no need for so many ports. It was shown in three different colors; white, silver, and piano black, but only black was available for launch. It was also sporting the now infamous boomerang controller, but that design was scrapped in favor of the more traditional DualShock design.</p><h3>Slim 120 GB Model (discontinued)</h3><div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"1109735\"><div class=\"wiki-img-right\"><div class=\"wiki-img-thumb\"><a href=\"http://media.giantbomb.com/uploads/0/4941/1109735-ps311_super.jpg\" title=\"The PlayStation 3 Slim\"><img id=\"1109735\" src=\"http://media.giantbomb.com/uploads/0/4941/1109735-ps311_thumb.jpg\" alt=\"The PlayStation 3 Slim\" /></a><div class=\"item-caption\">The PlayStation 3 Slim</div></div></div></div><p>The Slim 120 GB model of the PS3 was announced at Gamescom 2009 by Kaz Harai at Sony's keynote on August 18. The new model is 33% smaller and 36% lighter, and consumes 34% less power. The Slim shares mostly the same features as the most recent SKU's. The one notable exception, however, is that the ability to install a second operating system was removed. Also, there was a stand introduced to support it when vertically oriented, similar to the PS2 Slim, though it has been shown to be unnecessary. This model was released on September 1, 2009 at an MSRP of $299.99 in the U.S., £249.99 in the U.K. and €299.99 in the rest of Europe.</p><h3>Slim 250 GB Model (discontinued)</h3><p>This is identical to the 120 GB model except for hard drive capacity, and it retailed for $349.99 when released on November 3, 2009 in the U.S. There was also a white <a href=\"../../final-fantasy-xiii/61-20664/\" rel=\"nofollow\">Final Fantasy XIII</a> bundle in Japan released on December 17.</p><h3>Slim 160 GB Model</h3><p>This is identical to the 120 GB model except for hard drive capacity, and it retailed for $299.99 when released in August 2010 in the U.S.</p><h3>Slim 320 GB Model</h3><p>This is identical to the 120 GB model except for hard drive capacity, and it retailed for $349.99 when released on September 19, 2010 in the U.S. This system also comes as a PlayStation Move bundle, including the game <a href=\"/sports-champions/61-30349/\">Sports Champions</a>.</p><h3>\"Super Slim\" 250GB Model</h3><div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"2327427\"><div class=\"wiki-img-right\"><div class=\"wiki-img-thumb\"><a href=\"http://media.giantbomb.com/uploads/5/56686/2327427-ps3_ss.jpg\" title='PS3 \"Super Slim\"'><img id=\"2327427\" src=\"http://media.giantbomb.com/uploads/5/56686/2327427-ps3_ss_thumb.jpg\" alt='PS3 \"Super Slim\"' /></a><div class=\"item-caption\">PS3 \"Super Slim\"</div></div></div></div><p>Announced at <a href=\"/tokyo-game-show-2012/92-7504/\">TGS 2012</a> and released on September 25 in North America, the PS3 \"Super Slim\" is the 3rd and most likely final version of the PS3. it's less than half the size and weight of the original PS3 and 20 percent less volume and 25 percent less weight of the Slim PS3. It includes a 250GB hard drive and retails for $269 USD. For a limited time, <a href=\"http://www.giantbomb.com/uncharted-3-drakes-deception/61-32982/\">Uncharted 3</a> game of the year edition and a $30 voucher <a href=\"http://www.giantbomb.com/dust-514/61-27863/\">Dust 514</a> will be included in the package.</p><h3>\"Super Slim\" 500GB Model</h3><p>The \"Super Slim\" 500GB model is exactly the same as the 250GB model, except it has double the hard drive space. It retails for $299 USD and was released in October in North America. For a limited time, <a href=\"/assassins-creed-iii/61-37494/\">Assassins Creed III</a> will be included in the package.</p><h2>Developer Relations</h2><h3>Developer Kits</h3><p>The developer kits originally cost $20,000 each, and they were cut down to $10,000 sometime in 2008. Now the PS3 developer kit has been price cut again to $2,000, a drop of 80%.</p><h3>Sony Pub Fund</h3><p>At GDC '09, Sony announced a new initiative for <a href=\"../../playstation-network/60-88/\" rel=\"nofollow\">PlayStation Network</a> titles allowing developers to self-publish games on the platform. If you make a downloadable game exclusively for PSN, Sony will guarantee royalties by reimbursing development costs as well as supplying support for game design and marketing. They also insist that the developer will still retain control of the intellectual property and set pricing. <a href=\"../../burn-zombie-burn/61-24253/\" rel=\"nofollow\">Burn Zombie, Burn</a>, was the first title released on PSN under this initiative.</p><h2>Accessories</h2><div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"907860\"><div class=\"wiki-img-right\"><div class=\"wiki-img-thumb\"><a href=\"http://media.giantbomb.com/uploads/1/10023/907860-editboomerang_super.jpg\" title=\"What could have been\"><img id=\"907860\" src=\"http://media.giantbomb.com/uploads/1/10023/907860-editboomerang_thumb.jpg\" alt=\"What could have been\" /></a><div class=\"item-caption\">What could have been</div></div></div></div><p>The PlayStation 3 currently has many different first and third party accessories.</p><h3>Sixaxis Controller</h3><p>Sony first launched the PS3 with the <a href=\"../../sixaxis-controller/59-9/\" rel=\"nofollow\">Sixaxis</a>. It charges its built-in lithium ion battery via USB cable and has a battery life of roughly thirty hours fully charged. It connects to the system via Bluetooth and lacks any sort of rumble function. Originally, Sony's reason for this was that they found the motion control functions of the controller to be more immersive than the rumble function and they were technically unable to combine them at the time. Although it is more likely due to the lawsuit from Immersion. The two games that were used to demonstrate the motion capabilities of the system were <a href=\"../../lair/61-9387/\" rel=\"nofollow\">Lair</a> and <a href=\"../../warhawk/61-20458/\" rel=\"nofollow\">Warhawk</a>.</p><h3>DualShock 3</h3><div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"846159\"><div class=\"wiki-img-right\"><div class=\"wiki-img-thumb\"><a href=\"http://media.giantbomb.com/uploads/1/10023/846159-309638_dualshock_3_super_super.jpg\" title=\"DualShock 3\"><img id=\"846159\" src=\"http://media.giantbomb.com/uploads/1/10023/846159-309638_dualshock_3_super_thumb.jpg\" alt=\"DualShock 3\" /></a><div class=\"item-caption\">DualShock 3</div></div></div></div><p>At its press conference at the 2007 Tokyo Game Show, Sony announced the <a href=\"../../dualshock-3/59-29/\" rel=\"nofollow\">DualShock 3</a> because despite Sony's original belief that the controller didn't need rumble, the fans asked. This was a PlayStation 3 controller with the same function and design as the Sixaxis, but with the vibration capability included. It has a lithium ion battery as well with a battery life of roughly 25 hours, and it charges via USB. Similarly to the Sixaxis, this controller connects to the PlayStation system via Bluetooth. Because of the added functionality of the rumble, the controller weighs more then it's older brother.</p><h3>Official PlayStation Bluetooth Headset</h3><h3><b>The official Sony PS3 headset</b></h3><div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"870952\"><div class=\"wiki-img-right\"><div class=\"wiki-img-thumb\"><a href=\"http://media.giantbomb.com/uploads/0/7025/870952-sony_playstation_3_bluetooth_headset_super.jpg\" title=\"\"><img id=\"870952\" src=\"http://media.giantbomb.com/uploads/0/7025/870952-sony_playstation_3_bluetooth_headset_thumb.jpg\" alt=\"\" /></a><div class=\"item-caption\"></div></div></div></div><p>This headset is compatible with cellphones and the PS3. After firmware update 2.50, it supports a visual volume level cue, along with the current battery charge. It comes with a USB docking station used for charging the headset. It can be paired via Bluetooth or USB cable. The headset launched bundled with <a href=\"../../socom-us-navy-seals-confrontation/61-20676/\" rel=\"nofollow\">SOCOM: Confrontation</a>. However, it can also be purchased separately for an MSRP $49.99.</p><p>A new version of the headset was released in November 2010. The new features include a smaller and lighter package, noise cancellation, better device compatibility and better transmit and receive sound.</p><h3>Bluetooth Remote</h3><p>For those who do not like using the Sixaxis or DualShock controllers while watching their movies can use the standalone Bluetooth remote released by Sony. It has all the functionality of the regular controllers minus the ability to use it while playing a game, and is in a regular controller form.</p><h3>PlayStation Eye</h3><p>The <a href=\"../../playstation-eye/59-24/\" rel=\"nofollow\">PlayStation Eye</a> is the successor to the EyeToy, and is a camera with a built-in microphone array. This accessory was originally packaged with the game <a href=\"../../the-eye-of-judgment/61-16019/\" rel=\"nofollow\">The Eye of Judgement</a>. In addition to simply capturing video and audio, it can also be used for <a href=\"../../motion-control/92-474/\" rel=\"nofollow\">motion control</a>.</p><h3>Wireless Keypad</h3><div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"870994\"><div class=\"wiki-img-right\"><div class=\"wiki-img-thumb\"><a href=\"http://media.giantbomb.com/uploads/0/7025/870994-ps3_wireless_keypad_01_super.jpg\" title=\"Keypad attached to the controller\"><img id=\"870994\" src=\"http://media.giantbomb.com/uploads/0/7025/870994-ps3_wireless_keypad_01_thumb.jpg\" alt=\"Keypad attached to the controller\" /></a><div class=\"item-caption\">Keypad attached to the controller</div></div></div></div><p>A wireless keypad was added as an accessory in December 2008. It is designed for faster text messaging and PS3 compatibility. It is a separate Bluetooth device, with its own battery and it connects to the and sticks over the top side of the DualShock 3 controller. It comes with certain preset buttons for friends list and with a touchpad for \"quicker and better\" internet browsing. Response to the keypad has been mixed, with some complaints due to its small buttons with no back light and dodgy touchpad.</p><h3>AC Adapter</h3><div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"1182475\"><div class=\"wiki-img-right\"><div class=\"wiki-img-thumb\"><a href=\"http://media.giantbomb.com/uploads/5/56686/1182475-newcharger_super.jpg\" title=\"Sony PlayStation AC Adapter\"><img id=\"1182475\" src=\"http://media.giantbomb.com/uploads/5/56686/1182475-newcharger_thumb.jpg\" alt=\"Sony PlayStation AC Adapter\" /></a><div class=\"item-caption\">Sony PlayStation AC Adapter</div></div></div></div><p>The PlayStation AC Adapter is a USB based charger that plugs into an ordinary wall outlet. It's designed to charge the Sixaxis controller, the DualShock 3 controller, the Bluetooth headset and the wireless keypad, all without the need to turn on your PlayStation. You can also charge your controller while playing your PlayStation, something you can't do with some other aftermarket controller charging docks. It will also charge the PSP-2000 and PSP-3000. The AC adapter retails in the United States for $24.99 and the United Kingdom for £19.99.</p><h3>PS3 sound bar</h3><div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"1794741\"><div class=\"wiki-img-right\"><div class=\"wiki-img-thumb\"><a href=\"http://media.giantbomb.com/uploads/5/56686/1794741-5076290973_37d42947f5_b_super.jpg\" title=\"\"><img id=\"1794741\" src=\"http://media.giantbomb.com/uploads/5/56686/1794741-5076290973_37d42947f5_b_thumb.jpg\" alt=\"\" /></a><div class=\"item-caption\"></div></div></div></div><p>Released in October, 2010, with a MSRP of $179.99, the official PS3 sound bar is a 2.1 channel audio device that mimics surround sound systems. The system has 2 sound settings \"Dynamic\" and \"Night\". The night setting attempts to enhance key sounds when the volume is low.</p><h3>Play Television TV Tuner</h3><p>A TV tuner accessory which connects to the PlayStation 3 and allows the system to be used like a DVR, and record your favorite TV shows directly onto the PlayStation hard drive. This accessory is currently only available in Europe.</p><h3>PlayStation Move</h3><div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"1296680\"><div class=\"wiki-img-right\"><div class=\"wiki-img-thumb\"><a href=\"http://media.giantbomb.com/uploads/2/27224/1296680-ps_move_official_09_super.jpg\" title=\"PlayStation Move\"><img id=\"1296680\" src=\"http://media.giantbomb.com/uploads/2/27224/1296680-ps_move_official_09_thumb.jpg\" alt=\"PlayStation Move\" /></a><div class=\"item-caption\">PlayStation Move</div></div></div></div><p>At E3 2009, Sony introduced the unnamed motion controller to the mass market via a few impressive tech demos. The wand has a colored orb on top that is tracked by the PlayStation Eye and sensors within, which combine to allow true one-to-one tracking. At Sony's 2010 GDC keynote, it was announced that the official name would be the <a href=\"../../playstation-move/59-36/\" rel=\"nofollow\">PlayStation Move</a>. A sub-controller was also revealed, dubbed the \"Navigation Controller.\" The navigation controller has no sensors, so a DualShock controller can be used as a substitute for the navigation controller if the user is prepared to deal with the slightly uncomfortable grip one must use to operate the DualShock in conjunction with the wand controller.</p><h3>Wireless PS3 Stereo Headset</h3><div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"1794742\"><div class=\"wiki-img-right\"><div class=\"wiki-img-thumb\"><a href=\"http://media.giantbomb.com/uploads/5/56686/1794742-5763459370_a4680418b1_b_super.jpg\" title=\"\"><img id=\"1794742\" src=\"http://media.giantbomb.com/uploads/5/56686/1794742-5763459370_a4680418b1_b_thumb.jpg\" alt=\"\" /></a><div class=\"item-caption\"></div></div></div></div><p>Planned for release in September 2011, with a MSRP of $99.99. It's an alternative option to the PS3 sound bar above. It's a 2 channel system, but simulates 7.1 channel audio. It also has a built in mic for online chat.</p><h2>PlayStation Network</h2><p>The <a href=\"../../playstation-network/60-88/\" rel=\"nofollow\">PlayStation Network</a>, or PSN, is Sony's free online service which allows PS3 and PSP owners to communicate with each other, play games, compare trophies, and download content from the PlayStation Store. As well as giving access to the interactive lobby and game launching system, <a href=\"../../playstation-home/61-22581/\" rel=\"nofollow\">PlayStation Home</a>. Recently, the ability to display your Trophy collections on internet forums was added through the official <a href=\"http://www.us.playstation.com/\" rel=\"nofollow\">PlayStation web site</a>. To get this new feature, you sign in with your PSN ID, under the network tab and then it syncs to you PS3 and downloads all the information. From there, you choose your favorite game, your mood, as well as leave a little comment, and then you can post it on any forum as a signature.</p><h2>Significant Firmware Updates</h2><div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"820250\"><div class=\"wiki-img-right\"><div class=\"wiki-img-thumb\"><a href=\"http://media.giantbomb.com/uploads/1/15547/820250-ps3_menu_super.jpg\" title=\"The PlayStation 3 XMB\"><img id=\"820250\" src=\"http://media.giantbomb.com/uploads/1/15547/820250-ps3_menu_thumb.jpg\" alt=\"The PlayStation 3 XMB\" /></a><div class=\"item-caption\">The PlayStation 3 XMB</div></div></div></div><p><b>Firmware 1.60</b>, released in May 22, 2007, added the Folding@Home client. It also added background downloading feature (ability to download while doing something else). It also added an on-screen QWERTY keyboard available for use through the XMB.</p><p><b>Firmware 1.70</b>, released in April 19, 2007, allowed the same saved game data to be shared on the PS3 and the PSP on PS One original games.</p><p><b>Firmware 1.80</b>, released in May 24, 2007, added the ability to play remotely through the internet. Also new photo editing features were added, which allowed cropping and zooming. Normal DVDs became upscaleable to 1080p, and Blu-rays were able to downscale to 720p. Finally, PS1 and PS2 backward compatibility was greatly improved and allowed for better upscaling and anti-aliasing in most games.</p><p><b>Firmware 1.90</b>, released in July 24, 2007, added wallpaper support for the XMB. Also the ability to eject a game using the controller was added. As a final feature keyboard support for the browser was added.</p><p><b>Firmware 2.00</b>, released November 8, 2007, added many new features. First of all, the ability to change themes and icons in the PS3 was added. Remote Start (or booting up the ps3 from a PSP) support was added as well. Canon printer support as well as playlist support for both music and photos were introduced. This was also the firmware that introduced a Vibration option when you press the ps3 button for the DualShock 3. Viewing video while it is being downloaded was also added, as well as voice and video chatting through the PlayStation Eye.</p><p><b>Firmware 2.10</b>, released December 18, 2007, added Blu-ray 1.1 support. This feature allowed the PS3 to support the Picture-in-Picture feature used in many newer disc releases.</p><p><b>Firmware 2.20</b>, released March 25, 2008, added Blu-ray 2.0 support, which allows the PS3 to support Blu-ray discs that can download extended features online. Basically, it is a downloadable content feature for movies.</p><p><b>Firmware 2.30</b>, released April 15, 2008, updated the PSN store with a new interface.</p><p><b>Firmware 2.40</b>, released July 2, 2008, added the in-game XMB function, which allowed the ability to check emails and settings without having to exit your game. Another significant feature added with this update was <a href=\"http://www.giantbomb.com/playstation-trophies/92-198/\" rel=\"nofollow\">PlayStation Trophies</a>, which were a greatly requested feature. There was some buzz about this firmware causing problems for certain console owners, so it was taken down, and only a short while later, a revised version, <b>Firmware 2.41</b>, was released on July 8th 2008.</p><p><b>Firmware 2.50</b>, released October 15, 2008, added automatic shut down for the PS3 system and the controllers. It also added support for the official Sony Bluetooth headset which allows high quality voice chat and displays current volume level and battery. More features were also added to trophies, and a percentage was added to the user level.</p><p><b>Firmware 2.60</b> released January 21, 2009, added video playback of files encoded with version 3.11 of DivX. New feature under photo gallery has been added as well.</p><p>F<b>irmware 2.70</b>, released April 1, 2009, brought a new Text Chat feature that enables players to communicate online with their PlayStation Network friends. They were now able to chat with up to 15 online friends using the Wireless Keypad, on-screen keyboard, or other compatible keyboard peripherals. They could also access Text Chat while playing PS3 games and even participate in up to three chat rooms at once. Additional changes:</p><p><b>Friends list on the XMB (XrossMediaBar)</b></p><ul><li>Sort your friends via their online status</li><li>Attach larger files to the messages you send to your friends (file size will increase from 1MB to 3MB)</li></ul><p><b>Video delivery service on PlayStation Store</b></p><ul><li>Video files you’ve purchased from the PlayStation Store can be backed up to an external storage device and then restored to PS3’s internal hard drive for playback – so you can clear up space on your hard drive and then restore the video anytime in the future</li><li>Videos you’ve purchased for PSP system can now be transferred to PS3 for playback</li></ul><p>F<b>irmware 2.80</b>, released July 20, 2009, increased the maximum limit of characters in Text Chat from 32 to 64 per line and wireless controllers got prioritized assignment over peripherals.</p><p><b>Firmware 3.00</b> was announced on August 18, 2009 at Sony's Gamescom conference and released on September 1, 2009. The major changes in this update are:</p><div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"1113059\"><div class=\"wiki-img-right\"><div class=\"wiki-img-screen\"><a href=\"http://media.giantbomb.com/uploads/0/9246/1113059-untitled_1_super.jpg\" title='\"What&squot;s New\" (middle) and \"Status Indicator\" (top right)'><img id=\"1113059\" src=\"http://media.giantbomb.com/uploads/0/9246/1113059-untitled_1_screen.jpg\" alt='\"What&squot;s New\" (middle) and \"Status Indicator\" (top right)' /></a><div class=\"item-caption\">\"What&#39;s New\" (middle) and \"Status Indicator\" (top right)</div></div></div></div><ul><li><strong>“What’s New”</strong> – The “Information Board” will be replaced with a “What’s New” section, which presents you with interactive PlayStation news every time you start the PS3 system. Located under the PlayStation Network icon, “What’s New” displays the latest and greatest game, video, PlayStation Network and PlayStation news and releases, as well as your recently played games.</li><li><strong>Status Indicator</strong> – In the top right corner, they’ve added an indicator bar, which displays your user icon, friend icon, the number of friends you have online and a small message icon to let you know if you have any new messages. The indicator also includes a scrolling ticker that features the latest news from PlayStation Network. In addition, when you press the PS button, the battery life indicator will no longer cover up the clock.</li><li><strong>Friends List</strong> – Your PSN friends will appear in a slightly redesigned format on your Friends List. Also, messages will now be viewable from each of your friends’ respective profiles.</li><li><strong>PlayStation Store Shortcuts</strong> – They’ve added a shortcut icon to the PlayStation Store under both the Game and Video categories so you can access the latest content without navigating to the PSN category.</li><li><strong>Personalization</strong> – Dynamic themes as well as free and premium avatars will be available through PlayStation Store. Dynamic themes are animated, often using looping animations to create movement, with some including transitions to other scenes.</li><li><strong>Trophies</strong> – Gives game developers the ability to modify how they display trophies for add-on content. Base and add-on game trophies continue to be combined into a single list so you can see where you stand in a game as a whole. Within that list, trophies are broken out into subcategories—base trophies and add-on trophies—allowing the player to differentiate progress in base and add-on trophies.</li></ul><p><b>Firmware 3.10</b>, released November 19, 2009, added Facebook integration including : trophy notification, PlayStation store purchase notification and special in-game notifications. Coloring has been added to the user personal profile which is reflected on the Friends List backdrop. The photo menu in the XMB has been modified to allow pictures to be viewed in a grid allowing for easier access and viewing.</p><p><b>Firmware 3.21</b>, released April 1, 2010, was a controversial update because Sony decided to remove the \"Install Other OS\" option on fat PS3s (the slim ones already shipped without the feature installed).</p><p>The reason for this was due to security concerns. Sony was afraid that people would begin to pirate PS3 games after a breakthrough was made possible through the use of Linux as a secondary OS in the systems.</p><p><b>Firmware 3.30</b>, released April 22, 2010, includes support for future stereoscopic 3D games and multiple ways to list your trophies and compare them with friends. It also includes Bitstream (Direct) and Bitstream (Mix) as options under Video settings.</p><p><b>Firmware 3.40</b>, released June 28, 2010, added a number of new features:</p><ul><li>Support for the new \"PlayStation Plus\" subscription program.</li><li>A new network based photo sharing feature in Photo Gallery that allows you to upload, browse, and comment on photos on Facebook and Picasa.</li><li>A new video editor program, which lets you to record and edit video files on the PS3, and upload them to websites like Facebook and YouTube.</li><li>Users can now rate the PlayStation Store content they have purchased with a five star rating system.</li></ul><p><b>Firmware 3.50</b>, released September 21, 2010, added the ability to play Blu-ray 3D discs.</p><p><b>Firmware 3.56</b>, released January 26, 2011, prevented users from running most homebrew software.</p><p><b>Firmware 3.61</b>, released May 15, 2011, after the infamous PlayStation Network outage. It forced users to change their PlayStation Network account password to help prevent further hacks.</p><p><b>Firmware 3.70</b>, released August 10, 2011, allowed for viewing of 3D photos on 3D-enabled televisions.</p><p><b>Firmware 3.72</b>, released September 20, 2011, improved security</p><p><b>Firmware 4.00</b>, released November 30, 2011, added support for <a href=\"/playstation-vita/60-129/\">PlayStation Vita</a>.</p><p><b>Firmware 4.10</b>, released February 8, 2012, added HTML 5 support in the web browser. It also added an automatic setting to the date and time setting menu. Finally, PSN accounts were now officially renamed as Sony Entertainment Network accounts.</p><h3>Upcoming Features</h3><p>Sony has created a webpage that allows people to propose and recommend new features to be added to the PS3 and have them voted on by their peers at <a href=\"http://share.blog.us.playstation.com/\" rel=\"nofollow\">PlayStation.Blog Share</a>.</p>","deck":"The PlayStation 3 (often abbreviated PS3) is the third home video game console created and released by Sony Computer Entertainment Inc.","company":{"api_detail_url":"http://api.giantbomb.com/company/995/","id":995,"name":"Sony Computer Entertainment Incorporated"},"install_base":63900000,"site_detail_url":"http://www.giantbomb.com/playstation-3/60-35/","id":35,"api_detail_url":"http://api.giantbomb.com/platform/35/","abbreviation":"PS3","online_support":true,"date_added":"2008-04-01 01:33:02","image":{"icon_url":"http://media.giantbomb.com/uploads/5/56686/2327427-ps3_ss_icon.jpg","medium_url":"http://media.giantbomb.com/uploads/5/56686/2327427-ps3_ss_small.jpg","tiny_url":"http://media.giantbomb.com/uploads/5/56686/2327427-ps3_ss_tiny.jpg","small_url":"http://media.giantbomb.com/uploads/5/56686/2327427-ps3_ss_small.jpg","thumb_url":"http://media.giantbomb.com/uploads/5/56686/2327427-ps3_ss_thumb.jpg","screen_url":"http://media.giantbomb.com/uploads/5/56686/2327427-ps3_ss_screen.jpg","super_url":"http://media.giantbomb.com/uploads/5/56686/2327427-ps3_ss_super.jpg"},"release_date":"2006-11-11 00:00:00","name":"PlayStation 3"}