{"original_price":249,"date_last_updated":"2012-09-18 13:41:15","description":"<h2>Overview</h2>The <a href=\"http://www.giantbomb.com/sinclair-research-ltd/65-938/\"> Sinclair</a> ZX Spectrum was the successor to the ZX 81 released in the <a href=\"http://www.giantbomb.com/united-kingdom/95-492/\"> UK</a> by Sinclair Research Ltd. in 1982. Affectionately regarded as the \"Speccy,\" the Spectrum was Sinclair's first computer capable of color output, and is widely recognized for its complex 40-key rubber keyboard.&nbsp; The ZX Spectrum was particularly successful in the UK, and was one of the most popular personal computer throughout Europe in the 1980s.&nbsp; The popularity of the Spectrum in Europe can be compared to that of the <a href=\"http://www.giantbomb.com/commodore-64/60-14/\"> Commodore 64</a> in <a href=\"http://www.giantbomb.com/north-america/95-1664/\"> North America</a> as it was made to be the cheapest available color computer at the time.&nbsp; It was a well supported platform with a variety of companies developing software for it, including many games. There were eight models of the Spectrum produced between 1982 and 1987, and the recognizable computer spawned a good deal of clones and imitators.&nbsp; <br /><br /> <h2>Technical Specifications</h2> <ul class=\"plain-list\"> <li><em>CPU</em> - Zilog Z80A 3.5 MHz processor</li> <li><em>Memory</em> - 16 Kb / 48 Kb / 128 Kb</li> <li><em>Video</em> - 256 x 192 resolution, 15 colors (7 shades bright mode for each black), each 8 x 8 pixel square limited to a max of 2 colors.</li> <li><em>Audio</em> - 16K / 48K models have 1 channel with 1-bit sound using a 10-octave built-in beepe.&nbsp; 128K model has 3 channels of 4-bit sound using an AY-3-8912 sound chip.&nbsp; Some 48k models use the AY chip.</li> <li><em>Media</em> - Cassette tapes via the cassette recorder peripheral</li> <li><em>Built-in Language </em>- Sinclair Basic</li> <li><em>Keyboard</em> - QWERTY layout with 40 rubber keys.&nbsp; Keys have up to 6 functions each.</li> <li><em>Size/Weight</em> - 23 x 14.4 x 3 cm / 550g</li> <li><em>IO Ports</em> - Expansion port, RF video out</li> <li><em>Power Supply</em> - External PSU, 9v DC, 1.4A</li></ul><br /> <h2>Models</h2> <h3>ZX Spectrum 16K</h3>The 16K model was the entry level model manufactured by <a href=\"http://www.giantbomb.com/sinclair-research-ltd/65-938/\"> Sinclair</a> in 1982. It launched alongside the 48K model and was very similar except for the memory difference. The original ZX Spectrum is very widely recognized for its signature rubber keyboard and rainbow flair in the corner of the device. It was small, easy to use and cheap. The 16K model launched at £125 and later dropped to £99. A 32K RAM upgrade was available for 16K users to upgrade their systems to 48K. Users could mail in their systems and they'd have their Spectrums fitted with a 32K daughterboard that made it essentially identical to the 48K model. An interesting note is that to save money on these RAM expansions, Sinclair used defective 64K chips with only 32K RAm actually working or available. Third parties released 32K RAM expansion packs that plugged into the expansion port as well.<br /><br />The <a href=\"http://www.giantbomb.com/keyboard/93-2361/\"> keyboard</a> of the computer is considered to be terrible for typists. The rubber keys are mushy, and the fact that keys can have up to 6 functions each means that even typing basic commands requires extensive use of the function keys.&nbsp; The 256x192 resolution of the computer was above average for its time, and the choice of 8 colors (15 including \"BRIGHT\" colors) set it apart from the competition.&nbsp; The downside to the Spectrum's color was that only two colors could be in a single 8x8px square.&nbsp; This caused a problem called <em>attribute clash (also known as color clash)</em> which required creative graphic design to circumvent.<br /><br /> <h3>ZX Spectrum 48K</h3>The 48K model launched alongside the 16K model in 1982 and retailed for £175.&nbsp; The price was later reduced to £129.&nbsp; The 48K model is virtually the same as the 16K model, with the obvious exception being the upgraded RAM.<br /><br /> <h3>ZX Spectrum </h3>In 1984, two years after the release of the original Spectrum, Sinclair released the upgraded ZX Spectrum.&nbsp; The ZX Spectrum was a 48K Spectrum in a Sinclair-QL style case (another computer launched in 1984). The most important change with the Spectrum &nbsp;was the introduction of a \"professional keyboard\" which had injection-molded plastic keys rather than rubber ones.&nbsp; The keys still rested on a rubber membrane and while it improved upon the original design, many users did not find it completely satisfactory.<br /><br />The ZX Spectrum &nbsp;retailed for £179.95 and a do-it-yourself upgrade kit was released for £50, which allowed a user to upgrade any rubber-keyed Spectrum with plastic keys. The price was cut to £129.95 with the release of the Spectrum 128.&nbsp; The plastic keys on the Spectrum had a tendency to fall off, and retailers expressed failure rates ranging from 5% to as high as 30%.<br /><br /> <h3><strong>ZX Spectrum 128</strong></h3>The Spectrum 128 was an evolution of the ZX Spectrum lineup, sporting 128K RAM, 3 channel audio, MIDI compatibility, a serial port, RGB video out, 32Kb ROM, an improved BASIC editor, and an external keypad. The Spectrum 128 also fixed the \"dot crawl\" problem that earlier units suffered from. It was developed by Sinclair in conjunction with their spanish distributer Investronica. It was unveiled and launched in Spain in 1985 for 44,250 pesatas; the English release was pushed back until 1986 because of unsold Spectrum inventory and retailed for £179.95.&nbsp; The English Spectrum 128 did not include an external keypad and the keypad port was renamed \"AUX.\" The keypad was released separately for £19.95 and did not sell well.<br /><br />The Spectrum 128 suffered from being released after the holiday season to an uninterested public. The new hardware had compatibility issues with old software and peripherals. Months after the Spectrum 128 was launched, Amstrad took over Sinclair's computing business and discontinued the Spectrum 128. It only retailed for about half a year.<br /><br /> <h3><strong>ZX Spectrum&nbsp; 2</strong></h3>The <a href=\"http://www.giantbomb.com/amstrad/65-3924/\"> Amstrad</a> ZX Spectrum 2 was the first Spectrum-branded computer released after Amstrad acquired the Sinclair brand and computing business. It was released in 1987 for £139–£149 and marked a huge turning point for the Spectrum brand.&nbsp; It was the first Spectrum to be released with a proper spring-loaded keyboard, two joystick ports, and a built in tape recorder. The case is dark gray and similar to the <a href=\"http://www.giantbomb.com/amstrad-cpc/60-11/\"> Amstrad CPC</a> 464.&nbsp;<br />&nbsp;<br />The computer was also released in black as the <strong>ZX Spectrum&nbsp; 2A</strong> with the revised motherboard of the Spectrum&nbsp; 3.&nbsp; The internals were similar to those of the Spectrum 128, except the ROM was changed around a bit causing further incompatibility issues. A <strong>ZX Spectrum&nbsp; 2B</strong> followed in late 1987 when manufacturing of the machine moved from Hong Kong to Taiwan, but the internals remained identical.&nbsp;But before they&nbsp;made these&nbsp;in taiwan&nbsp;they made these in the uk<br /><br />The Spectrum&nbsp; 2 was the first Spectrum marketed almost exclusive as a game machine, and as a result it sold very well. One of the Spectrum&nbsp; 2 bundles was the <a href=\"http://www.giantbomb.com/james-bond-007/61-7365/\"> James Bond 007</a> Action Pack, which game with a <a href=\"http://www.giantbomb.com/light-gun/92-2354/\"> light gun</a> and <a href=\"http://www.giantbomb.com/james-bond/62-369/\"> James Bond</a> games.<br /><br /> <h3>ZX Spectrum&nbsp; 3</h3>The Spectrum&nbsp; 3 marks the final and most advanced Spectrum computer, and was released in 1987 for £249, with a price drop bringing it down to £199. It remained in production until 1990. It featured a 3\" floppy disk drive, a parallel print port, and a new ROM. The Spectrum&nbsp; 3 also had a revised motherboard with drastically fewer chips than previous models. Continuing the trend of new Spectrum models, this more advanced computer was even more severely incompatible with old software and hardware. The 3\" floppy drive used proprietary Amstrad disks and the computer as a whole was drastically overpriced compared to more advanced competing computers at the time such as the the <a href=\"http://www.giantbomb.com/amiga/60-1/\"> Amiga</a> 500.<br /><br />Like the Spectrum&nbsp; 2, the Spectrum&nbsp; 3 was marketed as game device and sold in various \"action packs\" however it did not enjoy nearly the same success as its predecessor.&nbsp; The incompatibilities, 3\" Amstrad floppy drive, and most importantly death of the 8-bit computer market all contributed to the computer's eventual failure and the end of the Spectrum line.<br /><br /> <h3>Clones</h3>The ZX Spectrum is perhaps the most cloned computer line in all history. Sinclair licensed the Spectrum's design to Timex and a North American derivative named the Timex Sinclair 2068 was released. This \"official\" clone was largely incompatible with Sinclair software and within two years of the Timex-Sinclair partnership, Timex dropped out due to huge losses. Many more illegal clones were produced in countries such as the <a href=\"http://www.giantbomb.com/soviet-union/95-507/\"> USSR</a>, Czechoslovakia, Romania, <a href=\"http://www.giantbomb.com/hong-kong/95-1083/\"> Hong Kong</a>, <a href=\"http://www.giantbomb.com/argentina/95-2867/\"> Argentina</a>, <a href=\"http://www.giantbomb.com/brazil/95-720/\"> Brazil</a> and Spectrum clones continue to be produced in <a href=\"http://www.giantbomb.com/russia/95-38/\"> Russia</a>. The SAM Coupe is often considered a Spectrum clone because of its emulated Spectrum compatibility, as well as the fact it was produced by a Spectrum peripheral manufacturer. Dozens of clones and variants of the ZX Spectrum are known to exist.<br /><br /> <h2>Software</h2>The ZX Spectrum had a very simple architechture but an extraordinarily diverse software library consisting of over 14,000 titles. Software applications included programming language implementations, Sinclair BASIC extensions, word processors, databases, office software, artist tools, music composition, and a great deal of games.&nbsp; Spectrum software was originally distributed on cassette tapes, read in with the tape recorder expansion.&nbsp; Load times were very long and could be anywhere from 3-12 minutes depending on the size of the program.&nbsp; While data on cassettes was reliable and widely used, the release of the Spectrum 3 with its build in floppy drive brought about around 700 floppy disk titles to the Spectrum's library throughout the decade after its release.<br /><br /> <h3>Notable Games</h3> <ul class=\"plain-list\"> <li><a href=\"http://www.giantbomb.com/3d-deathchase/61-7959/\"> 3D Deathchase</a></li> <li>All or Nothing</li> <li><a href=\"http://www.giantbomb.com/batman-the-movie/61-16034/\"> Batman: The Movie</a></li> <li><a href=\"http://www.giantbomb.com/boulder-dash/61-2991/\"> Boulder Dash</a></li> <li><a href=\"http://www.giantbomb.com/chase-hq/61-13281/\"> Chase H.Q.</a></li> <li><a href=\"http://www.giantbomb.com/dizzy-the-ultimate-cartoon-adventure/61-8827/\"> Dizzy</a></li> <li><a href=\"http://www.giantbomb.com/head-over-heels/61-7068/\"> Head Over Heels</a></li> <li><a href=\"http://www.giantbomb.com/jet-set-willy/61-5005/\"> Jet Set Willy</a></li> <li><a href=\"http://www.giantbomb.com/magicland-dizzy/61-3209/\"> Magicland Dizzy</a></li> <li><a href=\"http://www.giantbomb.com/manic-miner/61-17856/\"> Manic Miner</a></li> <li><a href=\"http://www.giantbomb.com/midnight-resistance/61-7405/\"> Midnight Resistance</a></li> <li><a href=\"http://www.giantbomb.com/operation-wolf/61-14869/\"> Operation Wolf</a></li> <li><a href=\"http://www.giantbomb.com/r-type/61-13745/\"> R-Type</a></li> <li><a href=\"http://www.giantbomb.com/rainbow-islands/61-10764/\"> Rainbow Islands</a></li> <li><a href=\"http://www.giantbomb.com/rebelstar/61-18455/\"> Rebelstar</a></li> <li><a href=\"http://www.giantbomb.com/robocop/61-21323/\"> RoboCop</a></li> <li><a href=\"http://www.giantbomb.com/robocop-2/61-18433/\"> RoboCop 2</a></li> <li><a href=\"http://www.giantbomb.com/stop-the-express/61-13537/\"> Stop the Express</a></li> <li><a href=\"http://www.giantbomb.com/target-renegade/61-9769/\"> Target: Renegade</a></li> <li><a href=\"http://www.giantbomb.com/the-sentinel/61-4798/\"> The Sentinel</a></li> <li><a href=\"http://www.giantbomb.com/tll-tornado-low-level/61-7275/\"> Tornado Low Level</a></li></ul><br /> <h2>Peripherals</h2>A few first party peripherals were released for the ZX Spectrum including:<br /><br /><em>ZX Printer</em> - This was already on the market when the Spectrum was released.&nbsp; It was a ZX81 printer backwards compatible with the Spectrum.<br /><em>ZX Interface 1</em> - An interface that added 8KB of ROM, a serial port, a LAN interface called ZX Net, and an interface for up to 8 ZX Microdrives, a propriety form of fast tape storage.<br /><em>ZX Interface 2</em> - An interface that added 2 controller ports and a ROM cartridge slot which had instant loading.&nbsp; Only 10 games were commercially produced on ROM cartridges.<br /><em>ZX Microdrive</em> - A small, fast, and somewhat unreliable tape-roll storage medium released by Sinclair.<br /><br />A very popular third party peripheral was the <em>Kempston Joystick Interface</em>. It allowed the user of controllers complying with the Atari 2600 standard to be used in Spectrum games and was greatly supported. Many other peripherals were released such as disk drives, controller interfaces, serial interfaces, RAM upgrades, speech synthesizers, a drum kit and even a modem.<a href=\"http://en.wikipedia.org/wiki/Kempston_interface\" rel=\"nofollow\"> </a><a href=\"http://en.wikipedia.org/wiki/SAM_Coup%C3%A9\" rel=\"nofollow\"> </a>","deck":"The ZX Spectrum is one of the most popular European computers of all time.  Its software library is enormous and its fame in Europe rivals the Commodore 64 in the US.","company":{"api_detail_url":"http://api.giantbomb.com/company/938/","id":938,"name":"Sinclair Research Ltd."},"install_base":0,"site_detail_url":"http://www.giantbomb.com/zx-spectrum/60-16/","id":16,"api_detail_url":"http://api.giantbomb.com/platform/16/","abbreviation":"SPEC","online_support":false,"date_added":"2008-04-01 01:32:49","image":{"icon_url":"http://media.giantbomb.com/uploads/0/25/176104-zxspectrum48k_icon.jpg","medium_url":"http://media.giantbomb.com/uploads/0/25/176104-zxspectrum48k_small.jpg","tiny_url":"http://media.giantbomb.com/uploads/0/25/176104-zxspectrum48k_tiny.jpg","small_url":"http://media.giantbomb.com/uploads/0/25/176104-zxspectrum48k_small.jpg","thumb_url":"http://media.giantbomb.com/uploads/0/25/176104-zxspectrum48k_thumb.jpg","screen_url":"http://media.giantbomb.com/uploads/0/25/176104-zxspectrum48k_screen.jpg","super_url":"http://media.giantbomb.com/uploads/0/25/176104-zxspectrum48k_super.jpg"},"release_date":"1982-04-23 00:00:00","name":"ZX Spectrum"}