{"original_price":1300,"date_last_updated":"2012-08-30 12:02:12","description":"<h2>How It All Started</h2>&nbsp;<br /> <div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"1293607\"><div class=\"wiki-img-left\"><div class=\"wiki-img-thumb\"><a href=\"http://media.giantbomb.com/uploads/1/15600/1293607-wozniak_and_jobs_super.jpg\" title=\" Jobs and Wozniak\"><img id=\"1293607\" src=\"http://media.giantbomb.com/uploads/1/15600/1293607-wozniak_and_jobs_thumb.jpg\" alt=\" Jobs and Wozniak\" /></a><div class=\"item-caption\"> Jobs and Wozniak</div></div></div></div>     The \"Apple ][\" as it was initially branded was released in 1977 and was the follow-up effort to the Apple-1 which was born from the mind of one <a href=\"/steve-wozniak/72-93519/\">                         Steve Wozniak</a>. Even before fully completing the Apple-1 though, Wozniak was already dreaming of bigger and better things. A major goal he set in creating his next machine--the Apple ][--was to have it display in color. As he worked with potential hardware changes he began to realize the potential of the Apple ][ more and more. His previous experience with the game <a href=\"/breakout/61-13049/\">                Breakout</a> on the <a href=\"/atari-2600/60-40/\">               Atari 2600</a> motivated Wozniak to essentially ensure the Apple ][ could be a great gaming machine. After Wozniak set up the new computer to display in color, he naturally continued on to add sound and then paddle control to the Apple ][. The Apple ][ was now a full blown gaming machine. <br />&nbsp;<br />Though the designs of the Apple-1 and later the Apple ][ were basically Steve Wozniak's efforts alone, <a href=\"/steve-jobs/72-9951/\">                        Steve Jobs</a> played a very important role in establishing the visual appearance of the Apple ][. While Wozniak wouldn't think twice about extra wires hanging about on a computer that worked, Jobs knew how to make an appealing package for people outside the once very niche computer enthusiast group. The Apple ][ was made to look quite different from other similar machines on the market. It had a much more user-friendly aesthetic. It almost looked like a <a href=\"/typewriter/93-524/\">              typewriter</a> but at the same time was \"futuristic\" enough to clearly be seen as a computer. The case was user-friendly as well. It was easily removable which was rare at the time. Most similar devices warned against any type of self-service and didn't welcome exploration. <br />&nbsp; <br /><h2>The Apple ][ and Gaming</h2>Since Steve Wozniak designed the Apple ][ to be a gaming machine, it ended up being really successful as one. There were   <div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"643363\"><div class=\"wiki-img-right\"><div class=\"wiki-img-thumb\"><a href=\"http://media.giantbomb.com/uploads/0/7621/643363-mystery_house___apple_ii_render_emulation___2_super.png\" title=\" This... is Mystery House.\"><img id=\"643363\" src=\"http://media.giantbomb.com/uploads/0/7621/643363-mystery_house___apple_ii_render_emulation___2_thumb.png\" alt=\" This... is Mystery House.\" /></a><div class=\"item-caption\"> This... is Mystery House.</div></div></div></div>      countless games either designed specifically for the Apple ][ or ported over from <a href=\"/arcade/60-84/\">             arcade</a> versions or other systems versions over the years. One of the most important games to come from the Apple ][ early on though was a game called <a href=\"/mystery-house/61-2744/\">                                         Mystery House</a>. This was the first adventure style game to feature graphics of any kind. all previous games of this style were purely <a href=\"/text-based/92-2199/\">            text based</a>. A worthwhile side note is that Mystery House was created by <a href=\"/ken-williams/72-928/\">          Ken</a> and <a href=\"/roberta-williams/72-2073/\">           Roberta Williams</a> who went on to start the company <a href=\"/sierra-entertainment-inc/65-1030/\">                                        Sierra Entertainment, Inc.</a> As previously mentioned, there were many ports of games that came to the Apple ][. Just a few of these titles include popular games such as: <br /><ul class=\"plain-list\"><li><a href=\"/paperboy-rampage/61-9961/\">                                   Paper Boy</a></li><li><a href=\"/dig-dug/61-2587/\">                                  Dig Dug</a></li><li><a href=\"/donkey-kong/61-311/\">                                 Donkey Kong</a></li><li><a href=\"/maniac-mansion/61-2037/\">                                Maniac Mansion</a></li><li>(Giant Bomb favorite) <a href=\"/bad-dudes/61-10261/\">                               Bad Dudes</a>(!)</li><li>&nbsp;A Mind Forever Voyaging</li><li>Aliens:The computer game</li><li>Arkanoid</li><li>Arkanoid II</li><li>Dynasty</li><li>Depth Charge</li><li>F-15 Strike Eagle</li><li>Impossible Mission</li><li>Impossible Mission II</li><li>&nbsp;Prince of Persia</li><li>Star Trek: The Kobayashi Alternative&nbsp; <br /></li></ul>&nbsp;&nbsp; Most commercial software was provided on 5.25\" floppy diskettes, but the earliest and cheapest disk  drives of the era could only read one side at a time.&nbsp; This resulted in larger games being shipped on multiple, more expensive double-sided diskettes, and because there was no hard drive to install the software on to it, prompts would appear instructing the user when to swap or flip the diskettes to continue. <br />&nbsp;<br />Even though the graphics were often pared down as the Apple ][ became older, it still provided Apple owners with roughly the same experience of these games. The Apple ][, along with machines like the <a href=\"/amiga/60-1/\">                            Amiga</a>, the <a href=\"/atari-8-bit/60-24/\">                           Atari 400 and 800</a>, and the <a href=\"/commodore-64/60-14/\">                          Commodore 64</a> (to an extent), single-handedly drove the microcomputer gaming era beginning in the late 70s.&nbsp; <br />&nbsp;<br /><h2>Hardware Details</h2>The Apple ][ was a very versatile computer in terms of hardware <i>and</i> software. The Apple ][ was actually the leader as a platform for launching new and unique hardware gadgets for quite some time after its initial launch in 1977. The popularity of the Apple ][ series kept it on the cutting edge of hardware/peripheral development until about 1991. That's nearly 15 years of hardware development for a single platform.&nbsp; Standard hardware components were included the Apple ][, such as   keyboard, RAM, CPU, etc. The first Apple ][ models were built and   shipped with 4K of memory, upgradable via expansion ports up to 48K. The   Apple ]['s various expansion ports proved very useful for the many   possible hardware upgrades to come in the future.&nbsp;&nbsp; <br />&nbsp;<br />Hardware expansions were very common despite not always being very compatible or universal. Some of the general \"upgrades\" one could purchase and install included: <br /><ul class=\"plain-list\"><li>Interface Cards</li><li>Video Cards</li><li>ROM/RAM expansion cards</li><li>Co-Processors</li><li>Accelerators</li><li>Printers</li><li>Alternate Input Devices (joysticks, paddles, etc.)</li><li>and many more...</li></ul>&nbsp; <br /> The earliest Apple ][ keyboards are notable for not having a CAPS LOCK  key, because the system typeface included in ROM had no lower-case  letters. Graphical fonts could be used by applications to overcome this  limitation, as the keyboard did have a Shift function for typing symbols  placed above the number row.&nbsp; <br />&nbsp;<br />The Apple logo on the case was emblazoned with a rainbow of stripes to  signify the system's ability to produce color.&nbsp; Display monitors sold with the Apple ][ were generally monochrome, commonly in green or amber.&nbsp; The video capabilities of the system, however, were based on the NTSC video standard.&nbsp; Hooking up a normal household television to the computer would allow for compatible games and applications to display in a small but variable color palette, depending on the video mode used and the technique of signal modulation. <br />&nbsp; <h2>Hardware Evolution and New Models<br /></h2><h3>Apple ][ Plus   </h3><div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"1296890\"><div class=\"wiki-img-right\"><div class=\"wiki-img-thumb\"><a href=\"http://media.giantbomb.com/uploads/0/7464/1296890-apple3_super.jpg\" title=\" The Apple II Plus\"><img id=\"1296890\" src=\"http://media.giantbomb.com/uploads/0/7464/1296890-apple3_thumb.jpg\" alt=\" The Apple II Plus\" /></a><div class=\"item-caption\"> The Apple II Plus</div></div></div></div>   &nbsp;  <br />The Apple ][ Plus  hardware was introduced to market in June 1979. Upgraded features included a ROM-integrated version of the Applesoft II BASIC programming language (supplied by Microsoft), and a much larger 48K bank of RAM now expandable to 64K. <br />The inclusion of the BASIC programming language in every model sold, rather than having to purchase it separately, provided a greater&nbsp; opportunity for every end user to explore programming and naturally game development on the system. Computer enthusiast magazines of this era would often include several pages of BASIC code that a user would painstakingly type in by hand, to run various utility or entertainment programs, some even including primitive graphics. In the event of an error in the printed code, a user could attempt debugging, or simply wait for the next magazine issue to print a correction.","deck":"Introduced at the West Coast Computer Faire in 1977,the Apple II was the first mass produced microcomputer on the market, becoming very popular in classrooms throughout the 1980's and 1990's. It was a very capable gaming machine as well.Somewhere between five and six million Apple II series computers were sold.","company":{"api_detail_url":"http://api.giantbomb.com/company/5815/","id":5815,"name":"Apple Inc."},"install_base":6000000,"site_detail_url":"http://www.giantbomb.com/apple-ii/60-12/","id":12,"api_detail_url":"http://api.giantbomb.com/platform/12/","abbreviation":"APL2","online_support":false,"date_added":"2008-04-01 01:32:49","image":{"icon_url":"http://media.giantbomb.com/uploads/0/26/10074-apple_ii_large_icon.jpg","medium_url":"http://media.giantbomb.com/uploads/0/26/10074-apple_ii_large_small.jpg","tiny_url":"http://media.giantbomb.com/uploads/0/26/10074-apple_ii_large_tiny.jpg","small_url":"http://media.giantbomb.com/uploads/0/26/10074-apple_ii_large_small.jpg","thumb_url":"http://media.giantbomb.com/uploads/0/26/10074-apple_ii_large_thumb.jpg","screen_url":"http://media.giantbomb.com/uploads/0/26/10074-apple_ii_large_screen.jpg","super_url":"http://media.giantbomb.com/uploads/0/26/10074-apple_ii_large_super.jpg"},"release_date":"1977-06-06 00:00:00","name":"Apple II"}