{"original_price":299,"date_last_updated":"2012-09-24 15:57:54","description":"<p>The Sony PlayStation (common abbreviations are PS, PS1, PSone, and PSX) is a video game console that was released by <a href=\"http://www.giantbomb.com/sony-computer-entertainment-america/65-313/\">Sony Computer Entertainment</a> in <a href=\"http://www.giantbomb.com/north-america/95-1664/\">North America</a> on September 9, 1995. The PlayStation was the first of <a href=\"/sony-computer-entertainment-incorporated/65-995/\">Sony Computer Entertainment's</a> game consoles. The Playstation was the predecessor to the <a href=\"http://www.giantbomb.com/playstation-2/60-19/\">PlayStation 2</a>, <a href=\"http://www.giantbomb.com/psp/60-18/\">PlayStation Portable</a>, and <a href=\"http://www.giantbomb.com/playstation-3/60-35/\">PlayStation 3</a> and now <a href=\"/playstation-vita/60-129/\">Playstation Vita</a>.</p><h2>Development</h2><p>The development of the PlayStation actually began before the 16-bit era. At that time, Nintendo wanted to experiment with the CD-Rom media for use on the Famicom, but encountered a few problems. Nintendo finally decided to work with Sony, one of the creators of the CD-Rom (with Phillips) to produce a CD add-on to the <a href=\"/snes/60-9/\">Super Nintendo</a>, named the SNES-CD. A contract was signed in 1988, and Sony began work on the product. Initially, the partnership was supposed to be announced at CES 1991, but while reviewing the first contract, <a href=\"/hiroshi-yamauchi/72-615/\">Hiroshi Yamauchi</a> found out that Sony would entirely handle every title release on the console. <a href=\"/nintendo/65-90/\">Nintendo</a> then secretly canceled the deal, and at CES, announced that they were working to bring Nintendo franchises on Phillips’ own console, the <a href=\"/cd-i/60-27/\">CD-i</a>. This proved to be a bad decision on Nintendo's part as every game that used those properties were poorly received by both gamers and critics.</p><p><a href=\"/ken-kutaragi/72-48015/\">Ken Kutaragi</a>, president of Sony later dubbed the “The Father of the PlayStation”, was angered by the turn of events. He even declared in Japanese that they would bury Nintendo. After this, Sony considered abandoning the whole project, which would have lost millions of dollars. Instead, they decided to take everything they learned while developing the console to create their own stand-alone video game system. In 1992, Sony signed a deal that would allow their new console to still be able to play SNES games, with Nintendo maintaining the rights to the game. However, Sony decided to abandon this idea and began reworking their concept for a video game system. They now were aiming for the next-generation of consoles and <a href=\"/3d/92-1430/\">3D</a> gaming, making the contract they signed with Nintendo irrelevant. Nintendo tried to prevent the release of the PlayStation with a lawsuit in 1991, claiming they essentially owned the name, but this tactic did not work.</p><p>The final version of the PlayStation took about 6 months to develop. Selling the console to publishers and developers was not an easy task for two reasons. One, Sony had to contend with the success of Nintendo and Sega at that time. Two, the PlayStation was a CD-based video game system, and so far none of them had been successful. Yet, when Sony showed them tech demos of the 3D capabilities of the system, gaming publishers and developers were sold on the console. At <a href=\"/e3-1995/92-3482/\">E3 1995</a>, the first Electronic Entertainment Expo, Sony announced the price point of $299.</p><h2>Launch</h2><p>The console was first released in Japan, on December 3rd 1994, over 9 months before it would appear officially in the west. This fueled a massive import market in Europe and the US prior to it's official release there. The release date of the console in North America was September 9th 1995, in order to compete with the <a href=\"/saturn/60-42/\">Sega Saturn</a> and its supposed “Saturnday” September 2nd release. Its launch was accompanied by the advertising campaign “U R Not E” with the E printed in red, symbolizing the “9th of September”. Launch titles were:</p><ul><li><a href=\"http://www.giantbomb.com/battle-arena-toshinden/61-5238/\">Battle Arena Toshinden</a></li><li><a href=\"http://www.giantbomb.com/espn-extreme-games/61-1870/\">ESPN Extreme Games</a></li><li><a href=\"http://www.giantbomb.com/kileak-the-dna-imperative/61-14799/\">Kileak: The DNA Imperative</a></li><li><a href=\"http://www.giantbomb.com/nba-jam-tournament-edition/61-14792/\">NBA JAM Tournament Edition</a></li><li><a href=\"http://www.giantbomb.com/power-serve-3d-tennis/61-18631/\">Power Serve 3D Tennis</a></li><li><a href=\"http://www.giantbomb.com/the-raiden-project/61-15131/\">The Raiden Project</a></li><li><a href=\"http://www.giantbomb.com/rayman/61-18473/\">Rayman</a></li><li><a href=\"http://www.giantbomb.com/ridge-racer/61-2158/\">Ridge Racer</a></li><li><a href=\"http://www.giantbomb.com/street-fighter-the-movie/61-3760/\">Street Fighter: The Movie</a></li><li><a href=\"http://www.giantbomb.com/total-eclipse-turbo/61-22915/\">Total Eclipse Turbo</a></li></ul><p>The European release followed soon after, on September 29th, by which time more games were already available for purchase, including the enigmatic <a href=\"http://www.giantbomb.com/wipeout/61-9707/\">Wipeout</a>. A platform exclusive title, that would take center stage in securing the 'cool' image of the Playstation brand.</p><p>The PlayStation had an interesting pre-order plan; people who reserved the console before its release would receive a compact disc which could be played in any standard Audio-CD player. When the consumer received their PlayStation, putting the compact disc in the console would reveal it was a demo disc; the first in a very long line. While the launch line-up for the PlayStation wasn’t the strongest ever, the following month would prove to be very important with the release of big titles, such as <a href=\"http://www.giantbomb.com/warhawk/61-17169/\">Warhawk</a>, <a href=\"http://www.giantbomb.com/twisted-metal/61-12318/\">Twisted Metal</a>, and of course, <a href=\"http://www.giantbomb.com/tekken/61-10081/\">Tekken</a>.</p><h2>History</h2><p>Before the system was launched, <a href=\"/bernard-stolar/72-33719/\">Bernard “Bernie” Stolar</a> was made the first executive vice-president of <a href=\"/sony-computer-entertainment-america/65-313/\">SCEA</a>. With him, he installed policies for games that were eligible release to the PlayStation in North America: 2D games and RPGs were not allowed. Stolar felt that 2-dimensonal games should be excluded because the console was made especially for 3D gaming, and because of the 16bit was near its end and 2D gaming was heavily associated with it. Stolar felt that RPGs should not be released in the US because the US audience did not enjoy that type of game, and sales in North America proved this. Stolar would leave SCEA after the first holiday of the system's existence. He moved to <a href=\"/sega/65-62/\">Sega</a> and began work on its new-console, the <a href=\"http://www.giantbomb.com/saturn/60-42/\">Saturn</a>, with those same policies. Stolar's departure from SCEA opened the door to one of the most important games of the PlayStation era: <a href=\"http://www.giantbomb.com/final-fantasy-vii/61-13053/\">Final Fantasy VII</a>.</p><p>Before Final Fantasy VII, <a href=\"/square-enix/65-104/\">Square</a> developed every game of the <a href=\"/final-fantasy/62-194/\">Final Fantasy series</a> for the Nintendo consoles. When Nintendo released the <a href=\"/nintendo-64/60-43/\">Nintendo 64</a>, Square was skeptical of its cartridge system; cartridges cost more to produce and had less storage space than a CD-Rom. Considering the costs of their new project, Square had to make a hard decision and announced on January 12th, 1996 that they would only develop for Sony consoles from now on. This policy remained in place until the release of <a href=\"/final-fantasy-crystal-chronicles/61-15672/\">Final Fantasy: Crystal Chronicles</a>, in 2003. Final Fantasy VII was released in Japan January 31st 1997, and helped the PlayStation achieve mainstream popularity; it would impact pop culture in both the United States and Japan. The game also helped RPGs regain popularity, and inspired many role-playing games released during the following years.</p><h2>PSone</h2><p>In July 7th 2000, Sony released a new version of its console under the name PSone. The console was 50% smaller than the original PlayStation, and went on to outsell every other system on the market from throughout the rest of the year, including the PlayStation 2, released on October 26th. In fact, the PlayStation became the first video game console to ship 100 million units worldwide. The system was finally discontinued on March 23rd 2006, more than ten years after its launch. In the end, the PlayStation sold 102 million units, with 28 million being from the PSone redesign; thus, judging by sales and units sold, it clearly “won” the fifth generation of video game consoles.</p><p>Eventually the PSone received a LCD screen add-on, which made the system semi-portable.</p><h2>Controller</h2><h3>Original Controller</h3><div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"281220\"><div class=\"wiki-img-right\"><div class=\"wiki-img-thumb\"><a href=\"http://media.giantbomb.com/uploads/0/8619/281220-psx_a_super.jpg\" title=\"Dual Analog\"><img id=\"281220\" src=\"http://media.giantbomb.com/uploads/0/8619/281220-psx_a_thumb.jpg\" alt=\"Dual Analog\" /></a><div class=\"item-caption\">Dual Analog</div></div></div></div><div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"281217\"><div class=\"wiki-img-left\"><div class=\"wiki-img-thumb\"><a href=\"http://media.giantbomb.com/uploads/0/8619/281217-playstation_controller_super.jpg\" title=\"Original Controller\"><img id=\"281217\" src=\"http://media.giantbomb.com/uploads/0/8619/281217-playstation_controller_thumb.jpg\" alt=\"Original Controller\" /></a><div class=\"item-caption\">Original Controller</div></div></div></div><p>The PlayStation controller was the most symmetrical of the game controllers at the time of its release and it still is in the current generation of game consoles. The use of shapes labels is unique to the PlayStation controller with a square, triangle, cross, and circle on the right side of the controller. The left side of the controller has a standard D-pad and on top of the controller is two buttons on the right and left side (L1, L2, R1, R2). After the release of the Dual Analog controller, there were two analog sticks, one for each of the gamer's thumbs.</p><h3>History</h3><p>The core of the original PlayStation controller design is still used today by the PlayStation 2 and PlayStation 3. The changes to the controller over the 13 years since the original PlayStation launched have been relatively minor. Part way through the life cycle of the PlayStation, Sony introduced the Dual Analog controller, then the <a href=\"http://www.giantbomb.com/dualshock-controller/59-1/\">DualShock controller</a>. The DualShock controller worked on both PlayStation and PlayStation 2. When the PlayStation 3 launched, the controller became wireless and gained the use of the <a href=\"http://www.giantbomb.com/sixaxis-controller/59-9/\">Sixaxis</a> but lost the vibration function that gamers had become familiar with. This was a result of <a href=\"http://en.wikipedia.org/wiki/Immersion_v._Sony\" rel=\"nofollow\">litigation that Sony faced over the vibration technology</a>. Later, with the legal troubles settled, Sony released the <a href=\"http://www.giantbomb.com/dualshock-3/59-29/\">DualShock 3</a> that reintroduced the vibration function.</p><p>PocketStation</p><p>Little afterwards the Playstation was released, <a href=\"http://www.giantbomb.com/sony-computer-entertainment-incorporated/65-995/\">Sony</a> released the <a href=\"/playstation/60-22/\">PocketStation</a>, a portable PS1 that had an infared port to transfer game saves and info to other PocketStations, and it could also download features for PS1 games that weren't featured on the console version.</p><p>Hardware Specifications</p><h3>CPU</h3><p><b>Processor</b></p><ul><li>R3000A 32-bit RISC at 33.8MHz</li><li>Operation Cycle: 30 MIPS</li><li>Bandwidth Bus: 123MB</li><li>Instructional Cache: 4KB</li><li>SRAM Data Cache: 1KB</li></ul><p><b>Co Processors</b></p><p>Geometry Transformation Engine</p><ul><li>Operation Cycle: 66 MIPS</li><li>180,000 Texture Mapped Polygons Per-Second</li><li>360,000 Flat-Shaded Polygons Per-Second</li></ul><p>Data Decompression Engine</p><ul><li>Operation Cycle 80 MIPS</li><li>MJEPG and H. 261 File Decoding</li><li>Direct CPU Bus Connection</li></ul><p><b>Note</b>: The Data Decompression Engine is mainly used to cut back on game loading times.</p><p><b>Graphics</b></p><ul><li>Maximum Colors: 16.7 Million (Tru-Color)</li><li>Maximum Sprites: 4000</li><li>2D Scaling and Rotation</li><li>3D Texture Mapping and Shading</li><li>Transparency and Fading</li><li>Screen Resolution: 256 x 224 - 640 x 480</li><li>Possible AV Outputs: Composite, S-Video, Component (RGB)</li></ul><p><b>Sound</b></p><ul><li>Custom Sound Processing Unit</li><li>24 Channel ADPCM</li><li>Sample Rate 44.1KHz</li></ul><p><b>Memory</b></p><ul><li>Main Memory: 2MB</li><li>Video Memory: 1MB</li><li>Sound Memory: 512K</li><li>Operating System Memory: 512K</li><li>CD Rom Cache Memory: 32K</li></ul><p><b>CD-Rom</b></p><ul><li>XA Mode 2 Capable</li><li>CD-DA Capable (allows Audio CD Playback)</li><li>2x Functioning Speed</li></ul><h2>Best Selling Games</h2><p>The following are the top 10 best selling games for the Playstation that have sold or shipped at least one million copies</p><ol><li><span><i><a href=\"/gran-turismo/61-26842/\">Gran Turismo</a></i> (10.85 million)</span></li><li><i><a href=\"http://en.wikipedia.org/wiki/Final_Fantasy_VII\" rel=\"nofollow\">Final Fantasy VII</a></i> (10 million)</li><li><i><a href=\"/gran-turismo-2/61-8100/\">Gran Turismo</a></i> (9.37 million)</li><li><i><a href=\"http://en.wikipedia.org/wiki/Final_Fantasy_VIII\" rel=\"nofollow\">Final Fantasy VIII</a></i> (8.15 million)</li><li><i><a href=\"/tomb-raider-ii/61-337/\">Tomb Raider II</a><a href=\"/final-fantasy-viii/61-12277/\">/final-fantasy-viii/61-12277/</a></i> (8 million)</li><li><i><a href=\"http://en.wikipedia.org/wiki/Metal_Gear_Solid\" rel=\"nofollow\">Metal Gear Solid</a></i> (7 million)</li><li><i><a href=\"/tomb-raider/61-3023/\">Tomb Raider</a></i>(7 million)</li><li><i><a href=\"/crash-bandicoot/61-7380/\">Crash Bandicoot</a></i> (6.8 million)</li><li><i><a href=\"/crash-bandicoot-warped/61-12909/\">Crash Bandicoot 3: Warped</a></i> (5.7 million)</li><li><i><a href=\"/final-fantasy-ix/61-8825/\">Final Fantasy IX</a></i> (5.30 million)</li></ol>","deck":"Sony's first video game console established the PlayStation brand. It was also the first successful disc-based console.","company":{"api_detail_url":"http://api.giantbomb.com/company/995/","id":995,"name":"Sony Computer Entertainment Incorporated"},"install_base":102490000,"site_detail_url":"http://www.giantbomb.com/playstation/60-22/","id":22,"api_detail_url":"http://api.giantbomb.com/platform/22/","abbreviation":"PS1","online_support":false,"date_added":"2008-04-01 01:32:51","image":{"icon_url":"http://media.giantbomb.com/uploads/0/1992/1426393-logo_icon.jpg","medium_url":"http://media.giantbomb.com/uploads/0/1992/1426393-logo_small.jpg","tiny_url":"http://media.giantbomb.com/uploads/0/1992/1426393-logo_tiny.jpg","small_url":"http://media.giantbomb.com/uploads/0/1992/1426393-logo_small.jpg","thumb_url":"http://media.giantbomb.com/uploads/0/1992/1426393-logo_thumb.jpg","screen_url":"http://media.giantbomb.com/uploads/0/1992/1426393-logo_screen.jpg","super_url":"http://media.giantbomb.com/uploads/0/1992/1426393-logo_super.jpg"},"release_date":"1995-09-09 00:00:00","name":"PlayStation"}