{"original_price":800,"date_last_updated":"2012-09-18 13:41:14","description":"<h3>CPC 464</h3><p>The Amstrad CPC 464 was the first of the CPC series released on the 21st June 1984, it was one of the most successful home computers in Europe. More than two million computers were sold in total.</p><p>Despite its lack of stand out features from competitors such as Commodore and Sinclair, it gained popularity from its low price and the fact that the computers were sold as a complete unit, comprising of CPU/keyboard, built in tape recorder and monitor (optional monochrome green or colour).</p><h3>CPC 427</h3><div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"815411\"><div class=\"wiki-img-right\"><div class=\"wiki-img-thumb\"><a href=\"http://media.giantbomb.com/uploads/0/1270/815411-800px_cpc_472_es_super.jpg\" title=\"CPC 472\"><img id=\"815411\" src=\"http://media.giantbomb.com/uploads/0/1270/815411-800px_cpc_472_es_thumb.jpg\" alt=\"CPC 472\" /></a><div class=\"item-caption\">CPC 472</div></div></div></div><p>The CPC 472 was a Spanish version of the CPC 464 with an additional, non-functional 8KB RAM. A Spanish law required that every computer with up to 64KB should have extra keys for the Spanish language, or an extra tax would be levied. So Amstrad soldered in an extra 8kb which was not, however, usable by the machine since it was not connected to anything else. Later on Amstrad released a 472 with a proper Spanish keyboard. After the rule changed there was also a CPC472 with non-Spanish keys available for a very short time. The CPC 472 is very rare.</p><h3>CPC 664</h3><div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"815412\"><div class=\"wiki-img-right\"><div class=\"wiki-img-thumb\"><a href=\"http://media.giantbomb.com/uploads/0/1270/815412-cpc664_super.jpg\" title=\"CPC 664\"><img id=\"815412\" src=\"http://media.giantbomb.com/uploads/0/1270/815412-cpc664_thumb.jpg\" alt=\"CPC 664\" /></a><div class=\"item-caption\">CPC 664</div></div></div></div><p>Released in In June 1985, the CPC664 is esentialy the same hardware as the previous CPC464 with a Floppy disc drive taking ther place of the cassette drive and a new easier to type keyboard.</p><h3>CPC 6128</h3><div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"815415\"><div class=\"wiki-img-right\"><div class=\"wiki-img-thumb\"><a href=\"http://media.giantbomb.com/uploads/0/1270/815415-cpc6128_super.jpg\" title=\"CPC 6128\"><img id=\"815415\" src=\"http://media.giantbomb.com/uploads/0/1270/815415-cpc6128_thumb.jpg\" alt=\"CPC 6128\" /></a><div class=\"item-caption\">CPC 6128</div></div></div></div><p>Amstrad launched the CPC 6128 shortly after the CPC 664 for the American market . The new machine had 128k of memory and a sleeker appearance, but was otherwise identical to the 664.</p><p>The machine was launched in Europe shortly afterwards, replacing the 664 for the same price.</p><h3>The Plus Series</h3><p>The last models in the Amstrad CPC range were the Amstrad 464 Plus and Amstrad 6128 Plus, launched together in 1990. The CPC name is said to have been dropped because of a legal dispute with a French firm, though it is also likely that \"CPC 6128 Plus\" was considered too unwieldy a name and one redolent of the machine's mid-80s heritage.</p><p>Described as a solution of 'too little, too late', this was Amstrad's second effort to prolong the life of its 8-bit computer series in the face of fierce competition from new 16-bit machines (notably, the Atari ST and the Commodore Amiga). The Plus series were mostly (but not quite 100%) compatible with the original CPC computers, and incorporated a list of new features, like a cartridge port for instant program loading, DMA for the AY soundchip, hardware scrolling, programmable interrupts, 16 hardware zoomable sprites (not vectorized) with an independent palette of 15 colours, and a choice of 4096 colours all in a new, sleek case which mimicked the keyboard-computer design that was <em>en vogue</em> in the 16-bit market (ST, Amiga etc). While the Amstrad Plus computers were arguably one of the best 8-bit computers ever built for the mass market, they died an early death as the 16-bit era had well and truly begun.</p>","deck":"The Amstrad CPC was a series of 8-bit personal computers developed by Amstrad in the 1980s in the UK.","company":{"api_detail_url":"http://api.giantbomb.com/company/3924/","id":3924,"name":"Amstrad"},"install_base":3000000,"site_detail_url":"http://www.giantbomb.com/amstrad-cpc/60-11/","id":11,"api_detail_url":"http://api.giantbomb.com/platform/11/","abbreviation":"CPC","online_support":false,"date_added":"2008-04-01 01:32:49","image":{"icon_url":"http://media.giantbomb.com/uploads/0/26/10073-Amstrad_CPC464_icon.jpg","medium_url":"http://media.giantbomb.com/uploads/0/26/10073-Amstrad_CPC464_small.jpg","tiny_url":"http://media.giantbomb.com/uploads/0/26/10073-Amstrad_CPC464_tiny.jpg","small_url":"http://media.giantbomb.com/uploads/0/26/10073-Amstrad_CPC464_small.jpg","thumb_url":"http://media.giantbomb.com/uploads/0/26/10073-Amstrad_CPC464_thumb.jpg","screen_url":"http://media.giantbomb.com/uploads/0/26/10073-Amstrad_CPC464_screen.jpg","super_url":"http://media.giantbomb.com/uploads/0/26/10073-Amstrad_CPC464_super.jpg"},"release_date":"1984-11-02 00:00:00","name":"Amstrad CPC"}