{"original_price":2495,"date_last_updated":"2012-09-20 19:57:51","description":"<h2>History</h2><p>The Macintosh was designed as part of a skunkworks operation originally headed by Jef Raskin. Raskin planned to create an easy to use and affordable appliance computer for use by ordinary people. The project was ongoing at the same time as <a href=\"/apple-inc/65-5815/\">Apple</a> founder <a href=\"/steve-jobs/72-9951/\">Steve Jobs</a> was leading development of Lisa, Apple's intended flagship computer. Despite his heavy involvement in the inital stages of the Lisa project, Jobs eventually caught wind of the Macintosh project and gradually turned his full attention to it. In 1981, Raskin departed the team over a dispute with Jobs, making Steve the de facto leader.</p><p>It was under Jobs that the Mac became a GUI-oriented computer, influenced by a tour given to Apple staff of Xerox's Palo Alto Research Center which included looks at PARC's Alto computer</p><div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"521728\"><div class=\"wiki-img-right\"><div class=\"wiki-img-thumb\"><a href=\"http://media.giantbomb.com/uploads/0/66/521728-macintosh_super.gif\" title=\"The Original Macintosh\"><img id=\"521728\" src=\"http://media.giantbomb.com/uploads/0/66/521728-macintosh_thumb.gif\" alt=\"The Original Macintosh\" /></a><div class=\"item-caption\">The Original Macintosh</div></div></div></div><p>and the related Smalltalk software. The computer eventually released in 1984 as a vertically-oriented all-in-one and was gradually revised over the course of the decade. Eventually, Apple began to offer Macs in different formats, ranging from standard desktops to early laptops and other portable designs.</p><p>The Mac's popularity was at first fairly high, but after Steve Jobs was stripped of power within Apple (Eventually departing to form NeXT), executives who did not fully understand the platform began to devalue it (Notably, Apple was criticized in the nineties for offering an absurd amount of Macs which were too similar and had generic names) and the platform struggled. To compound these problems, Apple's Mac System software (Later Mac OS), the OS powering the Macs, was hopelessly outdated and needed replacing.</p><p>Unfortunately, Apple's internal software R&amp;D had become bloated and ineffectual, stalling development on the next-generation Mac OS codenamed Copland. In 1996, Apple wrote it off as a sinking ship and decided to source the basis for their next-generation operating system from elsewhere. Several options were considered, such as licensing Microsoft's NT architecture and purchasing Be, Inc. for its BeOS. In the end though, it was Apple founder Steve Jobs and his NeXT outfit which Apple decided to buy, allowing them to base what would become OS X (Meaning Ten) on NeXT's powerful and robust NeXTSTEP OS.</p><p>This also brought Jobs back into the company. He quickly assumed control and began to turn the Mac platform around. Jobs trimmed the bloat from the product line and steadily began to focus on releasing stylish computers like the iMac and iBook for consumers and powerhouses for the Mac's creative professional base like the PowerBook and PowerMac lines.</p><div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"428003\"><div class=\"wiki-img-left\"><div class=\"wiki-img-thumb\"><a href=\"http://media.giantbomb.com/uploads/0/66/428003-imac2_super.jpg\" title=\"iMac, Apple's Flagship Mac\"><img id=\"428003\" src=\"http://media.giantbomb.com/uploads/0/66/428003-imac2_thumb.jpg\" alt=\"iMac, Apple's Flagship Mac\" /></a><div class=\"item-caption\">iMac, Apple's Flagship Mac</div></div></div></div><p>Since then, the Mac has become known as a stylish computer for the image conscious, as well as a great tool for artists, writers, film editors and so on. Since approximately halfway through the first decade of the 21st Century, Apple has begun to play up the Mac as a games platform, something for which it had developed a reputation for being poor at. This took several forms, most visibly the appearance of <a href=\"/electronic-arts/65-1/\">EA</a> at an Apple event to promote the fact that they were bringing a number of games to the platform.</p><p>Despite the perception of the Mac as a second-rate games platform (by comparison to the dominant Windows PC), it has played host to a number of popular exclusives, most notably much of <a href=\"/bungie-studios/65-476/\">Bungie's</a> earlier games (before the Microsoft buyout) catalog. In fact, Bungie's <a href=\"/halo-combat-evolved/61-2600/\">Halo</a>, a huge hit for the Xbox, was originally a Mac exclusive. The game later found its way onto Mac as a port of the PC release.</p><h3>Windows Gaming on the Mac</h3><p>On April 5, 2006 Apple released a beta version of a new piece of software called Boot Camp. Due to the recent change in architecture - PowerPC to Intel - Mac and Windows computers were now more similar than ever. Boot Camp embraced this by allowing the user to install Windows on a Mac. Windows XP - and later Windows Vista and 7 - now ran natively on Macintosh computers, making gaming on Mac's easier than ever.</p><p>With the release of Mac OS 10.5 (Leopard), Boot Camp comes pre-installed on all Mac's and is thus officially supported by Apple. Although many Mac users are unwilling to install Windows on their computer, Boot Camp still offers Mac users something they've never had before - the ability to run any PC game 100% natively.</p><h3>Steam for Mac</h3><p>On March 8th, 2010, <a href=\"/valve-corporation/65-1374/\">Valve</a> announced that it would begin a new <a href=\"/steam/92-718/\">Steam</a> program for the Mac. Under this new system, Valve games would be able to run natively on the Mac, and 3rd parties would be able to release a Mac version of their game on Steam. Also announced is a program called Steam Play, where players who buy the Mac version of a game will also be able to download the PC version of the same game free of charge. Steam for Mac was released on May 12, 2010.</p><h3>Mac App Store</h3><p>Mimicking their strategy with the <a href=\"/iphone/60-96/\">iOS</a> platform, Apple has recently added an integrated App Store to the Mac OS. Users can purchase Applications in the same way as on iOS. Apps are then downloaded to a user's system and the App Store App itself keeps track of updates for these Apps. In addition, once an App is purchased, users are free to install it on ever Mac they own simply by logging into the Mac App Store on the machine in question with the same Apple Account, going to the Purchases tab and clicking \"Download\" next to appropriate App.</p><p>This service, just like on iOS, extends to games and already a number of Publishers have made classic and more recent titles available for purchase on the Mac App Store. These games range from recent and current hits to old favourites, to popular indie games like the <a href=\"/penny-arcade-adventures-on-the-rain-slick-precipice-of-darkness-episode-one/61-20696/\">Penny Arcade Adventures</a> episodes and also ports of existing iOS games like <a href=\"/angry-birds/62-1879/\">Angry Birds</a>.</p>","deck":"The Macintosh (Mac) is a personal computer designed and developed by Apple, Inc. - formerly Apple Computer, Inc. It runs an operating system called Mac OS. The current version is Mac OS X Version 10.7 Lion.  ","company":{"api_detail_url":"http://api.giantbomb.com/company/5815/","id":5815,"name":"Apple Inc."},"install_base":0,"site_detail_url":"http://www.giantbomb.com/mac/60-17/","id":17,"api_detail_url":"http://api.giantbomb.com/platform/17/","abbreviation":"MAC","online_support":true,"date_added":"2008-04-01 01:32:50","image":{"icon_url":"http://media.giantbomb.com/uploads/0/5150/1500874-overview_gallery3_20090828_icon.jpg","medium_url":"http://media.giantbomb.com/uploads/0/5150/1500874-overview_gallery3_20090828_small.jpg","tiny_url":"http://media.giantbomb.com/uploads/0/5150/1500874-overview_gallery3_20090828_tiny.jpg","small_url":"http://media.giantbomb.com/uploads/0/5150/1500874-overview_gallery3_20090828_small.jpg","thumb_url":"http://media.giantbomb.com/uploads/0/5150/1500874-overview_gallery3_20090828_thumb.jpg","screen_url":"http://media.giantbomb.com/uploads/0/5150/1500874-overview_gallery3_20090828_screen.jpg","super_url":"http://media.giantbomb.com/uploads/0/5150/1500874-overview_gallery3_20090828_super.jpg"},"release_date":"1984-01-24 00:00:00","name":"Mac"}