{"original_price":600,"date_last_updated":"2012-09-18 13:41:15","description":"<h2>Summary</h2><div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"397494\"><div class=\"wiki-img-right\"><div class=\"wiki-img-thumb\"><a href=\"http://media.giantbomb.com/uploads/0/9565/397494-home_c64_perip_super.jpg\" title=\"\"><img id=\"397494\" src=\"http://media.giantbomb.com/uploads/0/9565/397494-home_c64_perip_thumb.jpg\" alt=\"\" /></a><div class=\"item-caption\"></div></div></div></div><p>The Commodore 64 is an 8-bit home computer released in August of 1982. It was the third Commodore system made by Commodore International. The starting price was $595 USD. It is often called the C64 or C=64 which was due to the fact that the computer boasted 64 kilobytes of RAM; a feature that was superior to most mainstream personal computers at the time.</p><h2>Backstory</h2><p>The Commodore 64 really started development when Commodore Inc bought MOS Technology. Unable to really sell their technology for the mass market MOS Tech approached Commodore in hopes of finding what they could do with their latest 6501 microprocessor. MOS had hoped to sell the microprocessor to console manufactures, but Commodore had other plans. MOS was also eager to sell their new SID sound chip in hopes that partnering with Commodore would give them an edge in the digital sound market. The iconic sound of the MOS SID chip was considered ground breaking at the time and video game sound composers used it to create entire audio tracks for the games they worked on.</p><div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"1134666\"><div class=\"wiki-img-left\"><div class=\"wiki-img-thumb\"><a href=\"http://media.giantbomb.com/uploads/0/8272/1134666-clip_image001_0050_super.jpg\" title=\"Jack Tramiel\"><img id=\"1134666\" src=\"http://media.giantbomb.com/uploads/0/8272/1134666-clip_image001_0050_thumb.jpg\" alt=\"Jack Tramiel\" /></a><div class=\"item-caption\">Jack Tramiel</div></div></div></div><p>However Jack Tramiel, founder of Commodore Business Machines, felt that the microprocessor was perfect for the new line of computers he had in mind. The chip would be the main microprocessor for the VIC-20 which was a massive success. Tramiel wanted to expand in the success of the VIC-20, but wanted his next computer to have a little more power to it while retaining a low price. So on CES 1982 the Commodore 64 was announced to an enthusiastic response.</p><p>When the C64 was first rolled out it had a then unthinkably low $595 price tag. Companies such as Intel and Atari had no idea how Commodore was making money on the computer. In reality an advantage Commodore had was using new and sometimes untested tech for their computer as opposed to licensing older tech from large competing corporations.</p><h2>Reception and Market Share</h2><p>Throughout its 12 year lifespan the C64 sold 30 million units in total. As such it is the best-selling personal computer model of all time. From 1983-1985, the Commodore 64 dominated the personal computer market with a 40% share. It then went on to outsell former market leaders Apple and Intel and led Commodore to winning the personal computer market war. It's successor, the <a href=\"/commodore-128/60-58/\">Commodore 128</a>, was released in 1985 and was fully backwards compatible with most C64 software but was far less successful than the C64.</p><div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"379346\"><div class=\"wiki-img-left\"><div class=\"wiki-img-thumb\"><a href=\"http://media.giantbomb.com/uploads/0/2238/379346-karateka_c64_8_super.png\" title=\"C64 Version of Karateka\"><img id=\"379346\" src=\"http://media.giantbomb.com/uploads/0/2238/379346-karateka_c64_8_thumb.png\" alt=\"C64 Version of Karateka\" /></a><div class=\"item-caption\">C64 Version of Karateka</div></div></div></div><p>In all, about 10,000 software titles were made for the C64. This includes development tools, games, etc. The C64 is used by hobbyists to this day and C64 games are available for purchase on the Wii Shop Channel in Europe and the United States.</p><h2>Hardware Specifications</h2><ul><li><b>CPU</b>: 8-bit MOS Technology 6510, 1.023 MHz</li><li><b>Memory</b>: 64KB RAM</li><li><b>Graphics</b>: MOS Technology VIC-II, 16 colors</li><li><b>Sound</b>: MOS Technology SID 6581/8580</li></ul><h3>SID Music</h3><div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"1303137\"><div class=\"wiki-img-right\"><div class=\"wiki-img-thumb\"><a href=\"http://media.giantbomb.com/uploads/0/9559/1303137-6581_super.jpg\" title=\"SID 6581\"><img id=\"1303137\" src=\"http://media.giantbomb.com/uploads/0/9559/1303137-6581_thumb.jpg\" alt=\"SID 6581\" /></a><div class=\"item-caption\">SID 6581</div></div></div></div><p>The Commodore 64's SID chip played a prominent role in the development of video game music, <a href=\"/chiptune/92-3745/\">chiptunes</a>, and the demo, crack, and warez scenes. SID (itself an acronym for Sound Interface Device) was created by Robert Yannes, an engineer who later moved to the synthesizer industry. Yannes stated that he felt previous computer sound chips had been designed by people who did not understand music, and sought to design a chip that would be useful for musicians. Previously, there had been a single chip for both audio and video, so a dedicated chip for audio provided musicians with much more freedom and range.</p><p>The initial run of the SID chip, the SID 6581, was extremely popular, and instrumental in the success of the Commodore 64. It allowed for much more freedom comparative to previous chips, such as three oscillators, each of which could produce four separate waveforms. Additionally, many composers were able to find loopholes to make their music even more complex, such as a glitch that essentially created a fourth channel for 4-bit samples. Some games that took advantage of this were <a href=\"/impossible-mission/61-14849/\">Impossible Mission</a> and <a href=\"/ghostbusters/61-11874/\">Ghostbusters</a>, both of which used voice samples.</p><div class=\"js-item-cage\" rel=\"image\" title=\"image\" id=\"1843060\"><div class=\"wiki-img-left\"><div class=\"wiki-img-thumb\"><a href=\"http://media.giantbomb.com/uploads/0/7464/1843060-0_super.jpg\" title=\"Many cracktros, such as this one, took advantage of the SID's capabilities\"><img id=\"1843060\" src=\"http://media.giantbomb.com/uploads/0/7464/1843060-0_thumb.jpg\" alt=\"Many cracktros, such as this one, took advantage of the SID's capabilities\" /></a><div class=\"item-caption\">Many cracktros, such as this one, took advantage of the SID's capabilities</div></div></div></div><p>Many well-known composers and developers had their start with the SID chip, such as <a href=\"/rob-hubbard/72-2834/\">Rob Hubbard</a> and <a href=\"/martin-galway/72-5357/\">Martin Galway</a>. These men have contributed to such games as <a href=\"/arkanoid/61-15107/\">Arkanoid</a>, <a href=\"/wizball/61-15894/\">Wizball</a>, <a href=\"/yie-ar-kung-fu/61-15480/\">Yie Ar Kung-Fu</a>, <a href=\"/commando/61-6850/\">Commando</a>, <a href=\"/monty-on-the-run/61-105/\">Monty on the Run</a>, and <a href=\"/skate-or-die/61-8819/\">Skate or Die!</a>. The composition process was initially very rough; composers would have to input a sequence of hexadecimal bytes where each line would describe the note, pitch, length, etc. of the sound being played.</p><p>By the mid-1980s, SID musicians were improving to a point where they could effectively emulate \"real\" music. Games such as <a href=\"/times-of-lore/61-6900/\">Times of Lore</a> were able to use mainstream songs as inspiration, and adapt that to a SID song. Also at this time, demo groups began to rise in popularity, with several Commodore 64 magazines releasing songs from their readers. The impact of SID music is evident as well, with songs still being developed to this day. While many musicians utilize emulation, some continue to use the original SID chips.</p>","deck":"The Commodore 64 was a personal computer that dominated the market from 1983-1985. To this day the Commodore 64 stands as the best selling personal computer ever.","company":{"api_detail_url":"http://api.giantbomb.com/company/2000/","id":2000,"name":"Commodore"},"install_base":30000000,"site_detail_url":"http://www.giantbomb.com/commodore-64/60-14/","id":14,"api_detail_url":"http://api.giantbomb.com/platform/14/","abbreviation":"C64","online_support":false,"date_added":"2008-04-01 01:32:49","image":{"icon_url":"http://media.giantbomb.com/uploads/0/26/10289-c64_icon.jpg","medium_url":"http://media.giantbomb.com/uploads/0/26/10289-c64_small.jpg","tiny_url":"http://media.giantbomb.com/uploads/0/26/10289-c64_tiny.jpg","small_url":"http://media.giantbomb.com/uploads/0/26/10289-c64_small.jpg","thumb_url":"http://media.giantbomb.com/uploads/0/26/10289-c64_thumb.jpg","screen_url":"http://media.giantbomb.com/uploads/0/26/10289-c64_screen.jpg","super_url":"http://media.giantbomb.com/uploads/0/26/10289-c64_super.jpg"},"release_date":"1982-08-23 00:00:00","name":"Commodore 64"}